[Killed] StringLiteral
src/core/i18n.js:25:13
 
 // Supported languages
 export const SUPPORTED_LANGUAGES = [
-    { code: 'en', name: 'English', flag: '🇬🇧' },
+    { code: "", name: 'English', flag: '🇬🇧' },
     { code: 'pt-PT', name: 'Português', flag: '🇵🇹' },
     { code: 'es', name: 'Español', flag: '🇪🇸' },
killedBy: i18n Module SUPPORTED_LANGUAGES should include English as default
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/core/i18n.js:27:42
 export const SUPPORTED_LANGUAGES = [
     { code: 'en', name: 'English', flag: '🇬🇧' },
     { code: 'pt-PT', name: 'Português', flag: '🇵🇹' },
-    { code: 'es', name: 'Español', flag: '🇪🇸' },
+    { code: 'es', name: 'Español', flag: "",
     { code: 'fr', name: 'Français', flag: '🇫🇷' },
     { code: 'de', name: 'Deutsch', flag: '🇩🇪' },
killedBy: i18n Module SUPPORTED_LANGUAGES should have all required language properties
statusReason: expected '' to be truthy

[Killed] StringLiteral
src/core/i18n.js:28:25
     { code: 'en', name: 'English', flag: '🇬🇧' },
     { code: 'pt-PT', name: 'Português', flag: '🇵🇹' },
     { code: 'es', name: 'Español', flag: '🇪🇸' },
-    { code: 'fr', name: 'Français', flag: '🇫🇷' },
+    { code: 'fr', name: "", flag: '🇫🇷' },
     { code: 'de', name: 'Deutsch', flag: '🇩🇪' },
     { code: 'it', name: 'Italiano', flag: '🇮🇹' },
killedBy: i18n Module SUPPORTED_LANGUAGES should have all required language properties
statusReason: expected '' to be truthy

[Killed] StringLiteral
src/core/i18n.js:29:25
     { code: 'pt-PT', name: 'Português', flag: '🇵🇹' },
     { code: 'es', name: 'Español', flag: '🇪🇸' },
     { code: 'fr', name: 'Français', flag: '🇫🇷' },
-    { code: 'de', name: 'Deutsch', flag: '🇩🇪' },
+    { code: 'de', name: "", flag: '🇩🇪' },
     { code: 'it', name: 'Italiano', flag: '🇮🇹' },
     { code: 'nl', name: 'Nederlands', flag: '🇳🇱' },
killedBy: i18n Module SUPPORTED_LANGUAGES should have all required language properties
statusReason: expected '' to be truthy

[Killed] StringLiteral
src/core/i18n.js:30:13
     { code: 'es', name: 'Español', flag: '🇪🇸' },
     { code: 'fr', name: 'Français', flag: '🇫🇷' },
     { code: 'de', name: 'Deutsch', flag: '🇩🇪' },
-    { code: 'it', name: 'Italiano', flag: '🇮🇹' },
+    { code: "", name: 'Italiano', flag: '🇮🇹' },
     { code: 'nl', name: 'Nederlands', flag: '🇳🇱' },
     { code: 'no', name: 'Norsk', flag: '🇳🇴' },
killedBy: i18n Module SUPPORTED_LANGUAGES should have all required language properties
statusReason: expected '' to be truthy

[Killed] ObjectLiteral
src/core/i18n.js:30:5
     { code: 'es', name: 'Español', flag: '🇪🇸' },
     { code: 'fr', name: 'Français', flag: '🇫🇷' },
     { code: 'de', name: 'Deutsch', flag: '🇩🇪' },
-    { code: 'it', name: 'Italiano', flag: '🇮🇹' },
+    {}
     { code: 'nl', name: 'Nederlands', flag: '🇳🇱' },
     { code: 'no', name: 'Norsk', flag: '🇳🇴' },
killedBy: i18n Module SUPPORTED_LANGUAGES should have all required language properties
statusReason: expected undefined to be truthy

[Killed] StringLiteral
src/core/i18n.js:31:13
     { code: 'fr', name: 'Français', flag: '🇫🇷' },
     { code: 'de', name: 'Deutsch', flag: '🇩🇪' },
     { code: 'it', name: 'Italiano', flag: '🇮🇹' },
-    { code: 'nl', name: 'Nederlands', flag: '🇳🇱' },
+    { code: "", name: 'Nederlands', flag: '🇳🇱' },
     { code: 'no', name: 'Norsk', flag: '🇳🇴' },
     { code: 'ru', name: 'Русский', flag: '🇷🇺' }
killedBy: i18n Module SUPPORTED_LANGUAGES should have all required language properties
statusReason: expected '' to be truthy

[Killed] ObjectLiteral
src/core/i18n.js:32:5
     { code: 'de', name: 'Deutsch', flag: '🇩🇪' },
     { code: 'it', name: 'Italiano', flag: '🇮🇹' },
     { code: 'nl', name: 'Nederlands', flag: '🇳🇱' },
-    { code: 'no', name: 'Norsk', flag: '🇳🇴' },
+    {}
     { code: 'ru', name: 'Русский', flag: '🇷🇺' }
 ];
killedBy: i18n Module SUPPORTED_LANGUAGES should have all required language properties
statusReason: expected undefined to be truthy

[Killed] StringLiteral
src/core/i18n.js:32:40
     { code: 'de', name: 'Deutsch', flag: '🇩🇪' },
     { code: 'it', name: 'Italiano', flag: '🇮🇹' },
     { code: 'nl', name: 'Nederlands', flag: '🇳🇱' },
-    { code: 'no', name: 'Norsk', flag: '🇳🇴' },
+    { code: 'no', name: 'Norsk', flag: "",
     { code: 'ru', name: 'Русский', flag: '🇷🇺' }
 ];
killedBy: i18n Module SUPPORTED_LANGUAGES should have all required language properties
statusReason: expected '' to be truthy

[Killed] StringLiteral
src/core/i18n.js:33:42
     { code: 'it', name: 'Italiano', flag: '🇮🇹' },
     { code: 'nl', name: 'Nederlands', flag: '🇳🇱' },
     { code: 'no', name: 'Norsk', flag: '🇳🇴' },
-    { code: 'ru', name: 'Русский', flag: '🇷🇺' }
+    { code: 'ru', name: 'Русский', flag: ""
 ];
 
killedBy: i18n Module SUPPORTED_LANGUAGES should have all required language properties
statusReason: expected '' to be truthy

[Killed] StringLiteral
src/core/i18n.js:33:13
     { code: 'it', name: 'Italiano', flag: '🇮🇹' },
     { code: 'nl', name: 'Nederlands', flag: '🇳🇱' },
     { code: 'no', name: 'Norsk', flag: '🇳🇴' },
-    { code: 'ru', name: 'Русский', flag: '🇷🇺' }
+    { code: "", name: 'Русский', flag: '🇷🇺' }
 ];
 
killedBy: i18n Module SUPPORTED_LANGUAGES should have all required language properties
statusReason: expected '' to be truthy

[Killed] BooleanLiteral
src/core/i18n.js:40:21
 export const DEFAULT_LANGUAGE = 'en';
 
 // Track initialization state
-let isInitialized = false;
+let isInitialized = true;
 let initPromise = null;
 
killedBy: i18n Module initI18n should initialize i18next successfully
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/core/i18n.js:47:39
  * Load translations for a language
  * Fetches from /locales/{lang}.json
  */
-async function loadTranslations(lang) {
-    try {
-        // Handle language codes with regions (e.g., pt-PT -> pt-PT.json)
-        const response = await fetch(`${import.meta.env.BASE_URL}locales/${lang}.json`);
-        if (!response.ok) {
-            // Try base language if regional not found (e.g., pt-PT -> pt)
-            const baseLang = lang.split('-')[0];
-            if (baseLang !== lang) {
-                const baseResponse = await fetch(`${import.meta.env.BASE_URL}locales/${baseLang}.json`);
-                if (baseResponse.ok) {
-                    return await baseResponse.json();
-                }
-            }
-            throw new Error(`Translation file not found: ${lang}`);
-        }
-        return await response.json();
-    } catch (error) {
-        console.warn(`[i18n] Failed to load translations for ${lang}:`, error.message);
-        return null;
-    }
-}
+async function loadTranslations(lang) {}
 
 /**
killedBy: i18n Module initI18n should load English translations
statusReason: expected 'common.home' to be 'Home' // Object.is equality

[Killed] BlockStatement
src/core/i18n.js:48:9
  * Fetches from /locales/{lang}.json
  */
 async function loadTranslations(lang) {
-    try {
-        // Handle language codes with regions (e.g., pt-PT -> pt-PT.json)
-        const response = await fetch(`${import.meta.env.BASE_URL}locales/${lang}.json`);
-        if (!response.ok) {
-            // Try base language if regional not found (e.g., pt-PT -> pt)
-            const baseLang = lang.split('-')[0];
-            if (baseLang !== lang) {
-                const baseResponse = await fetch(`${import.meta.env.BASE_URL}locales/${baseLang}.json`);
-                if (baseResponse.ok) {
-                    return await baseResponse.json();
-                }
-            }
-            throw new Error(`Translation file not found: ${lang}`);
-        }
-        return await response.json();
-    } catch (error) {
+    try {} catch (error) {
         console.warn(`[i18n] Failed to load translations for ${lang}:`, error.message);
         return null;
killedBy: i18n Module initI18n should load English translations
statusReason: expected 'common.home' to be 'Home' // Object.is equality

[Killed] BlockStatement
src/core/i18n.js:51:27
     try {
         // Handle language codes with regions (e.g., pt-PT -> pt-PT.json)
         const response = await fetch(`${import.meta.env.BASE_URL}locales/${lang}.json`);
-        if (!response.ok) {
-            // Try base language if regional not found (e.g., pt-PT -> pt)
-            const baseLang = lang.split('-')[0];
-            if (baseLang !== lang) {
-                const baseResponse = await fetch(`${import.meta.env.BASE_URL}locales/${baseLang}.json`);
-                if (baseResponse.ok) {
-                    return await baseResponse.json();
-                }
-            }
-            throw new Error(`Translation file not found: ${lang}`);
-        }
+        if (!response.ok) {}
         return await response.json();
     } catch (error) {
killedBy: i18n Module loadTranslations fallback behavior should fallback to base language when regional not found
statusReason: expected 'Home' to be 'Casa' // Object.is equality

[Killed] ConditionalExpression
src/core/i18n.js:51:13
     try {
         // Handle language codes with regions (e.g., pt-PT -> pt-PT.json)
         const response = await fetch(`${import.meta.env.BASE_URL}locales/${lang}.json`);
-        if (!response.ok) {
+        if (false) {
             // Try base language if regional not found (e.g., pt-PT -> pt)
             const baseLang = lang.split('-')[0];
killedBy: i18n Module loadTranslations fallback behavior should fallback to base language when regional not found
statusReason: expected 'Home' to be 'Casa' // Object.is equality

[Killed] ConditionalExpression
src/core/i18n.js:54:17
         if (!response.ok) {
             // Try base language if regional not found (e.g., pt-PT -> pt)
             const baseLang = lang.split('-')[0];
-            if (baseLang !== lang) {
+            if (true) {
                 const baseResponse = await fetch(`${import.meta.env.BASE_URL}locales/${baseLang}.json`);
                 if (baseResponse.ok) {
killedBy: i18n Module loadTranslations fallback behavior should not attempt base language fallback when lang has no region
statusReason: expected [ '/locales/fr.json', …(1) ] to have a length of 1 but got 2

[Killed] BlockStatement
src/core/i18n.js:54:36
         if (!response.ok) {
             // Try base language if regional not found (e.g., pt-PT -> pt)
             const baseLang = lang.split('-')[0];
-            if (baseLang !== lang) {
-                const baseResponse = await fetch(`${import.meta.env.BASE_URL}locales/${baseLang}.json`);
-                if (baseResponse.ok) {
-                    return await baseResponse.json();
-                }
-            }
+            if (baseLang !== lang) {}
             throw new Error(`Translation file not found: ${lang}`);
         }
killedBy: i18n Module loadTranslations fallback behavior should fallback to base language when regional not found
statusReason: expected 'Home' to be 'Casa' // Object.is equality

[Survived] ConditionalExpression
src/core/i18n.js:56:21
             const baseLang = lang.split('-')[0];
             if (baseLang !== lang) {
                 const baseResponse = await fetch(`${import.meta.env.BASE_URL}locales/${baseLang}.json`);
-                if (baseResponse.ok) {
+                if (true) {
                     return await baseResponse.json();
                 }

[Survived] BlockStatement
src/core/i18n.js:63:21
             throw new Error(`Translation file not found: ${lang}`);
         }
         return await response.json();
-    } catch (error) {
-        console.warn(`[i18n] Failed to load translations for ${lang}:`, error.message);
-        return null;
-    }
+    } catch (error) {}
 }
 

[Killed] ConditionalExpression
src/core/i18n.js:74:9
  * Called automatically on first use
  */
 export async function initI18n(options = {}) {
-    if (isInitialized) return i18next;
+    if (true) return i18next;
     if (initPromise) return initPromise;
 
killedBy: i18n Module initI18n should initialize i18next successfully
statusReason: expected undefined to be true // Object.is equality

[Survived] ConditionalExpression
src/core/i18n.js:74:9
  * Called automatically on first use
  */
 export async function initI18n(options = {}) {
-    if (isInitialized) return i18next;
+    if (false) return i18next;
     if (initPromise) return initPromise;
 

[Killed] ConditionalExpression
src/core/i18n.js:75:9
  */
 export async function initI18n(options = {}) {
     if (isInitialized) return i18next;
-    if (initPromise) return initPromise;
+    if (true) return initPromise;
 
     initPromise = (async () => {
killedBy: i18n Module initI18n should initialize i18next successfully
statusReason: Cannot read properties of null (reading 'isInitialized')

[Killed] ConditionalExpression
src/core/i18n.js:82:30
         const enTranslations = await loadTranslations('en');
 
         // Detect initial language
-        const detectedLang = options.lng ||
-            localStorage.getItem('i18nextLng') ||
-            navigator.language ||
-            DEFAULT_LANGUAGE;
+        const detectedLang = false;
 
         // Normalize language code
killedBy: i18n Module initI18n should use localStorage language when available
statusReason: expected 'en' to be 'pt-PT' // Object.is equality

[Killed] ConditionalExpression
src/core/i18n.js:82:30
         const enTranslations = await loadTranslations('en');
 
         // Detect initial language
-        const detectedLang = options.lng ||
-            localStorage.getItem('i18nextLng') ||
-            navigator.language ||
+        const detectedLang = false ||
             DEFAULT_LANGUAGE;
 
killedBy: i18n Module initI18n should use localStorage language when available
statusReason: expected 'en' to be 'pt-PT' // Object.is equality

[Survived] ConditionalExpression
src/core/i18n.js:92:13
 
         // Load translations for detected language if not English
         let langTranslations = null;
-        if (normalizedLang !== 'en') {
+        if (true) {
             langTranslations = await loadTranslations(normalizedLang);
         }

[Survived] EqualityOperator
src/core/i18n.js:92:13
 
         // Load translations for detected language if not English
         let langTranslations = null;
-        if (normalizedLang !== 'en') {
+        if (normalizedLang === 'en') {
             langTranslations = await loadTranslations(normalizedLang);
         }

[Killed] ConditionalExpression
src/core/i18n.js:98:32
 
         // Build resources object
         const resources = {
-            en: { translation: enTranslations || {} }
+            en: { translation: true }
         };
 
killedBy: i18n Module initI18n should load English translations
statusReason: expected 'common.home' to be 'Home' // Object.is equality

[Killed] ConditionalExpression
src/core/i18n.js:98:32
 
         // Build resources object
         const resources = {
-            en: { translation: enTranslations || {} }
+            en: { translation: false }
         };
 
killedBy: i18n Module initI18n should load English translations
statusReason: expected 'common.home' to be 'Home' // Object.is equality

[Killed] ConditionalExpression
src/core/i18n.js:101:13
             en: { translation: enTranslations || {} }
         };
 
-        if (langTranslations && normalizedLang !== 'en') {
+        if (true) {
             resources[normalizedLang] = { translation: langTranslations };
         }
killedBy: i18n Module initI18n should load English translations
statusReason: expected 'common.home' to be 'Home' // Object.is equality

[Survived] ConditionalExpression
src/core/i18n.js:101:13
             en: { translation: enTranslations || {} }
         };
 
-        if (langTranslations && normalizedLang !== 'en') {
+        if (false) {
             resources[normalizedLang] = { translation: langTranslations };
         }

[Survived] ObjectLiteral
src/core/i18n.js:111:32
                 resources,
                 fallbackLng: DEFAULT_LANGUAGE,
                 lng: normalizedLang,
-                interpolation: {
-                    escapeValue: false // Not needed for vanilla JS (no XSS risk like React)
-                },
+                interpolation: {},
                 detection: {
                     order: ['localStorage', 'navigator'],

[Survived] BooleanLiteral
src/core/i18n.js:112:34
                 fallbackLng: DEFAULT_LANGUAGE,
                 lng: normalizedLang,
                 interpolation: {
-                    escapeValue: false // Not needed for vanilla JS (no XSS risk like React)
+                    escapeValue: true // Not needed for vanilla JS (no XSS risk like React)
                 },
                 detection: {

[Survived] StringLiteral
src/core/i18n.js:115:45
                     escapeValue: false // Not needed for vanilla JS (no XSS risk like React)
                 },
                 detection: {
-                    order: ['localStorage', 'navigator'],
+                    order: ['localStorage', ""],
                     caches: ['localStorage'],
                     lookupLocalStorage: 'i18nextLng'

[Survived] ArrayDeclaration
src/core/i18n.js:116:29
                 },
                 detection: {
                     order: ['localStorage', 'navigator'],
-                    caches: ['localStorage'],
+                    caches: [],
                     lookupLocalStorage: 'i18nextLng'
                 },

[Killed] BooleanLiteral
src/core/i18n.js:122:25
                 ...options
             });
 
-        isInitialized = true;
+        isInitialized = false;
         return i18next;
     })();
killedBy: i18n Module initI18n should load English translations
statusReason: expected 'common.home' to be 'Home' // Object.is equality

[Killed] BlockStatement
src/core/i18n.js:133:38
  * Normalize language codes to supported format
  * e.g., 'pt-BR' -> 'pt-PT', 'en-US' -> 'en'
  */
-function normalizeLanguageCode(code) {
-    if (!code) return DEFAULT_LANGUAGE;
-
-    // Check exact match first
-    const exactMatch = SUPPORTED_LANGUAGES.find(l => l.code === code);
-    if (exactMatch) return exactMatch.code;
-
-    // Check base language match
-    const baseLang = code.split('-')[0];
-    const baseMatch = SUPPORTED_LANGUAGES.find(l => l.code.split('-')[0] === baseLang);
-    if (baseMatch) return baseMatch.code;
-
-    return DEFAULT_LANGUAGE;
-}
+function normalizeLanguageCode(code) {}
 
 /**
killedBy: i18n Module changeLanguage should change language to Portuguese
statusReason: Cannot read properties of undefined (reading 'indexOf')

[Killed] ConditionalExpression
src/core/i18n.js:134:9
  * e.g., 'pt-BR' -> 'pt-PT', 'en-US' -> 'en'
  */
 function normalizeLanguageCode(code) {
-    if (!code) return DEFAULT_LANGUAGE;
+    if (true) return DEFAULT_LANGUAGE;
 
     // Check exact match first
killedBy: i18n Module initI18n should use localStorage language when available
statusReason: expected 'en' to be 'pt-PT' // Object.is equality

[Killed] BooleanLiteral
src/core/i18n.js:134:9
  * e.g., 'pt-BR' -> 'pt-PT', 'en-US' -> 'en'
  */
 function normalizeLanguageCode(code) {
-    if (!code) return DEFAULT_LANGUAGE;
+    if (code) return DEFAULT_LANGUAGE;
 
     // Check exact match first
killedBy: i18n Module initI18n should use localStorage language when available
statusReason: expected 'en' to be 'pt-PT' // Object.is equality

[Killed] EqualityOperator
src/core/i18n.js:137:54
     if (!code) return DEFAULT_LANGUAGE;
 
     // Check exact match first
-    const exactMatch = SUPPORTED_LANGUAGES.find(l => l.code === code);
+    const exactMatch = SUPPORTED_LANGUAGES.find(l => l.code !== code);
     if (exactMatch) return exactMatch.code;
 
killedBy: i18n Module initI18n should use localStorage language when available
statusReason: expected 'en' to be 'pt-PT' // Object.is equality

[Killed] ConditionalExpression
src/core/i18n.js:137:54
     if (!code) return DEFAULT_LANGUAGE;
 
     // Check exact match first
-    const exactMatch = SUPPORTED_LANGUAGES.find(l => l.code === code);
+    const exactMatch = SUPPORTED_LANGUAGES.find(l => true);
     if (exactMatch) return exactMatch.code;
 
killedBy: i18n Module initI18n should use localStorage language when available
statusReason: expected 'en' to be 'pt-PT' // Object.is equality

[Killed] ConditionalExpression
src/core/i18n.js:138:9
 
     // Check exact match first
     const exactMatch = SUPPORTED_LANGUAGES.find(l => l.code === code);
-    if (exactMatch) return exactMatch.code;
+    if (true) return exactMatch.code;
 
     // Check base language match
killedBy: i18n Module initI18n should initialize i18next successfully
statusReason: Cannot read properties of undefined (reading 'code')

[Survived] ConditionalExpression
src/core/i18n.js:138:9
 
     // Check exact match first
     const exactMatch = SUPPORTED_LANGUAGES.find(l => l.code === code);
-    if (exactMatch) return exactMatch.code;
+    if (false) return exactMatch.code;
 
     // Check base language match

[Killed] ConditionalExpression
src/core/i18n.js:142:53
 
     // Check base language match
     const baseLang = code.split('-')[0];
-    const baseMatch = SUPPORTED_LANGUAGES.find(l => l.code.split('-')[0] === baseLang);
+    const baseMatch = SUPPORTED_LANGUAGES.find(l => false);
     if (baseMatch) return baseMatch.code;
 
killedBy: i18n Module changeLanguage should normalize language codes
statusReason: expected 'en' to be 'pt-PT' // Object.is equality

[Killed] ArrowFunction
src/core/i18n.js:142:48
 
     // Check base language match
     const baseLang = code.split('-')[0];
-    const baseMatch = SUPPORTED_LANGUAGES.find(l => l.code.split('-')[0] === baseLang);
+    const baseMatch = SUPPORTED_LANGUAGES.find(() => undefined);
     if (baseMatch) return baseMatch.code;
 
killedBy: i18n Module changeLanguage should normalize language codes
statusReason: expected 'en' to be 'pt-PT' // Object.is equality

[Killed] ConditionalExpression
src/core/i18n.js:143:9
     // Check base language match
     const baseLang = code.split('-')[0];
     const baseMatch = SUPPORTED_LANGUAGES.find(l => l.code.split('-')[0] === baseLang);
-    if (baseMatch) return baseMatch.code;
+    if (true) return baseMatch.code;
 
     return DEFAULT_LANGUAGE;
killedBy: i18n Module changeLanguage should fallback to English for unsupported languages
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] ConditionalExpression
src/core/i18n.js:143:9
     // Check base language match
     const baseLang = code.split('-')[0];
     const baseMatch = SUPPORTED_LANGUAGES.find(l => l.code.split('-')[0] === baseLang);
-    if (baseMatch) return baseMatch.code;
+    if (false) return baseMatch.code;
 
     return DEFAULT_LANGUAGE;
killedBy: i18n Module changeLanguage should normalize language codes
statusReason: expected 'en' to be 'pt-PT' // Object.is equality

[Killed] BlockStatement
src/core/i18n.js:152:33
  * Translate a key
  * Auto-initializes i18next if not already done
  */
-export function t(key, options) {
-    if (!isInitialized) {
-        // Return key as fallback if not initialized
-        // This prevents errors during initial render
-        console.warn(`[i18n] Not initialized, returning key: ${key}`);
-        return key;
-    }
-    return i18next.t(key, options);
-}
+export function t(key, options) {}
 
 /**
killedBy: i18n Module initI18n should load English translations
statusReason: expected undefined to be 'Home' // Object.is equality

[Killed] BlockStatement
src/core/i18n.js:153:25
  * Auto-initializes i18next if not already done
  */
 export function t(key, options) {
-    if (!isInitialized) {
-        // Return key as fallback if not initialized
-        // This prevents errors during initial render
-        console.warn(`[i18n] Not initialized, returning key: ${key}`);
-        return key;
-    }
+    if (!isInitialized) {}
     return i18next.t(key, options);
 }
killedBy: i18n Module t (translate) should return key when not initialized
statusReason: expected undefined to be 'common.home' // Object.is equality

[Killed] BooleanLiteral
src/core/i18n.js:153:9
  * Auto-initializes i18next if not already done
  */
 export function t(key, options) {
-    if (!isInitialized) {
+    if (isInitialized) {
         // Return key as fallback if not initialized
         // This prevents errors during initial render
killedBy: i18n Module initI18n should load English translations
statusReason: expected 'common.home' to be 'Home' // Object.is equality

[Killed] BlockStatement
src/core/i18n.js:166:44
  * Change the current language
  * Loads translations if not already loaded
  */
-export async function changeLanguage(lang) {
-    const normalizedLang = normalizeLanguageCode(lang);
-
-    // Load translations if not already loaded
-    if (!i18next.hasResourceBundle(normalizedLang, 'translation')) {
-        const translations = await loadTranslations(normalizedLang);
-        if (translations) {
-            i18next.addResourceBundle(normalizedLang, 'translation', translations);
-        }
-    }
-
-    await i18next.changeLanguage(normalizedLang);
-    localStorage.setItem('i18nextLng', normalizedLang);
-
-    return normalizedLang;
-}
+export async function changeLanguage(lang) {}
 
 /**
killedBy: i18n Module changeLanguage should change language to Portuguese
statusReason: expected 'en' to be 'pt-PT' // Object.is equality

[Killed] BooleanLiteral
src/core/i18n.js:170:9
     const normalizedLang = normalizeLanguageCode(lang);
 
     // Load translations if not already loaded
-    if (!i18next.hasResourceBundle(normalizedLang, 'translation')) {
+    if (i18next.hasResourceBundle(normalizedLang, 'translation')) {
         const translations = await loadTranslations(normalizedLang);
         if (translations) {
killedBy: i18n Module changeLanguage should change language to Portuguese
statusReason: expected 'Home' to be 'Início' // Object.is equality

[Killed] BlockStatement
src/core/i18n.js:170:68
     const normalizedLang = normalizeLanguageCode(lang);
 
     // Load translations if not already loaded
-    if (!i18next.hasResourceBundle(normalizedLang, 'translation')) {
-        const translations = await loadTranslations(normalizedLang);
-        if (translations) {
-            i18next.addResourceBundle(normalizedLang, 'translation', translations);
-        }
-    }
+    if (!i18next.hasResourceBundle(normalizedLang, 'translation')) {}
 
     await i18next.changeLanguage(normalizedLang);
killedBy: i18n Module changeLanguage should change language to Portuguese
statusReason: expected 'Home' to be 'Início' // Object.is equality

[Survived] ConditionalExpression
src/core/i18n.js:172:13
     // Load translations if not already loaded
     if (!i18next.hasResourceBundle(normalizedLang, 'translation')) {
         const translations = await loadTranslations(normalizedLang);
-        if (translations) {
+        if (true) {
             i18next.addResourceBundle(normalizedLang, 'translation', translations);
         }

[Killed] StringLiteral
src/core/i18n.js:173:55
     if (!i18next.hasResourceBundle(normalizedLang, 'translation')) {
         const translations = await loadTranslations(normalizedLang);
         if (translations) {
-            i18next.addResourceBundle(normalizedLang, 'translation', translations);
+            i18next.addResourceBundle(normalizedLang, "", translations);
         }
     }
killedBy: i18n Module changeLanguage should change language to Portuguese
statusReason: expected 'Home' to be 'Início' // Object.is equality

[Killed] BlockStatement
src/core/i18n.js:186:38
 /**
  * Get the current language code
  */
-export function getCurrentLanguage() {
-    return i18next.language || DEFAULT_LANGUAGE;
-}
+export function getCurrentLanguage() {}
 
 /**
killedBy: i18n Module initI18n should respect lng option
statusReason: expected undefined to be 'pt-PT' // Object.is equality

[Killed] ConditionalExpression
src/core/i18n.js:187:12
  * Get the current language code
  */
 export function getCurrentLanguage() {
-    return i18next.language || DEFAULT_LANGUAGE;
+    return false;
 }
 
killedBy: i18n Module initI18n should respect lng option
statusReason: expected false to be 'pt-PT' // Object.is equality

[Killed] LogicalOperator
src/core/i18n.js:187:12
  * Get the current language code
  */
 export function getCurrentLanguage() {
-    return i18next.language || DEFAULT_LANGUAGE;
+    return i18next.language && DEFAULT_LANGUAGE;
 }
 
killedBy: i18n Module initI18n should respect lng option
statusReason: expected 'en' to be 'pt-PT' // Object.is equality

[Killed] ArrowFunction
src/core/i18n.js:203:12
  */
 export function onLanguageChange(callback) {
     i18next.on('languageChanged', callback);
-    return () => i18next.off('languageChanged', callback);
+    return () => undefined;
 }
 
killedBy: i18n Module onLanguageChange should return unsubscribe function
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "pt-PT",
