[Killed] EqualityOperator
src/core/db.js:96:9
   export function normalizeTimestamp(ts) {
     if (!ts) return 0;
     if (typeof ts === 'number') return ts;
-    if (typeof ts === 'string') {
+    if (typeof ts !== 'string') {
       const parsed = Date.parse(ts);
       return isNaN(parsed) ? 0 : parsed;
killedBy: normalizeTimestamp converts ISO string to number
statusReason: expected +0 to be 1768564800000 // Object.is equality

[Killed] ConditionalExpression
src/core/db.js:174:40
   export async function quizExistsBySourceId(sourceQuizId) {
     const db = await getDB();
     const allSessions = await db.getAll('sessions');
-    return allSessions.some(session => session.sourceQuizId === sourceQuizId);
+    return allSessions.some(session => false);
   }
 
killedBy: quizExistsBySourceId should return true when quiz with sourceQuizId exists
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/db.js:174:40
   export async function quizExistsBySourceId(sourceQuizId) {
     const db = await getDB();
     const allSessions = await db.getAll('sessions');
-    return allSessions.some(session => session.sourceQuizId === sourceQuizId);
+    return allSessions.some(session => session.sourceQuizId !== sourceQuizId);
   }
 
killedBy: quizExistsBySourceId should return true when quiz with sourceQuizId exists
statusReason: expected false to be true // Object.is equality
