[NoCoverage] BlockStatement
src/services/model-service.js:181:19
       timestamp: Date.now()
     }));
     logger.debug('Pricing cache updated', { modelCount: Object.keys(pricingMap).length });
-  } catch (error) {
-    logger.debug('Pricing cache write error', { error: error.message });
-  }
+  } catch (error) {}
 }
 

[Killed] BlockStatement
src/services/model-service.js:190:29
  * Get cached pricing data if still valid
  * @returns {Object|null} Map of model ID to pricing, or null if cache expired/missing
  */
-function getCachedPricing() {
-  try {
-    const cached = localStorage.getItem(PRICING_CACHE_KEY);
-    if (!cached) return null;
-
-    const { pricing, timestamp } = JSON.parse(cached);
-    const age = Date.now() - timestamp;
-
-    if (age < CACHE_DURATION_MS) {
-      return pricing;
-    }
-
-    // Cache expired
-    localStorage.removeItem(PRICING_CACHE_KEY);
-    return null;
-  } catch (error) {
-    logger.debug('Pricing cache read error', { error: error.message });
-    return null;
-  }
-}
+function getCachedPricing() {}
 
 /**
killedBy: Model Service getModelPricing should return pricing for cached model
statusReason: expected null to deeply equal { prompt: '0.03', completion: '0.06' }

[Killed] BlockStatement
src/services/model-service.js:191:7
  * @returns {Object|null} Map of model ID to pricing, or null if cache expired/missing
  */
 function getCachedPricing() {
-  try {
-    const cached = localStorage.getItem(PRICING_CACHE_KEY);
-    if (!cached) return null;
-
-    const { pricing, timestamp } = JSON.parse(cached);
-    const age = Date.now() - timestamp;
-
-    if (age < CACHE_DURATION_MS) {
-      return pricing;
-    }
-
-    // Cache expired
-    localStorage.removeItem(PRICING_CACHE_KEY);
-    return null;
-  } catch (error) {
+  try {} catch (error) {
     logger.debug('Pricing cache read error', { error: error.message });
     return null;
killedBy: Model Service getModelPricing should return pricing for cached model
statusReason: expected null to deeply equal { prompt: '0.03', completion: '0.06' }

[Killed] BooleanLiteral
src/services/model-service.js:193:9
 function getCachedPricing() {
   try {
     const cached = localStorage.getItem(PRICING_CACHE_KEY);
-    if (!cached) return null;
+    if (cached) return null;
 
     const { pricing, timestamp } = JSON.parse(cached);
killedBy: Model Service getModelPricing should return pricing for cached model
statusReason: expected null to deeply equal { prompt: '0.03', completion: '0.06' }

[Killed] ConditionalExpression
src/services/model-service.js:193:9
 function getCachedPricing() {
   try {
     const cached = localStorage.getItem(PRICING_CACHE_KEY);
-    if (!cached) return null;
+    if (true) return null;
 
     const { pricing, timestamp } = JSON.parse(cached);
killedBy: Model Service getModelPricing should return pricing for cached model
statusReason: expected null to deeply equal { prompt: '0.03', completion: '0.06' }

[Killed] ArithmeticOperator
src/services/model-service.js:196:17
     if (!cached) return null;
 
     const { pricing, timestamp } = JSON.parse(cached);
-    const age = Date.now() - timestamp;
+    const age = Date.now() + timestamp;
 
     if (age < CACHE_DURATION_MS) {
killedBy: Model Service getModelPricing should return pricing for cached model
statusReason: expected null to deeply equal { prompt: '0.03', completion: '0.06' }

[Killed] BlockStatement
src/services/model-service.js:198:34
     const { pricing, timestamp } = JSON.parse(cached);
     const age = Date.now() - timestamp;
 
-    if (age < CACHE_DURATION_MS) {
-      return pricing;
-    }
+    if (age < CACHE_DURATION_MS) {}
 
     // Cache expired
killedBy: Model Service getModelPricing should return pricing for cached model
statusReason: expected null to deeply equal { prompt: '0.03', completion: '0.06' }

[Survived] ObjectLiteral
src/services/model-service.js:206:46
     localStorage.removeItem(PRICING_CACHE_KEY);
     return null;
   } catch (error) {
-    logger.debug('Pricing cache read error', { error: error.message });
+    logger.debug('Pricing cache read error', {});
     return null;
   }

[Survived] StringLiteral
src/services/model-service.js:206:18
     localStorage.removeItem(PRICING_CACHE_KEY);
     return null;
   } catch (error) {
-    logger.debug('Pricing cache read error', { error: error.message });
+    logger.debug("", { error: error.message });
     return null;
   }

[Killed] BlockStatement
src/services/model-service.js:216:42
  * @param {string} modelId - Model ID (e.g., 'meta-llama/llama-3-8b-instruct')
  * @returns {{prompt: string, completion: string}|null} Pricing per token, or null if not found
  */
-export function getModelPricing(modelId) {
-  const pricing = getCachedPricing();
-  if (!pricing) {
-    logger.debug('Pricing cache not available');
-    return null;
-  }
-  return pricing[modelId] || null;
-}
+export function getModelPricing(modelId) {}
 
 /**
killedBy: Model Service getModelPricing should return null when pricing cache is empty
statusReason: expected undefined to be null

[Killed] BlockStatement
src/services/model-service.js:218:17
  */
 export function getModelPricing(modelId) {
   const pricing = getCachedPricing();
-  if (!pricing) {
-    logger.debug('Pricing cache not available');
-    return null;
-  }
+  if (!pricing) {}
   return pricing[modelId] || null;
 }
killedBy: Model Service getModelPricing should return null when pricing cache is empty
statusReason: Cannot read properties of null (reading 'some-model')

[Killed] ConditionalExpression
src/services/model-service.js:218:7
  */
 export function getModelPricing(modelId) {
   const pricing = getCachedPricing();
-  if (!pricing) {
+  if (false) {
     logger.debug('Pricing cache not available');
     return null;
killedBy: Model Service getModelPricing should return null when pricing cache is empty
statusReason: Cannot read properties of null (reading 'some-model')

[Killed] LogicalOperator
src/services/model-service.js:222:10
     logger.debug('Pricing cache not available');
     return null;
   }
-  return pricing[modelId] || null;
+  return pricing[modelId] && null;
 }
 
killedBy: Model Service getModelPricing should return pricing for cached model
statusReason: expected null to deeply equal { prompt: '0.03', completion: '0.06' }

[Killed] ConditionalExpression
src/services/model-service.js:222:10
     logger.debug('Pricing cache not available');
     return null;
   }
-  return pricing[modelId] || null;
+  return false;
 }
 
killedBy: Model Service getModelPricing should return pricing for cached model
statusReason: expected false to deeply equal { prompt: '0.03', completion: '0.06' }

[Killed] ConditionalExpression
src/services/model-service.js:234:7
 export async function prefetchModelPricing() {
   // Skip if cache already exists
   const cached = getCachedPricing();
-  if (cached) {
+  if (true) {
     logger.debug('Pricing cache already available');
     return;
killedBy: Model Service prefetchModelPricing should fetch pricing for selected model
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/services/model-service.js:234:7
 export async function prefetchModelPricing() {
   // Skip if cache already exists
   const cached = getCachedPricing();
-  if (cached) {
+  if (false) {
     logger.debug('Pricing cache already available');
     return;
killedBy: Model Service prefetchModelPricing should skip if pricing cache already exists
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "https://openrouter.ai/api/v1/models",

[Killed] BlockStatement
src/services/model-service.js:239:7
     return;
   }
 
-  try {
-    // Get the model we need pricing for
-    const selectedModel = getSelectedModel();
-    const paidEquivalent = selectedModel.replace(/:free$/, '');
-    const modelsNeeded = new Set([selectedModel, paidEquivalent]);
-
-    logger.debug('Prefetching model pricing', { models: Array.from(modelsNeeded) });
-    const response = await fetch(OPENROUTER_MODELS_URL);
-
-    if (!response.ok) {
-      logger.debug('Failed to prefetch pricing', { status: response.status });
-      return;
-    }
-
-    const data = await response.json();
-    const allModels = data.data || [];
-
-    // Filter to only the models we need
-    const filteredModels = allModels.filter(model => modelsNeeded.has(model.id));
-
-    cachePricing(filteredModels);
-    logger.debug('Pricing prefetch complete', { modelCount: filteredModels.length });
-  } catch (error) {
+  try {} catch (error) {
     // Silent fail - pricing will be fetched later when user opens model selector
     logger.debug('Pricing prefetch error', { error: error.message });
killedBy: Model Service prefetchModelPricing should fetch pricing for selected model
statusReason: expected "vi.fn()" to be called at least once

[Survived] StringLiteral
src/services/model-service.js:245:18
     const paidEquivalent = selectedModel.replace(/:free$/, '');
     const modelsNeeded = new Set([selectedModel, paidEquivalent]);
 
-    logger.debug('Prefetching model pricing', { models: Array.from(modelsNeeded) });
+    logger.debug("", { models: Array.from(modelsNeeded) });
     const response = await fetch(OPENROUTER_MODELS_URL);
 

[Survived] ArrowFunction
src/services/model-service.js:257:45
     const allModels = data.data || [];
 
     // Filter to only the models we need
-    const filteredModels = allModels.filter(model => modelsNeeded.has(model.id));
+    const filteredModels = allModels.filter(() => undefined);
 
     cachePricing(filteredModels);

[Survived] MethodExpression
src/services/model-service.js:257:28
     const allModels = data.data || [];
 
     // Filter to only the models we need
-    const filteredModels = allModels.filter(model => modelsNeeded.has(model.id));
+    const filteredModels = allModels;
 
     cachePricing(filteredModels);

[Survived] BlockStatement
src/services/model-service.js:261:19
 
     cachePricing(filteredModels);
     logger.debug('Pricing prefetch complete', { modelCount: filteredModels.length });
-  } catch (error) {
-    // Silent fail - pricing will be fetched later when user opens model selector
-    logger.debug('Pricing prefetch error', { error: error.message });
-  }
+  } catch (error) {}
 }
 

[Survived] ObjectLiteral
src/services/model-service.js:263:44
     logger.debug('Pricing prefetch complete', { modelCount: filteredModels.length });
   } catch (error) {
     // Silent fail - pricing will be fetched later when user opens model selector
-    logger.debug('Pricing prefetch error', { error: error.message });
+    logger.debug('Pricing prefetch error', {});
   }
 }
