[Killed] StringLiteral
src/core/features.js:48:28
       case 'DISABLED':
         return false;
       case 'SETTINGS_ONLY':
-        return context === 'settings';
+        return context === "";
       case 'ENABLED':
         return true;
killedBy: Feature Flags phase behaviors should return true only for settings context when phase is SETTINGS_ONLY
statusReason: expected false to be true // Object.is equality
