[Survived] StringLiteral
src/core/db.js:23:55
             // Create 'sessions' object store
             if (!db.objectStoreNames.contains('sessions')) {
                 const sessionStore = db.createObjectStore('sessions', { keyPath: 'id', autoIncrement: true  });
-                sessionStore.createIndex('byTopicId', 'topicId');
+                sessionStore.createIndex('byTopicId', "");
                 sessionStore.createIndex('byTimestamp', 'timestamp');
             }

[Killed] ConditionalExpression
src/core/db.js:95:9
    */
   export function normalizeTimestamp(ts) {
     if (!ts) return 0;
-    if (typeof ts === 'number') return ts;
+    if (false) return ts;
     if (typeof ts === 'string') {
       const parsed = Date.parse(ts);
killedBy: getRecentSessions - mixed timestamp sorting returns sessions sorted by timestamp descending (newest first)
statusReason: expected 'Old Quiz' to be 'Today Quiz' // Object.is equality

[Killed] EqualityOperator
src/core/db.js:95:9
    */
   export function normalizeTimestamp(ts) {
     if (!ts) return 0;
-    if (typeof ts === 'number') return ts;
+    if (typeof ts !== 'number') return ts;
     if (typeof ts === 'string') {
       const parsed = Date.parse(ts);
killedBy: getRecentSessions - mixed timestamp sorting returns sessions sorted by timestamp descending (newest first)
statusReason: expected 'Old Quiz' to be 'Today Quiz' // Object.is equality

[Survived] ConditionalExpression
src/core/db.js:96:9
   export function normalizeTimestamp(ts) {
     if (!ts) return 0;
     if (typeof ts === 'number') return ts;
-    if (typeof ts === 'string') {
+    if (true) {
       const parsed = Date.parse(ts);
       return isNaN(parsed) ? 0 : parsed;

[Killed] MethodExpression
src/core/db.js:108:5
     const all = await db.getAll('sessions');
 
     // Normalize and sort by timestamp descending (newest first)
-    all.sort((a, b) => {
-      const tsA = normalizeTimestamp(a.timestamp);
-      const tsB = normalizeTimestamp(b.timestamp);
-      return tsB - tsA;
-    });
+    all;
 
     return all.slice(0, limit);
killedBy: getRecentSessions - mixed timestamp sorting returns sessions sorted by timestamp descending (newest first)
statusReason: expected 'Old Quiz' to be 'Today Quiz' // Object.is equality

[Killed] ArithmeticOperator
src/core/db.js:111:14
     all.sort((a, b) => {
       const tsA = normalizeTimestamp(a.timestamp);
       const tsB = normalizeTimestamp(b.timestamp);
-      return tsB - tsA;
+      return tsB + tsA;
     });
 
killedBy: getRecentSessions - mixed timestamp sorting returns sessions sorted by timestamp descending (newest first)
statusReason: expected 'Old Quiz' to be 'Today Quiz' // Object.is equality

[Killed] ConditionalExpression
src/core/db.js:120:9
   export async function updateSession(id, updates) {
     const db = await getDB();
     const session = await db.get('sessions', id);
-    if (!session) return null;
+    if (true) return null;
 
     const updatedSession = { ...session, ...updates };
killedBy: updateSession - Quiz Replay should update existing session with new data
statusReason: expected null not to be null

[Killed] BooleanLiteral
src/core/db.js:138:9
   export async function updateQuestionExplanation(sessionId, questionIndex, rightAnswerExplanation) {
     const db = await getDB();
     const session = await db.get('sessions', sessionId);
-    if (!session) return null;
+    if (session) return null;
 
     // Ensure questions array exists and index is valid
killedBy: updateQuestionExplanation should update a question explanation
statusReason: expected null not to be null

[Killed] LogicalOperator
src/core/db.js:141:9
     if (!session) return null;
 
     // Ensure questions array exists and index is valid
-    if (!session.questions || questionIndex < 0 || questionIndex >= session.questions.length) {
+    if ((!session.questions || questionIndex < 0) && questionIndex >= session.questions.length) {
       return null;
     }
killedBy: updateQuestionExplanation should return null for invalid question index (negative)
statusReason: expected { topicId: 'math', …(5) } to be null

[Killed] BlockStatement
src/core/db.js:180:48
   /**
    * Delete all sample sessions (used when reloading samples)
    */
-  export async function deleteSampleSessions() {
-    const db = await getDB();
-    const allSessions = await db.getAll('sessions');
-
-    for (const session of allSessions) {
-      if (session.isSample) {
-        await db.delete('sessions', session.id);
-      }
-    }
-  }
+  export async function deleteSampleSessions() {}
 
     // ========== SETTINGS ==========
killedBy: deleteSampleSessions should delete all sample sessions
statusReason: expected [ { topicId: 'user1', …(3) }, …(3) ] to have a length of 2 but got 4

[Killed] ConditionalExpression
src/core/db.js:185:11
     const allSessions = await db.getAll('sessions');
 
     for (const session of allSessions) {
-      if (session.isSample) {
+      if (true) {
         await db.delete('sessions', session.id);
       }
killedBy: deleteSampleSessions should delete all sample sessions
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
src/core/db.js:225:12
    */
   export async function getOpenRouterKey() {
     const data = await getSetting(OPENROUTER_KEY);
-    return data?.key || null;
+    return data?.key && null;
   }
 
killedBy: OpenRouter Key Storage should store and retrieve OpenRouter API key
statusReason: expected null to be 'sk-or-v1-test123' // Object.is equality

[Killed] BlockStatement
src/core/db.js:231:47
   /**
    * Remove OpenRouter API key (disconnect)
    */
-  export async function removeOpenRouterKey() {
-    const db = await getDB();
-    return db.delete('settings', OPENROUTER_KEY);
-  }
+  export async function removeOpenRouterKey() {}
 
   /**
killedBy: OpenRouter Key Storage should remove OpenRouter key
statusReason: expected 'sk-or-v1-to-remove' to be null

[Killed] BlockStatement
src/core/db.js:240:49
    * Check if user is connected to OpenRouter
    * @returns {Promise<boolean>}
    */
-  export async function isOpenRouterConnected() {
-    const key = await getOpenRouterKey();
-    return !!key;
-  }
+  export async function isOpenRouterConnected() {}
 
   // ========== DATA MANAGEMENT ==========
killedBy: OpenRouter Key Storage should report connected status correctly
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/core/db.js:258:30
     // Delete all non-sample sessions
     const allSessions = await db.getAll('sessions');
     for (const session of allSessions) {
-      if (!session.isSample) {
-        await db.delete('sessions', session.id);
-      }
+      if (!session.isSample) {}
     }
 
killedBy: getAllSessions should only contain sample sessions after clearAllUserData
statusReason: expected false to be true // Object.is equality
