[Killed] MethodExpression
src/services/model-service.js:45:49
   // Convert kebab-case to Title Case
   return name
     .split('-')
-    .map(word => word.charAt(0).toUpperCase() + word.slice(1))
+    .map(word => word.charAt(0).toUpperCase() + word)
     .join(' ');
 }
killedBy: Model Service getModelDisplayName should convert model ID to display name
statusReason: expected 'Ddeepseek Rr1t2 Cchimera' to be 'Deepseek R1t2 Chimera' // Object.is equality

[Killed] ConditionalExpression
src/services/model-service.js:89:22
       id: model.id,
       name: model.name || getModelDisplayName(model.id),
       description: model.description || '',
-      contextLength: model.context_length || 0
+      contextLength: true
     }))
     .sort((a, b) => a.name.localeCompare(b.name));
killedBy: Model Service getAvailableModels should include model details in response
statusReason: expected true to be 8192 // Object.is equality

[Killed] LogicalOperator
src/services/model-service.js:108:23
  */
 function isFreeModel(model) {
   const pricing = model.pricing || {};
-  const promptPrice = parseFloat(pricing.prompt) || 0;
+  const promptPrice = parseFloat(pricing.prompt) && 0;
   const completionPrice = parseFloat(pricing.completion) || 0;
   return promptPrice === 0 && completionPrice === 0;
killedBy: Model Service getAvailableModels should handle models with missing pricing as non-free
statusReason: expected [ 'free-model:free' ] to include 'model-no-pricing'

[Survived] BlockStatement
src/services/model-service.js:205:19
     // Cache expired
     localStorage.removeItem(PRICING_CACHE_KEY);
     return null;
-  } catch (error) {
-    logger.debug('Pricing cache read error', { error: error.message });
-    return null;
-  }
+  } catch (error) {}
 }
 

[Killed] ConditionalExpression
src/services/model-service.js:222:10
     logger.debug('Pricing cache not available');
     return null;
   }
-  return pricing[modelId] || null;
+  return true;
 }
 
killedBy: Model Service getModelPricing should return pricing for cached model
statusReason: expected true to deeply equal { prompt: '0.03', completion: '0.06' }

[Survived] StringLiteral
src/services/model-service.js:260:18
     const filteredModels = allModels.filter(model => modelsNeeded.has(model.id));
 
     cachePricing(filteredModels);
-    logger.debug('Pricing prefetch complete', { modelCount: filteredModels.length });
+    logger.debug("", { modelCount: filteredModels.length });
   } catch (error) {
     // Silent fail - pricing will be fetched later when user opens model selector

[Survived] ObjectLiteral
src/services/model-service.js:260:47
     const filteredModels = allModels.filter(model => modelsNeeded.has(model.id));
 
     cachePricing(filteredModels);
-    logger.debug('Pricing prefetch complete', { modelCount: filteredModels.length });
+    logger.debug('Pricing prefetch complete', {});
   } catch (error) {
     // Silent fail - pricing will be fetched later when user opens model selector
