[Killed] BlockStatement
src/utils/json-extractor.js:13:26
  * @param {string} text - JSON string to clean
  * @returns {string} Cleaned JSON string
  */
-function cleanJSON(text) {
-  return text
-    .replace(/,(\s*[}\]])/g, '$1')  // Remove trailing commas before } or ]
-    // eslint-disable-next-line no-control-regex, sonarjs/no-control-regex -- Intentionally removing control chars from JSON
-    .replace(/[\u0000-\u001F]+/g, ' ');
-}
+function cleanJSON(text) {}
 
 /**
killedBy: JSON Extractor extractJSON markdown code blocks should extract JSON from ```json code block
statusReason: Failed to extract valid JSON from response

[Killed] Regex
src/utils/json-extractor.js:17:14
   return text
     .replace(/,(\s*[}\]])/g, '$1')  // Remove trailing commas before } or ]
     // eslint-disable-next-line no-control-regex, sonarjs/no-control-regex -- Intentionally removing control chars from JSON
-    .replace(/[\u0000-\u001F]+/g, ' ');
+    .replace(/[^\u0000-\u001F]+/g, ' ');
 }
 
killedBy: JSON Extractor extractJSON markdown code blocks should extract JSON from ```json code block
statusReason: Failed to extract valid JSON from response

[Survived] StringLiteral
src/utils/json-extractor.js:17:35
   return text
     .replace(/,(\s*[}\]])/g, '$1')  // Remove trailing commas before } or ]
     // eslint-disable-next-line no-control-regex, sonarjs/no-control-regex -- Intentionally removing control chars from JSON
-    .replace(/[\u0000-\u001F]+/g, ' ');
+    .replace(/[\u0000-\u001F]+/g, "");
 }
 

[Killed] LogicalOperator
src/utils/json-extractor.js:30:7
  * @throws {Error} If JSON cannot be extracted
  */
 export function extractJSON(text) {
-  if (!text || typeof text !== 'string') {
+  if (!text && typeof text !== 'string') {
     throw new Error('Input must be a non-empty string');
   }
killedBy: JSON Extractor extractJSON error handling should throw on non-string input
statusReason: expected [Function] to throw error including 'Input must be a non-empty string' but got 'text.trim is not a function'

[Survived] StringLiteral
src/utils/json-extractor.js:47:59
 
   // Step 2: Strip DeepSeek thinking tags (must happen before JSON extraction)
   // These models output <think>reasoning</think> before the actual response
-  cleaned = cleaned.replace(/<think>[\s\S]*?<\/think>/gi, '');
+  cleaned = cleaned.replace(/<think>[\s\S]*?<\/think>/gi, "Stryker was here!");
 
   // Step 3: Normalize smart quotes to straight quotes

[Killed] Regex
src/utils/json-extractor.js:51:14
 
   // Step 3: Normalize smart quotes to straight quotes
   cleaned = cleaned
-    .replace(/[\u201C\u201D]/g, '"')  // Smart double quotes " "
+    .replace(/[^\u201C\u201D]/g, '"')  // Smart double quotes " "
     .replace(/[\u2018\u2019]/g, "'"); // Smart single quotes ' '
 
killedBy: JSON Extractor extractJSON clean JSON input should parse clean JSON object directly
statusReason: Failed to extract valid JSON from response

[Survived] BlockStatement
src/utils/json-extractor.js:55:7
     .replace(/[\u2018\u2019]/g, "'"); // Smart single quotes ' '
 
   // Step 4: Try direct parse first (most common case)
-  try {
-    return JSON.parse(cleaned);
-  } catch {
+  try {} catch {
     // Continue to fallbacks
   }

[Killed] EqualityOperator
src/utils/json-extractor.js:64:7
   // Step 5: Try extracting from markdown code block
   // Use indexOf instead of regex to avoid ReDoS vulnerability
   const codeBlockStart = cleaned.indexOf('```');
-  if (codeBlockStart !== -1) {
+  if (codeBlockStart === -1) {
     const codeBlockEnd = cleaned.indexOf('```', codeBlockStart + 3);
     if (codeBlockEnd !== -1) {
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] ConditionalExpression
src/utils/json-extractor.js:64:7
   // Step 5: Try extracting from markdown code block
   // Use indexOf instead of regex to avoid ReDoS vulnerability
   const codeBlockStart = cleaned.indexOf('```');
-  if (codeBlockStart !== -1) {
+  if (false) {
     const codeBlockEnd = cleaned.indexOf('```', codeBlockStart + 3);
     if (codeBlockEnd !== -1) {
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] ArithmeticOperator
src/utils/json-extractor.js:65:49
   // Use indexOf instead of regex to avoid ReDoS vulnerability
   const codeBlockStart = cleaned.indexOf('```');
   if (codeBlockStart !== -1) {
-    const codeBlockEnd = cleaned.indexOf('```', codeBlockStart + 3);
+    const codeBlockEnd = cleaned.indexOf('```', codeBlockStart - 3);
     if (codeBlockEnd !== -1) {
       let blockContent = cleaned.slice(codeBlockStart + 3, codeBlockEnd);
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] StringLiteral
src/utils/json-extractor.js:65:42
   // Use indexOf instead of regex to avoid ReDoS vulnerability
   const codeBlockStart = cleaned.indexOf('```');
   if (codeBlockStart !== -1) {
-    const codeBlockEnd = cleaned.indexOf('```', codeBlockStart + 3);
+    const codeBlockEnd = cleaned.indexOf("", codeBlockStart + 3);
     if (codeBlockEnd !== -1) {
       let blockContent = cleaned.slice(codeBlockStart + 3, codeBlockEnd);
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] ConditionalExpression
src/utils/json-extractor.js:66:9
   const codeBlockStart = cleaned.indexOf('```');
   if (codeBlockStart !== -1) {
     const codeBlockEnd = cleaned.indexOf('```', codeBlockStart + 3);
-    if (codeBlockEnd !== -1) {
+    if (false) {
       let blockContent = cleaned.slice(codeBlockStart + 3, codeBlockEnd);
       // Remove optional 'json' language identifier
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] EqualityOperator
src/utils/json-extractor.js:66:9
   const codeBlockStart = cleaned.indexOf('```');
   if (codeBlockStart !== -1) {
     const codeBlockEnd = cleaned.indexOf('```', codeBlockStart + 3);
-    if (codeBlockEnd !== -1) {
+    if (codeBlockEnd === -1) {
       let blockContent = cleaned.slice(codeBlockStart + 3, codeBlockEnd);
       // Remove optional 'json' language identifier
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] ArithmeticOperator
src/utils/json-extractor.js:67:40
   if (codeBlockStart !== -1) {
     const codeBlockEnd = cleaned.indexOf('```', codeBlockStart + 3);
     if (codeBlockEnd !== -1) {
-      let blockContent = cleaned.slice(codeBlockStart + 3, codeBlockEnd);
+      let blockContent = cleaned.slice(codeBlockStart - 3, codeBlockEnd);
       // Remove optional 'json' language identifier
       if (blockContent.startsWith('json')) {
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] MethodExpression
src/utils/json-extractor.js:67:26
   if (codeBlockStart !== -1) {
     const codeBlockEnd = cleaned.indexOf('```', codeBlockStart + 3);
     if (codeBlockEnd !== -1) {
-      let blockContent = cleaned.slice(codeBlockStart + 3, codeBlockEnd);
+      let blockContent = cleaned;
       // Remove optional 'json' language identifier
       if (blockContent.startsWith('json')) {
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] ConditionalExpression
src/utils/json-extractor.js:69:11
     if (codeBlockEnd !== -1) {
       let blockContent = cleaned.slice(codeBlockStart + 3, codeBlockEnd);
       // Remove optional 'json' language identifier
-      if (blockContent.startsWith('json')) {
+      if (false) {
         blockContent = blockContent.slice(4);
       }
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] BlockStatement
src/utils/json-extractor.js:69:44
     if (codeBlockEnd !== -1) {
       let blockContent = cleaned.slice(codeBlockStart + 3, codeBlockEnd);
       // Remove optional 'json' language identifier
-      if (blockContent.startsWith('json')) {
-        blockContent = blockContent.slice(4);
-      }
+      if (blockContent.startsWith('json')) {}
       const jsonFromBlock = cleanJSON(blockContent.trim());
       try {
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] MethodExpression
src/utils/json-extractor.js:70:24
       let blockContent = cleaned.slice(codeBlockStart + 3, codeBlockEnd);
       // Remove optional 'json' language identifier
       if (blockContent.startsWith('json')) {
-        blockContent = blockContent.slice(4);
+        blockContent = blockContent;
       }
       const jsonFromBlock = cleanJSON(blockContent.trim());
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Survived] MethodExpression
src/utils/json-extractor.js:72:39
       if (blockContent.startsWith('json')) {
         blockContent = blockContent.slice(4);
       }
-      const jsonFromBlock = cleanJSON(blockContent.trim());
+      const jsonFromBlock = cleanJSON(blockContent);
       try {
         return JSON.parse(jsonFromBlock);

[Killed] BlockStatement
src/utils/json-extractor.js:73:11
         blockContent = blockContent.slice(4);
       }
       const jsonFromBlock = cleanJSON(blockContent.trim());
-      try {
-        return JSON.parse(jsonFromBlock);
-      } catch {
+      try {} catch {
         // Continue to other fallbacks
       }
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] EqualityOperator
src/utils/json-extractor.js:85:28
   // Use indexOf/lastIndexOf instead of regex to avoid ReDoS vulnerability
   const firstBrace = cleaned.indexOf('{');
   const lastBrace = cleaned.lastIndexOf('}');
-  if (firstBrace !== -1 && lastBrace > firstBrace) {
+  if (firstBrace !== -1 && lastBrace <= firstBrace) {
     const cleanedObject = cleanJSON(cleaned.slice(firstBrace, lastBrace + 1));
     try {
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON object from text with prefix
statusReason: Failed to extract valid JSON from response

[Killed] EqualityOperator
src/utils/json-extractor.js:85:7
   // Use indexOf/lastIndexOf instead of regex to avoid ReDoS vulnerability
   const firstBrace = cleaned.indexOf('{');
   const lastBrace = cleaned.lastIndexOf('}');
-  if (firstBrace !== -1 && lastBrace > firstBrace) {
+  if (firstBrace === -1 && lastBrace > firstBrace) {
     const cleanedObject = cleanJSON(cleaned.slice(firstBrace, lastBrace + 1));
     try {
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON object from text with prefix
statusReason: Failed to extract valid JSON from response

[Killed] MethodExpression
src/utils/json-extractor.js:86:37
   const firstBrace = cleaned.indexOf('{');
   const lastBrace = cleaned.lastIndexOf('}');
   if (firstBrace !== -1 && lastBrace > firstBrace) {
-    const cleanedObject = cleanJSON(cleaned.slice(firstBrace, lastBrace + 1));
+    const cleanedObject = cleanJSON(cleaned);
     try {
       return JSON.parse(cleanedObject);
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON object from text with prefix
statusReason: Failed to extract valid JSON from response

[Killed] ArithmeticOperator
src/utils/json-extractor.js:86:63
   const firstBrace = cleaned.indexOf('{');
   const lastBrace = cleaned.lastIndexOf('}');
   if (firstBrace !== -1 && lastBrace > firstBrace) {
-    const cleanedObject = cleanJSON(cleaned.slice(firstBrace, lastBrace + 1));
+    const cleanedObject = cleanJSON(cleaned.slice(firstBrace, lastBrace - 1));
     try {
       return JSON.parse(cleanedObject);
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON object from text with prefix
statusReason: Failed to extract valid JSON from response

[Killed] BlockStatement
src/utils/json-extractor.js:87:9
   const lastBrace = cleaned.lastIndexOf('}');
   if (firstBrace !== -1 && lastBrace > firstBrace) {
     const cleanedObject = cleanJSON(cleaned.slice(firstBrace, lastBrace + 1));
-    try {
-      return JSON.parse(cleanedObject);
-    } catch {
+    try {} catch {
       // Continue to array fallback
     }
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON object from text with prefix
statusReason: Failed to extract valid JSON from response

[Killed] BlockStatement
src/utils/json-extractor.js:98:58
   // Use indexOf/lastIndexOf instead of regex to avoid ReDoS vulnerability
   const firstBracket = cleaned.indexOf('[');
   const lastBracket = cleaned.lastIndexOf(']');
-  if (firstBracket !== -1 && lastBracket > firstBracket) {
-    const cleanedArray = cleanJSON(cleaned.slice(firstBracket, lastBracket + 1));
-    try {
-      return JSON.parse(cleanedArray);
-    } catch {
-      // All fallbacks failed
-    }
-  }
+  if (firstBracket !== -1 && lastBracket > firstBracket) {}
 
   // All strategies failed - log the raw text for debugging
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON array from text
statusReason: Failed to extract valid JSON from response

[Killed] ConditionalExpression
src/utils/json-extractor.js:98:7
   // Use indexOf/lastIndexOf instead of regex to avoid ReDoS vulnerability
   const firstBracket = cleaned.indexOf('[');
   const lastBracket = cleaned.lastIndexOf(']');
-  if (firstBracket !== -1 && lastBracket > firstBracket) {
+  if (false) {
     const cleanedArray = cleanJSON(cleaned.slice(firstBracket, lastBracket + 1));
     try {
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON array from text
statusReason: Failed to extract valid JSON from response

[Killed] ArithmeticOperator
src/utils/json-extractor.js:99:64
   const firstBracket = cleaned.indexOf('[');
   const lastBracket = cleaned.lastIndexOf(']');
   if (firstBracket !== -1 && lastBracket > firstBracket) {
-    const cleanedArray = cleanJSON(cleaned.slice(firstBracket, lastBracket + 1));
+    const cleanedArray = cleanJSON(cleaned.slice(firstBracket, lastBracket - 1));
     try {
       return JSON.parse(cleanedArray);
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON array from text
statusReason: Failed to extract valid JSON from response

[Killed] MethodExpression
src/utils/json-extractor.js:99:36
   const firstBracket = cleaned.indexOf('[');
   const lastBracket = cleaned.lastIndexOf(']');
   if (firstBracket !== -1 && lastBracket > firstBracket) {
-    const cleanedArray = cleanJSON(cleaned.slice(firstBracket, lastBracket + 1));
+    const cleanedArray = cleanJSON(cleaned);
     try {
       return JSON.parse(cleanedArray);
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON array from text
statusReason: Failed to extract valid JSON from response

[Killed] BlockStatement
src/utils/json-extractor.js:100:9
   const lastBracket = cleaned.lastIndexOf(']');
   if (firstBracket !== -1 && lastBracket > firstBracket) {
     const cleanedArray = cleanJSON(cleaned.slice(firstBracket, lastBracket + 1));
-    try {
-      return JSON.parse(cleanedArray);
-    } catch {
+    try {} catch {
       // All fallbacks failed
     }
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON array from text
statusReason: Failed to extract valid JSON from response

[Killed] ObjectLiteral
src/utils/json-extractor.js:108:42
   }
 
   // All strategies failed - log the raw text for debugging
-  logger.error('JSON extraction failed', {
-    rawText: text.substring(0, 500),
-    textLength: text.length
-  });
+  logger.error('JSON extraction failed', {});
 
   throw new Error('Failed to extract valid JSON from response');
killedBy: JSON Extractor extractJSON mutation testing coverage should log error with rawText and textLength context
statusReason: expected "vi.fn()" to be called with arguments: [ Any<String>, ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   Any<String>,

[Killed] StringLiteral
src/utils/json-extractor.js:113:19
     textLength: text.length
   });
 
-  throw new Error('Failed to extract valid JSON from response');
+  throw new Error("");
 }
 
killedBy: JSON Extractor extractJSON error handling should throw specific error for failed extraction
statusReason: expected [Function] to throw error including 'Failed to extract valid JSON from res…' but got ''
