[Killed] ObjectLiteral
src/core/features.js:10:32
    * - ENABLED: Available everywhere
    */
 
-  export const FEATURE_FLAGS = {
-    SHOW_ADS: {
-      phase: 'ENABLED',  // Show AdSense ads during loading screens
-      description: 'Display Google AdSense ads during quiz and results loading'
-    }
-  };
+  export const FEATURE_FLAGS = {};
 
   /**
killedBy: Feature Flags isFeatureEnabled should return true when phase is ENABLED
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/core/features.js:11:15
    */
 
   export const FEATURE_FLAGS = {
-    SHOW_ADS: {
-      phase: 'ENABLED',  // Show AdSense ads during loading screens
-      description: 'Display Google AdSense ads during quiz and results loading'
-    }
+    SHOW_ADS: {}
   };
 
killedBy: Feature Flags isFeatureEnabled should return true when phase is ENABLED
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/features.js:26:9
   export function isFeatureEnabled(featureName, context = 'default') {
     // Check for test override in localStorage (for E2E testing)
     const override = localStorage.getItem(`__test_feature_${featureName}`);
-    if (override === 'ENABLED') return true;
+    if (false) return true;
     if (override === 'DISABLED') return false;
 
killedBy: Feature Flags isFeatureEnabled localStorage overrides should return true when localStorage override is ENABLED
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/features.js:27:9
     // Check for test override in localStorage (for E2E testing)
     const override = localStorage.getItem(`__test_feature_${featureName}`);
     if (override === 'ENABLED') return true;
-    if (override === 'DISABLED') return false;
+    if (true) return false;
 
     const feature = FEATURE_FLAGS[featureName];
killedBy: Feature Flags isFeatureEnabled should return true when phase is ENABLED
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/features.js:31:19
 
     const feature = FEATURE_FLAGS[featureName];
 
-    if (!feature) {
-      console.warn(`[Features] Unknown feature: ${featureName}`);
-      return false;
-    }
+    if (!feature) {}
 
     switch (feature.phase) {
killedBy: Feature Flags isFeatureEnabled should return false for unknown feature
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] ConditionalExpression
src/core/features.js:40:16
       case 'DISABLED':
         return false;
       case 'SETTINGS_ONLY':
-        return context === 'settings';
+        return false;
       case 'ENABLED':
         return true;
killedBy: Feature Flags phase behaviors should return true only for settings context when phase is SETTINGS_ONLY
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/core/features.js:41:12
         return false;
       case 'SETTINGS_ONLY':
         return context === 'settings';
-      case 'ENABLED':
+      case "":
         return true;
       default:
killedBy: Feature Flags isFeatureEnabled should return true when phase is ENABLED
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/features.js:52:12
    * Get current phase for a feature (useful for debugging)
    */
   export function getFeaturePhase(featureName) {
-    return FEATURE_FLAGS[featureName]?.phase || 'UNKNOWN';
+    return true;
   }
killedBy: Feature Flags getFeaturePhase should return current phase for known feature
statusReason: expected [ 'DISABLED', 'SETTINGS_ONLY', …(1) ] to include true
