[Survived] ConditionalExpression
src/utils/logger.js:10:7
    * - Development: 'debug' (shows everything)
    * - Production: 'info' (hides debug messages)
    */
-  if (import.meta.env.DEV) {
+  if (true) {
     log.setLevel('debug');
   } else {

[Survived] BlockStatement
src/utils/logger.js:10:28
    * - Development: 'debug' (shows everything)
    * - Production: 'info' (hides debug messages)
    */
-  if (import.meta.env.DEV) {
-    log.setLevel('debug');
-  } else {
+  if (import.meta.env.DEV) {} else {
     log.setLevel('info');
   }

[NoCoverage] BlockStatement
src/utils/logger.js:12:10
    */
   if (import.meta.env.DEV) {
     log.setLevel('debug');
-  } else {
-    log.setLevel('info');
-  }
+  } else {}
 
   /**

[Killed] ArrayDeclaration
src/utils/logger.js:19:26
   /**
    * Sensitive keys to redact from logs
    */
-  const SENSITIVE_KEYS = ['apikey', 'key', 'password', 'token', 'secret', 'authorization'];
+  const SENSITIVE_KEYS = [];
 
   /**
killedBy: Logger sensitive data redaction should redact apiKey
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] Settings', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Settings",

[Killed] BlockStatement
src/utils/logger.js:24:33
   /**
    * Redact sensitive data from object
    */
-  function redactSensitive(obj) {
-    if (!obj || typeof obj !== 'object') {
-      return obj;
-    }
-
-    const redacted = Array.isArray(obj) ? [] : {};
-
-    for (const [key, value] of Object.entries(obj)) {
-      const lowerKey = key.toLowerCase();
-      if (SENSITIVE_KEYS.some(k => lowerKey.includes(k))) {
-        redacted[key] = '[REDACTED]';
-      } else if (typeof value === 'object' && value !== null) {
-        redacted[key] = redactSensitive(value);
-      } else {
-        redacted[key] = value;
-      }
-    }
-
-    return redacted;
-  }
+  function redactSensitive(obj) {}
 
   /**
killedBy: Logger context handling should include context in logs
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] Test', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Test",

[Killed] EqualityOperator
src/utils/logger.js:25:17
    * Redact sensitive data from object
    */
   function redactSensitive(obj) {
-    if (!obj || typeof obj !== 'object') {
+    if (!obj || typeof obj === 'object') {
       return obj;
     }
killedBy: Logger sensitive data redaction should redact apiKey
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] Settings', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Settings",

[Killed] ConditionalExpression
src/utils/logger.js:25:9
    * Redact sensitive data from object
    */
   function redactSensitive(obj) {
-    if (!obj || typeof obj !== 'object') {
+    if (false) {
       return obj;
     }
killedBy: Logger sensitive data redaction edge cases should handle primitive context values
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] Primitive', 'string value' ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Primitive",

[Killed] BlockStatement
src/utils/logger.js:31:53
 
     const redacted = Array.isArray(obj) ? [] : {};
 
-    for (const [key, value] of Object.entries(obj)) {
-      const lowerKey = key.toLowerCase();
-      if (SENSITIVE_KEYS.some(k => lowerKey.includes(k))) {
-        redacted[key] = '[REDACTED]';
-      } else if (typeof value === 'object' && value !== null) {
-        redacted[key] = redactSensitive(value);
-      } else {
-        redacted[key] = value;
-      }
-    }
+    for (const [key, value] of Object.entries(obj)) {}
 
     return redacted;
killedBy: Logger context handling should include context in logs
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] Test', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Test",

[Killed] MethodExpression
src/utils/logger.js:32:24
     const redacted = Array.isArray(obj) ? [] : {};
 
     for (const [key, value] of Object.entries(obj)) {
-      const lowerKey = key.toLowerCase();
+      const lowerKey = key.toUpperCase();
       if (SENSITIVE_KEYS.some(k => lowerKey.includes(k))) {
         redacted[key] = '[REDACTED]';
killedBy: Logger sensitive data redaction should redact apiKey
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] Settings', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Settings",

[Killed] ConditionalExpression
src/utils/logger.js:33:11
 
     for (const [key, value] of Object.entries(obj)) {
       const lowerKey = key.toLowerCase();
-      if (SENSITIVE_KEYS.some(k => lowerKey.includes(k))) {
+      if (false) {
         redacted[key] = '[REDACTED]';
       } else if (typeof value === 'object' && value !== null) {
killedBy: Logger sensitive data redaction should redact apiKey
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] Settings', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Settings",

[Killed] MethodExpression
src/utils/logger.js:33:11
 
     for (const [key, value] of Object.entries(obj)) {
       const lowerKey = key.toLowerCase();
-      if (SENSITIVE_KEYS.some(k => lowerKey.includes(k))) {
+      if (SENSITIVE_KEYS.every(k => lowerKey.includes(k))) {
         redacted[key] = '[REDACTED]';
       } else if (typeof value === 'object' && value !== null) {
killedBy: Logger sensitive data redaction should redact apiKey
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] Settings', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Settings",

[Killed] ConditionalExpression
src/utils/logger.js:35:18
       const lowerKey = key.toLowerCase();
       if (SENSITIVE_KEYS.some(k => lowerKey.includes(k))) {
         redacted[key] = '[REDACTED]';
-      } else if (typeof value === 'object' && value !== null) {
+      } else if (false) {
         redacted[key] = redactSensitive(value);
       } else {
killedBy: Logger sensitive data redaction should redact nested sensitive data
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Config",

[Killed] EqualityOperator
src/utils/logger.js:35:18
       const lowerKey = key.toLowerCase();
       if (SENSITIVE_KEYS.some(k => lowerKey.includes(k))) {
         redacted[key] = '[REDACTED]';
-      } else if (typeof value === 'object' && value !== null) {
+      } else if (typeof value !== 'object' && value !== null) {
         redacted[key] = redactSensitive(value);
       } else {
killedBy: Logger sensitive data redaction should redact nested sensitive data
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Config",

[Killed] BlockStatement
src/utils/logger.js:37:14
         redacted[key] = '[REDACTED]';
       } else if (typeof value === 'object' && value !== null) {
         redacted[key] = redactSensitive(value);
-      } else {
-        redacted[key] = value;
-      }
+      } else {}
     }
 
killedBy: Logger context handling should include context in logs
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] Test', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Test",

[Killed] BlockStatement
src/utils/logger.js:48:35
   /**
    * Format context object for logging
    */
-  function formatContext(context) {
-    if (!context || Object.keys(context).length === 0) {
-      return '';
-    }
-    return redactSensitive(context);
-  }
+  function formatContext(context) {}
 
   /**
killedBy: Logger context handling should include context in logs
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] Test', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Test",

[Killed] ConditionalExpression
src/utils/logger.js:49:9
    * Format context object for logging
    */
   function formatContext(context) {
-    if (!context || Object.keys(context).length === 0) {
+    if (true) {
       return '';
     }
killedBy: Logger context handling should include context in logs
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] Test', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Test",

[Killed] BooleanLiteral
src/utils/logger.js:49:9
    * Format context object for logging
    */
   function formatContext(context) {
-    if (!context || Object.keys(context).length === 0) {
+    if (context || Object.keys(context).length === 0) {
       return '';
     }
killedBy: Logger context handling should include context in logs
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] Test', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "[INFO] Test",

[Killed] BlockStatement
src/utils/logger.js:59:34
    * Logger API - wraps loglevel with redaction and formatting
    */
   export const logger = {
-    debug(message, context = {}) {
-      const formatted = formatContext(context);
-      formatted ? log.debug(`[DEBUG] ${message}`, formatted) : log.debug(`[DEBUG] ${message}`);
-    },
+    debug(message, context = {}) {},
 
     info(message, context = {}) {
killedBy: Logger log levels should log debug messages
statusReason: expected "vi.fn()" to be called with arguments: [ '[DEBUG] Test debug' ]

Number of calls: 0

[Killed] BlockStatement
src/utils/logger.js:64:33
       formatted ? log.debug(`[DEBUG] ${message}`, formatted) : log.debug(`[DEBUG] ${message}`);
     },
 
-    info(message, context = {}) {
-      const formatted = formatContext(context);
-      formatted ? log.info(`[INFO] ${message}`, formatted) : log.info(`[INFO] ${message}`);
-    },
+    info(message, context = {}) {},
 
     warn(message, context = {}) {
killedBy: Logger log levels should log info messages
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] Test info' ]

Number of calls: 0

[Killed] BlockStatement
src/utils/logger.js:69:33
       formatted ? log.info(`[INFO] ${message}`, formatted) : log.info(`[INFO] ${message}`);
     },
 
-    warn(message, context = {}) {
-      const formatted = formatContext(context);
-      formatted ? log.warn(`[WARN] ${message}`, formatted) : log.warn(`[WARN] ${message}`);
-      // Send to telemetry (warnings are important)
-      telemetry.track('log', { level: 'warn', message, context: formatted || {} });
-    },
+    warn(message, context = {}) {},
 
     error(message, context = {}) {
killedBy: Logger log levels should log warn messages
statusReason: expected "vi.fn()" to be called with arguments: [ '[WARN] Test warn' ]

Number of calls: 0

[NoCoverage] StringLiteral
src/utils/logger.js:71:28
 
     warn(message, context = {}) {
       const formatted = formatContext(context);
-      formatted ? log.warn(`[WARN] ${message}`, formatted) : log.warn(`[WARN] ${message}`);
+      formatted ? log.warn(``, formatted) : log.warn(`[WARN] ${message}`);
       // Send to telemetry (warnings are important)
       telemetry.track('log', { level: 'warn', message, context: formatted || {} });

[Survived] ConditionalExpression
src/utils/logger.js:73:65
       const formatted = formatContext(context);
       formatted ? log.warn(`[WARN] ${message}`, formatted) : log.warn(`[WARN] ${message}`);
       // Send to telemetry (warnings are important)
-      telemetry.track('log', { level: 'warn', message, context: formatted || {} });
+      telemetry.track('log', { level: 'warn', message, context: false });
     },
 

[Survived] ConditionalExpression
src/utils/logger.js:73:65
       const formatted = formatContext(context);
       formatted ? log.warn(`[WARN] ${message}`, formatted) : log.warn(`[WARN] ${message}`);
       // Send to telemetry (warnings are important)
-      telemetry.track('log', { level: 'warn', message, context: formatted || {} });
+      telemetry.track('log', { level: 'warn', message, context: true });
     },
 

[Killed] BlockStatement
src/utils/logger.js:76:34
       telemetry.track('log', { level: 'warn', message, context: formatted || {} });
     },
 
-    error(message, context = {}) {
-      const formatted = formatContext(context);
-      formatted ? log.error(`[ERROR] ${message}`, formatted) : log.error(`[ERROR] ${message}`);
-      // Send to telemetry (errors are critical)
-      telemetry.track('error', { message, context: formatted || {} });
-    },
+    error(message, context = {}) {},
 
     /**
killedBy: Logger log levels should log error messages
statusReason: expected "vi.fn()" to be called with arguments: [ '[ERROR] Test error' ]

Number of calls: 0

[Killed] StringLiteral
src/utils/logger.js:78:74
 
     error(message, context = {}) {
       const formatted = formatContext(context);
-      formatted ? log.error(`[ERROR] ${message}`, formatted) : log.error(`[ERROR] ${message}`);
+      formatted ? log.error(`[ERROR] ${message}`, formatted) : log.error(``);
       // Send to telemetry (errors are critical)
       telemetry.track('error', { message, context: formatted || {} });
killedBy: Logger log levels should log error messages
statusReason: expected "vi.fn()" to be called with arguments: [ '[ERROR] Test error' ]

Received: 

  1st vi.fn() call:

  [
-   "[ERROR] Test error",

[Survived] ConditionalExpression
src/utils/logger.js:80:52
       const formatted = formatContext(context);
       formatted ? log.error(`[ERROR] ${message}`, formatted) : log.error(`[ERROR] ${message}`);
       // Send to telemetry (errors are critical)
-      telemetry.track('error', { message, context: formatted || {} });
+      telemetry.track('error', { message, context: true });
     },
 

[Survived] ConditionalExpression
src/utils/logger.js:80:52
       const formatted = formatContext(context);
       formatted ? log.error(`[ERROR] ${message}`, formatted) : log.error(`[ERROR] ${message}`);
       // Send to telemetry (errors are critical)
-      telemetry.track('error', { message, context: formatted || {} });
+      telemetry.track('error', { message, context: false });
     },
 

[Killed] BlockStatement
src/utils/logger.js:86:29
     /**
      * Log performance metric
      */
-    perf(metric, data = {}) {
-      this.info(`[PERF] ${metric}`, data);
-      // Send to telemetry (performance metrics are important)
-      telemetry.track('metric', { name: metric, ...data });
-    },
+    perf(metric, data = {}) {},
 
     /**
killedBy: Logger special methods should log performance metrics
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] [PERF] Page Load', …(1) ]

Number of calls: 0

[Survived] StringLiteral
src/utils/logger.js:89:23
     perf(metric, data = {}) {
       this.info(`[PERF] ${metric}`, data);
       // Send to telemetry (performance metrics are important)
-      telemetry.track('metric', { name: metric, ...data });
+      telemetry.track("", { name: metric, ...data });
     },
 

[Survived] ObjectLiteral
src/utils/logger.js:89:33
     perf(metric, data = {}) {
       this.info(`[PERF] ${metric}`, data);
       // Send to telemetry (performance metrics are important)
-      telemetry.track('metric', { name: metric, ...data });
+      telemetry.track('metric', {});
     },
 

[Killed] BlockStatement
src/utils/logger.js:95:31
     /**
      * Log user action (for analytics/debugging)
      */
-    action(action, data = {}) {
-      this.debug(`[ACTION] ${action}`, data);
-      // Send to telemetry (user actions help debug flows)
-      telemetry.track('event', { action, ...data });
-    },
+    action(action, data = {}) {},
 
     /**
killedBy: Logger special methods should log user actions
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Survived] ObjectLiteral
src/utils/logger.js:98:32
     action(action, data = {}) {
       this.debug(`[ACTION] ${action}`, data);
       // Send to telemetry (user actions help debug flows)
-      telemetry.track('event', { action, ...data });
+      telemetry.track('event', {});
     },
 

[Killed] BlockStatement
src/utils/logger.js:104:16
     /**
      * Get the underlying loglevel instance (for advanced use)
      */
-    getLevel() {
-      return log.getLevel();
-    },
+    getLevel() {},
 
     /**
killedBy: Logger getLevel and setLevel should get current log level
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/utils/logger.js:111:21
     /**
      * Set log level manually (useful for debugging in production)
      */
-    setLevel(level) {
-      log.setLevel(level);
-    },
+    setLevel(level) {},
 
     /**
killedBy: Logger getLevel and setLevel should set log level
statusReason: expected "vi.fn()" to be called with arguments: [ 'debug' ]

Number of calls: 0

[Killed] BlockStatement
src/utils/logger.js:121:23
      * @param {string} context.module - Module name to prefix logs with
      * @returns {Object} Child logger with same methods
      */
-    child({ module }) {
-      const prefix = `[${module}]`;
-      return {
-        debug: (message, context = {}) => logger.debug(`${prefix} ${message}`, context),
-        info: (message, context = {}) => logger.info(`${prefix} ${message}`, context),
-        warn: (message, context = {}) => logger.warn(`${prefix} ${message}`, context),
-        error: (message, context = {}) => logger.error(`${prefix} ${message}`, context),
-        perf: (metric, data = {}) => logger.perf(`${prefix} ${metric}`, data),
-        action: (action, data = {}) => logger.action(`${prefix} ${action}`, data),
-      };
-    }
+    child({ module }) {}
   };
killedBy: Logger child logger should create child logger with module prefix
statusReason: Cannot read properties of undefined (reading 'info')

[Killed] StringLiteral
src/utils/logger.js:122:22
      * @returns {Object} Child logger with same methods
      */
     child({ module }) {
-      const prefix = `[${module}]`;
+      const prefix = ``;
       return {
         debug: (message, context = {}) => logger.debug(`${prefix} ${message}`, context),
killedBy: Logger child logger should create child logger with module prefix
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] [TestModule] Child message' ]

Received: 

  1st vi.fn() call:

  [
-   "[INFO] [TestModule] Child message",

[Killed] ObjectLiteral
src/utils/logger.js:123:14
      */
     child({ module }) {
       const prefix = `[${module}]`;
-      return {
-        debug: (message, context = {}) => logger.debug(`${prefix} ${message}`, context),
-        info: (message, context = {}) => logger.info(`${prefix} ${message}`, context),
-        warn: (message, context = {}) => logger.warn(`${prefix} ${message}`, context),
-        error: (message, context = {}) => logger.error(`${prefix} ${message}`, context),
-        perf: (metric, data = {}) => logger.perf(`${prefix} ${metric}`, data),
-        action: (action, data = {}) => logger.action(`${prefix} ${action}`, data),
-      };
+      return {};
     }
   };
killedBy: Logger child logger should create child logger with module prefix
statusReason: child.info is not a function

[Killed] ArrowFunction
src/utils/logger.js:124:16
     child({ module }) {
       const prefix = `[${module}]`;
       return {
-        debug: (message, context = {}) => logger.debug(`${prefix} ${message}`, context),
+        debug: () => undefined,
         info: (message, context = {}) => logger.info(`${prefix} ${message}`, context),
         warn: (message, context = {}) => logger.warn(`${prefix} ${message}`, context),
killedBy: Logger child logger should prefix debug messages
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] ArrowFunction
src/utils/logger.js:125:15
       const prefix = `[${module}]`;
       return {
         debug: (message, context = {}) => logger.debug(`${prefix} ${message}`, context),
-        info: (message, context = {}) => logger.info(`${prefix} ${message}`, context),
+        info: () => undefined,
         warn: (message, context = {}) => logger.warn(`${prefix} ${message}`, context),
         error: (message, context = {}) => logger.error(`${prefix} ${message}`, context),
killedBy: Logger child logger should create child logger with module prefix
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] [TestModule] Child message' ]

Number of calls: 0

[Killed] StringLiteral
src/utils/logger.js:125:54
       const prefix = `[${module}]`;
       return {
         debug: (message, context = {}) => logger.debug(`${prefix} ${message}`, context),
-        info: (message, context = {}) => logger.info(`${prefix} ${message}`, context),
+        info: (message, context = {}) => logger.info(``, context),
         warn: (message, context = {}) => logger.warn(`${prefix} ${message}`, context),
         error: (message, context = {}) => logger.error(`${prefix} ${message}`, context),
killedBy: Logger child logger should create child logger with module prefix
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] [TestModule] Child message' ]

Received: 

  1st vi.fn() call:

  [
-   "[INFO] [TestModule] Child message",

[Killed] ArrowFunction
src/utils/logger.js:126:15
       return {
         debug: (message, context = {}) => logger.debug(`${prefix} ${message}`, context),
         info: (message, context = {}) => logger.info(`${prefix} ${message}`, context),
-        warn: (message, context = {}) => logger.warn(`${prefix} ${message}`, context),
+        warn: () => undefined,
         error: (message, context = {}) => logger.error(`${prefix} ${message}`, context),
         perf: (metric, data = {}) => logger.perf(`${prefix} ${metric}`, data),
killedBy: Logger child logger should prefix warn messages
statusReason: expected "vi.fn()" to be called with arguments: [ '[WARN] [Network] Warning message' ]

Number of calls: 0

[Killed] ArrowFunction
src/utils/logger.js:127:16
         debug: (message, context = {}) => logger.debug(`${prefix} ${message}`, context),
         info: (message, context = {}) => logger.info(`${prefix} ${message}`, context),
         warn: (message, context = {}) => logger.warn(`${prefix} ${message}`, context),
-        error: (message, context = {}) => logger.error(`${prefix} ${message}`, context),
+        error: () => undefined,
         perf: (metric, data = {}) => logger.perf(`${prefix} ${metric}`, data),
         action: (action, data = {}) => logger.action(`${prefix} ${action}`, data),
killedBy: Logger child logger should prefix error messages
statusReason: expected "vi.fn()" to be called with arguments: [ '[ERROR] [DB] Error message' ]

Number of calls: 0

[Killed] ArrowFunction
src/utils/logger.js:128:15
         info: (message, context = {}) => logger.info(`${prefix} ${message}`, context),
         warn: (message, context = {}) => logger.warn(`${prefix} ${message}`, context),
         error: (message, context = {}) => logger.error(`${prefix} ${message}`, context),
-        perf: (metric, data = {}) => logger.perf(`${prefix} ${metric}`, data),
+        perf: () => undefined,
         action: (action, data = {}) => logger.action(`${prefix} ${action}`, data),
       };
killedBy: Logger child logger should prefix perf messages
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ArrowFunction
src/utils/logger.js:129:17
         warn: (message, context = {}) => logger.warn(`${prefix} ${message}`, context),
         error: (message, context = {}) => logger.error(`${prefix} ${message}`, context),
         perf: (metric, data = {}) => logger.perf(`${prefix} ${metric}`, data),
-        action: (action, data = {}) => logger.action(`${prefix} ${action}`, data),
+        action: () => undefined,
       };
     }
killedBy: Logger child logger should prefix action messages
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
src/utils/logger.js:129:54
         warn: (message, context = {}) => logger.warn(`${prefix} ${message}`, context),
         error: (message, context = {}) => logger.error(`${prefix} ${message}`, context),
         perf: (metric, data = {}) => logger.perf(`${prefix} ${metric}`, data),
-        action: (action, data = {}) => logger.action(`${prefix} ${action}`, data),
+        action: (action, data = {}) => logger.action(``, data),
       };
     }
killedBy: Logger child logger should prefix action messages
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[DEBUG] [ACTION] [UI] Button Click",
