[Killed] BlockStatement
src/core/settings.js:31:19
   export function getSettings() {
     try {
       const stored = localStorage.getItem(SETTINGS_KEY);
-      if (stored) {
-        return { ...DEFAULT_SETTINGS, ...JSON.parse(stored) };
-      }
+      if (stored) {}
     } catch (error) {
       logger.error('Error reading settings', { error: error.message });
killedBy: Settings Utilities getSettings should return stored settings merged with defaults
statusReason: expected 'middle school' to be 'college' // Object.is equality

[Survived] BlockStatement
src/core/settings.js:34:21
       if (stored) {
         return { ...DEFAULT_SETTINGS, ...JSON.parse(stored) };
       }
-    } catch (error) {
-      logger.error('Error reading settings', { error: error.message });
-    }
+    } catch (error) {}
     return { ...DEFAULT_SETTINGS };
   }
