[Killed] BlockStatement
src/core/state.js:50:25
      * Subscribe to state changes
      * @param {Function} callback - Function to call when state changes
      */
-    subscribe(callback) {
-      this.listeners.push(callback);
-    }
+    subscribe(callback) {}
 
     /**
killedBy: AppState subscribe and notify should notify subscribers on set
statusReason: expected "vi.fn()" to be called with arguments: [ 'currentTopic', 'Math' ]

Number of calls: 0

[Killed] BlockStatement
src/core/state.js:96:35
      * Add questions to the continue chain
      * @param {Array} questions - New questions to add
      */
-    addToContinueChain(questions) {
-      if (this.data.continueChain) {
-        this.data.continueChain.continueCount++;
-        this.data.continueChain.previousQuestions.push(
-          ...questions.map(q => q.question)
-        );
-      }
-    }
+    addToContinueChain(questions) {}
 
     /**
killedBy: AppState continue chain should add to continue chain
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/state.js:97:11
      * @param {Array} questions - New questions to add
      */
     addToContinueChain(questions) {
-      if (this.data.continueChain) {
+      if (true) {
         this.data.continueChain.continueCount++;
         this.data.continueChain.previousQuestions.push(
killedBy: AppState continue chain should not add to chain if not initialized
statusReason: Cannot read properties of null (reading 'continueCount')
