[Killed] BlockStatement
src/services/cost-service.js:13:38
  * @param {string} modelId - Model ID (e.g., 'meta-llama/llama-3-8b-instruct:free')
  * @returns {boolean} True if model is free tier
  */
-export function isFreeModel(modelId) {
-  if (!modelId) return false;
-  return modelId.endsWith(':free');
-}
+export function isFreeModel(modelId) {}
 
 /**
killedBy: Cost Service isFreeModel should return true for models ending with :free
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/services/cost-service.js:14:24
  * @returns {boolean} True if model is free tier
  */
 export function isFreeModel(modelId) {
-  if (!modelId) return false;
+  if (!modelId) return true;
   return modelId.endsWith(':free');
 }
killedBy: Cost Service isFreeModel should return false for null/undefined/empty
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/services/cost-service.js:14:7
  * @returns {boolean} True if model is free tier
  */
 export function isFreeModel(modelId) {
-  if (!modelId) return false;
+  if (true) return false;
   return modelId.endsWith(':free');
 }
killedBy: Cost Service isFreeModel should return true for models ending with :free
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/services/cost-service.js:15:10
  */
 export function isFreeModel(modelId) {
   if (!modelId) return false;
-  return modelId.endsWith(':free');
+  return modelId.startsWith(':free');
 }
 
killedBy: Cost Service isFreeModel should return true for models ending with :free
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/services/cost-service.js:15:27
  */
 export function isFreeModel(modelId) {
   if (!modelId) return false;
-  return modelId.endsWith(':free');
+  return modelId.endsWith("");
 }
 
killedBy: Cost Service isFreeModel should return false for paid models
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/cost-service.js:23:44
  * @param {string} modelId - Free model ID (e.g., 'meta-llama/llama-3-8b-instruct:free')
  * @returns {string} Paid model ID (e.g., 'meta-llama/llama-3-8b-instruct')
  */
-export function getPaidEquivalent(modelId) {
-  if (!modelId) return modelId;
-  return modelId.replace(/:free$/, '');
-}
+export function getPaidEquivalent(modelId) {}
 
 /**
killedBy: Cost Service getPaidEquivalent should strip :free suffix from model ID
statusReason: expected undefined to be 'meta-llama/llama-3-8b-instruct' // Object.is equality

[Killed] ConditionalExpression
src/services/cost-service.js:24:7
  * @returns {string} Paid model ID (e.g., 'meta-llama/llama-3-8b-instruct')
  */
 export function getPaidEquivalent(modelId) {
-  if (!modelId) return modelId;
+  if (true) return modelId;
   return modelId.replace(/:free$/, '');
 }
killedBy: Cost Service getPaidEquivalent should strip :free suffix from model ID
statusReason: expected 'meta-llama/llama-3-8b-instruct:free' to be 'meta-llama/llama-3-8b-instruct' // Object.is equality

[Killed] BooleanLiteral
src/services/cost-service.js:24:7
  * @returns {string} Paid model ID (e.g., 'meta-llama/llama-3-8b-instruct')
  */
 export function getPaidEquivalent(modelId) {
-  if (!modelId) return modelId;
+  if (modelId) return modelId;
   return modelId.replace(/:free$/, '');
 }
killedBy: Cost Service getPaidEquivalent should strip :free suffix from model ID
statusReason: expected 'meta-llama/llama-3-8b-instruct:free' to be 'meta-llama/llama-3-8b-instruct' // Object.is equality

[Killed] BlockStatement
src/services/cost-service.js:35:81
  * @param {string} modelId - Model ID to look up pricing for
  * @returns {number} Estimated cost in USD
  */
-export function calculateEstimatedCost(promptTokens, completionTokens, modelId) {
-  const pricing = getModelPricing(modelId);
-
-  if (!pricing) {
-    logger.debug('No pricing found for model', { modelId });
-    return 0;
-  }
-
-  const promptPrice = parseFloat(pricing.prompt) || 0;
-  const completionPrice = parseFloat(pricing.completion) || 0;
-
-  const cost = (promptTokens * promptPrice) + (completionTokens * completionPrice);
-
-  return cost;
-}
+export function calculateEstimatedCost(promptTokens, completionTokens, modelId) {}
 
 /**
killedBy: Cost Service calculateEstimatedCost should calculate cost based on token counts and pricing
statusReason: expected undefined to be close to 0.0000175, received difference is NaN, but expected 5e-8

[Killed] ConditionalExpression
src/services/cost-service.js:38:7
 export function calculateEstimatedCost(promptTokens, completionTokens, modelId) {
   const pricing = getModelPricing(modelId);
 
-  if (!pricing) {
+  if (false) {
     logger.debug('No pricing found for model', { modelId });
     return 0;
killedBy: Cost Service calculateEstimatedCost should return 0 when no pricing found
statusReason: Cannot read properties of null (reading 'prompt')

[Killed] BlockStatement
src/services/cost-service.js:38:17
 export function calculateEstimatedCost(promptTokens, completionTokens, modelId) {
   const pricing = getModelPricing(modelId);
 
-  if (!pricing) {
-    logger.debug('No pricing found for model', { modelId });
-    return 0;
-  }
+  if (!pricing) {}
 
   const promptPrice = parseFloat(pricing.prompt) || 0;
killedBy: Cost Service calculateEstimatedCost should return 0 when no pricing found
statusReason: Cannot read properties of null (reading 'prompt')

[Survived] ObjectLiteral
src/services/cost-service.js:39:48
   const pricing = getModelPricing(modelId);
 
   if (!pricing) {
-    logger.debug('No pricing found for model', { modelId });
+    logger.debug('No pricing found for model', {});
     return 0;
   }

[Killed] LogicalOperator
src/services/cost-service.js:43:23
     return 0;
   }
 
-  const promptPrice = parseFloat(pricing.prompt) || 0;
+  const promptPrice = parseFloat(pricing.prompt) && 0;
   const completionPrice = parseFloat(pricing.completion) || 0;
 
killedBy: Cost Service calculateEstimatedCost should calculate cost based on token counts and pricing
statusReason: expected 0.0000105 to be close to 0.0000175, received difference is 0.000006999999999999999, but expected 5e-8

[Killed] ConditionalExpression
src/services/cost-service.js:43:23
     return 0;
   }
 
-  const promptPrice = parseFloat(pricing.prompt) || 0;
+  const promptPrice = false;
   const completionPrice = parseFloat(pricing.completion) || 0;
 
killedBy: Cost Service calculateEstimatedCost should calculate cost based on token counts and pricing
statusReason: expected 0.0000105 to be close to 0.0000175, received difference is 0.000006999999999999999, but expected 5e-8

[Killed] LogicalOperator
src/services/cost-service.js:44:27
   }
 
   const promptPrice = parseFloat(pricing.prompt) || 0;
-  const completionPrice = parseFloat(pricing.completion) || 0;
+  const completionPrice = parseFloat(pricing.completion) && 0;
 
   const cost = (promptTokens * promptPrice) + (completionTokens * completionPrice);
killedBy: Cost Service calculateEstimatedCost should calculate cost based on token counts and pricing
statusReason: expected 0.000007000000000000001 to be close to 0.0000175, received difference is 0.000010499999999999998, but expected 5e-8

[Killed] ConditionalExpression
src/services/cost-service.js:44:27
   }
 
   const promptPrice = parseFloat(pricing.prompt) || 0;
-  const completionPrice = parseFloat(pricing.completion) || 0;
+  const completionPrice = true;
 
   const cost = (promptTokens * promptPrice) + (completionTokens * completionPrice);
killedBy: Cost Service calculateEstimatedCost should calculate cost based on token counts and pricing
statusReason: expected 50.000007 to be close to 0.0000175, received difference is 49.9999895, but expected 5e-8

[Killed] ArithmeticOperator
src/services/cost-service.js:46:17
   const promptPrice = parseFloat(pricing.prompt) || 0;
   const completionPrice = parseFloat(pricing.completion) || 0;
 
-  const cost = (promptTokens * promptPrice) + (completionTokens * completionPrice);
+  const cost = (promptTokens / promptPrice) + (completionTokens * completionPrice);
 
   return cost;
killedBy: Cost Service calculateEstimatedCost should calculate cost based on token counts and pricing
statusReason: expected 1428571428.571439 to be close to 0.0000175, received difference is 1428571428.5714216, but expected 5e-8

[Killed] ArithmeticOperator
src/services/cost-service.js:46:48
   const promptPrice = parseFloat(pricing.prompt) || 0;
   const completionPrice = parseFloat(pricing.completion) || 0;
 
-  const cost = (promptTokens * promptPrice) + (completionTokens * completionPrice);
+  const cost = (promptTokens * promptPrice) + (completionTokens / completionPrice);
 
   return cost;
killedBy: Cost Service calculateEstimatedCost should calculate cost based on token counts and pricing
statusReason: expected 238095238.0952451 to be close to 0.0000175, received difference is 238095238.0952276, but expected 5e-8

[Killed] BlockStatement
src/services/cost-service.js:57:53
  * @param {boolean} isFree - Whether the model is free
  * @returns {string} Formatted cost string (e.g., "$0.002", "Free", "$0.00")
  */
-export function formatCost(costUsd, isFree = false) {
-  if (isFree && costUsd === 0) {
-    return 'Free';
-  }
-
-  // For very small costs, show more decimal places
-  if (costUsd > 0 && costUsd < 0.01) {
-    // Show up to 4 decimal places for small amounts
-    return `$${costUsd.toFixed(4)}`;
-  }
-
-  // Standard 2 decimal places for larger amounts
-  return `$${costUsd.toFixed(2)}`;
-}
+export function formatCost(costUsd, isFree = false) {}
 
 /**
killedBy: Cost Service formatCost should return "Free" for free models with zero cost
statusReason: expected undefined to be 'Free' // Object.is equality

[NoCoverage] BooleanLiteral
src/services/cost-service.js:57:46
  * @param {boolean} isFree - Whether the model is free
  * @returns {string} Formatted cost string (e.g., "$0.002", "Free", "$0.00")
  */
-export function formatCost(costUsd, isFree = false) {
+export function formatCost(costUsd, isFree = true) {
   if (isFree && costUsd === 0) {
     return 'Free';

[Killed] BlockStatement
src/services/cost-service.js:58:32
  * @returns {string} Formatted cost string (e.g., "$0.002", "Free", "$0.00")
  */
 export function formatCost(costUsd, isFree = false) {
-  if (isFree && costUsd === 0) {
-    return 'Free';
-  }
+  if (isFree && costUsd === 0) {}
 
   // For very small costs, show more decimal places
killedBy: Cost Service formatCost should return "Free" for free models with zero cost
statusReason: expected '$0.00' to be 'Free' // Object.is equality

[Killed] EqualityOperator
src/services/cost-service.js:58:17
  * @returns {string} Formatted cost string (e.g., "$0.002", "Free", "$0.00")
  */
 export function formatCost(costUsd, isFree = false) {
-  if (isFree && costUsd === 0) {
+  if (isFree && costUsd !== 0) {
     return 'Free';
   }
killedBy: Cost Service formatCost should return "Free" for free models with zero cost
statusReason: expected '$0.00' to be 'Free' // Object.is equality

[Killed] EqualityOperator
src/services/cost-service.js:63:7
   }
 
   // For very small costs, show more decimal places
-  if (costUsd > 0 && costUsd < 0.01) {
+  if (costUsd <= 0 && costUsd < 0.01) {
     // Show up to 4 decimal places for small amounts
     return `$${costUsd.toFixed(4)}`;
killedBy: Cost Service formatCost should show 4 decimal places for small costs
statusReason: expected '$0.00' to be '$0.0001' // Object.is equality

[Killed] ConditionalExpression
src/services/cost-service.js:63:7
   }
 
   // For very small costs, show more decimal places
-  if (costUsd > 0 && costUsd < 0.01) {
+  if (true) {
     // Show up to 4 decimal places for small amounts
     return `$${costUsd.toFixed(4)}`;
killedBy: Cost Service formatCost should show 2 decimal places for larger costs
statusReason: expected '$0.0100' to be '$0.01' // Object.is equality

[Killed] OptionalChaining
src/services/cost-service.js:89:22
  */
 export function getUsageSummary(usage, modelId) {
   const isFree = isFreeModel(modelId);
-  const actualCost = usage?.costUsd || 0;
+  const actualCost = usage.costUsd || 0;
 
   let estimatedCost = null;
killedBy: Cost Service getUsageSummary should handle missing usage data gracefully
statusReason: Cannot read properties of null (reading 'costUsd')

[Killed] LogicalOperator
src/services/cost-service.js:89:22
  */
 export function getUsageSummary(usage, modelId) {
   const isFree = isFreeModel(modelId);
-  const actualCost = usage?.costUsd || 0;
+  const actualCost = usage?.costUsd && 0;
 
   let estimatedCost = null;
killedBy: Cost Service getUsageSummary should return summary for paid model without estimated cost
statusReason: expected +0 to be 0.05 // Object.is equality

[Killed] ConditionalExpression
src/services/cost-service.js:95:7
   let formattedEstimatedCost = null;
 
   // For free models, calculate what it would cost on the paid equivalent
-  if (isFree) {
+  if (true) {
     const paidModelId = getPaidEquivalent(modelId);
     estimatedCost = calculateEstimatedCost(
killedBy: Cost Service getUsageSummary should return summary for paid model without estimated cost
statusReason: expected 0.0000175 to be null

[Killed] BlockStatement
src/services/cost-service.js:95:15
   let formattedEstimatedCost = null;
 
   // For free models, calculate what it would cost on the paid equivalent
-  if (isFree) {
-    const paidModelId = getPaidEquivalent(modelId);
-    estimatedCost = calculateEstimatedCost(
-      usage?.promptTokens || 0,
-      usage?.completionTokens || 0,
-      paidModelId
-    );
-
-    if (estimatedCost > 0) {
-      formattedEstimatedCost = formatCost(estimatedCost, false);
-    }
-  }
+  if (isFree) {}
 
   return {
killedBy: Cost Service getUsageSummary should return complete summary for free model
statusReason: expected null to be close to 0.0000175, received difference is 0.0000175, but expected 5e-8

[Killed] ConditionalExpression
src/services/cost-service.js:98:7
   if (isFree) {
     const paidModelId = getPaidEquivalent(modelId);
     estimatedCost = calculateEstimatedCost(
-      usage?.promptTokens || 0,
+      false,
       usage?.completionTokens || 0,
       paidModelId
killedBy: Cost Service getUsageSummary should return complete summary for free model
statusReason: expected 0.0000105 to be close to 0.0000175, received difference is 0.000006999999999999999, but expected 5e-8

[Killed] LogicalOperator
src/services/cost-service.js:98:7
   if (isFree) {
     const paidModelId = getPaidEquivalent(modelId);
     estimatedCost = calculateEstimatedCost(
-      usage?.promptTokens || 0,
+      usage?.promptTokens && 0,
       usage?.completionTokens || 0,
       paidModelId
killedBy: Cost Service getUsageSummary should return complete summary for free model
statusReason: expected 0.0000105 to be close to 0.0000175, received difference is 0.000006999999999999999, but expected 5e-8

[Killed] ConditionalExpression
src/services/cost-service.js:99:7
     const paidModelId = getPaidEquivalent(modelId);
     estimatedCost = calculateEstimatedCost(
       usage?.promptTokens || 0,
-      usage?.completionTokens || 0,
+      true,
       paidModelId
     );
killedBy: Cost Service getUsageSummary should return complete summary for free model
statusReason: expected 0.0000072100000000000004 to be close to 0.0000175, received difference is 0.000010289999999999998, but expected 5e-8

[Killed] ConditionalExpression
src/services/cost-service.js:99:7
     const paidModelId = getPaidEquivalent(modelId);
     estimatedCost = calculateEstimatedCost(
       usage?.promptTokens || 0,
-      usage?.completionTokens || 0,
+      false,
       paidModelId
     );
killedBy: Cost Service getUsageSummary should return complete summary for free model
statusReason: expected 0.000007000000000000001 to be close to 0.0000175, received difference is 0.000010499999999999998, but expected 5e-8

[Killed] ConditionalExpression
src/services/cost-service.js:103:9
       paidModelId
     );
 
-    if (estimatedCost > 0) {
+    if (false) {
       formattedEstimatedCost = formatCost(estimatedCost, false);
     }
killedBy: Cost Service getUsageSummary should return complete summary for free model
statusReason: expected null to be '$0.0000' // Object.is equality

[Killed] BlockStatement
src/services/cost-service.js:103:28
       paidModelId
     );
 
-    if (estimatedCost > 0) {
-      formattedEstimatedCost = formatCost(estimatedCost, false);
-    }
+    if (estimatedCost > 0) {}
   }
 
killedBy: Cost Service getUsageSummary should return complete summary for free model
statusReason: expected null to be '$0.0000' // Object.is equality

[Survived] BooleanLiteral
src/services/cost-service.js:104:58
     );
 
     if (estimatedCost > 0) {
-      formattedEstimatedCost = formatCost(estimatedCost, false);
+      formattedEstimatedCost = formatCost(estimatedCost, true);
     }
   }

[Killed] ConditionalExpression
src/services/cost-service.js:109:19
   }
 
   return {
-    promptTokens: usage?.promptTokens || 0,
+    promptTokens: false,
     completionTokens: usage?.completionTokens || 0,
     totalTokens: usage?.totalTokens || 0,
killedBy: Cost Service getUsageSummary should return complete summary for free model
statusReason: expected false to be 100 // Object.is equality

[Killed] ConditionalExpression
src/services/cost-service.js:109:19
   }
 
   return {
-    promptTokens: usage?.promptTokens || 0,
+    promptTokens: true,
     completionTokens: usage?.completionTokens || 0,
     totalTokens: usage?.totalTokens || 0,
killedBy: Cost Service getUsageSummary should return complete summary for free model
statusReason: expected true to be 100 // Object.is equality

[Killed] ConditionalExpression
src/services/cost-service.js:110:23
 
   return {
     promptTokens: usage?.promptTokens || 0,
-    completionTokens: usage?.completionTokens || 0,
+    completionTokens: false,
     totalTokens: usage?.totalTokens || 0,
     actualCost,
killedBy: Cost Service getUsageSummary should return complete summary for free model
statusReason: expected false to be 50 // Object.is equality

[Killed] OptionalChaining
src/services/cost-service.js:110:23
 
   return {
     promptTokens: usage?.promptTokens || 0,
-    completionTokens: usage?.completionTokens || 0,
+    completionTokens: usage.completionTokens || 0,
     totalTokens: usage?.totalTokens || 0,
     actualCost,
killedBy: Cost Service getUsageSummary should handle missing usage data gracefully
statusReason: Cannot read properties of null (reading 'completionTokens')

[Killed] OptionalChaining
src/services/cost-service.js:111:18
   return {
     promptTokens: usage?.promptTokens || 0,
     completionTokens: usage?.completionTokens || 0,
-    totalTokens: usage?.totalTokens || 0,
+    totalTokens: usage.totalTokens || 0,
     actualCost,
     estimatedCost,
killedBy: Cost Service getUsageSummary should handle missing usage data gracefully
statusReason: Cannot read properties of null (reading 'totalTokens')

[Killed] ConditionalExpression
src/services/cost-service.js:111:18
   return {
     promptTokens: usage?.promptTokens || 0,
     completionTokens: usage?.completionTokens || 0,
-    totalTokens: usage?.totalTokens || 0,
+    totalTokens: true,
     actualCost,
     estimatedCost,
killedBy: Cost Service getUsageSummary should return complete summary for free model
statusReason: expected true to be 150 // Object.is equality
