[Survived] ArrayDeclaration
src/services/p2p-service.js:32:21
  * Google provides these free public STUN servers.
  * No external service or API key needed.
  */
-const ICE_SERVERS = [
-  { urls: 'stun:stun.l.google.com:19302' },
-  { urls: 'stun:stun1.l.google.com:19302' },
-  { urls: 'stun:stun2.l.google.com:19302' },
-];
+const ICE_SERVERS = [];
 
 /**

[Survived] StringLiteral
src/services/p2p-service.js:34:11
  */
 const ICE_SERVERS = [
   { urls: 'stun:stun.l.google.com:19302' },
-  { urls: 'stun:stun1.l.google.com:19302' },
+  { urls: "" },
   { urls: 'stun:stun2.l.google.com:19302' },
 ];

[Survived] StringLiteral
src/services/p2p-service.js:35:11
 const ICE_SERVERS = [
   { urls: 'stun:stun.l.google.com:19302' },
   { urls: 'stun:stun1.l.google.com:19302' },
-  { urls: 'stun:stun2.l.google.com:19302' },
+  { urls: "" },
 ];
 

[Survived] BooleanLiteral
src/services/p2p-service.js:70:24
     this.reconnectDelay = 2000;
 
     /** @type {boolean} */
-    this.isDestroyed = false;
+    this.isDestroyed = true;
 
     // Start handling signaling messages

[Survived] StringLiteral
src/services/p2p-service.js:75:15
     // Start handling signaling messages
     this._setupSignalingHandler();
 
-    log.debug('P2PService created');
+    log.debug("");
   }
 

[Killed] BlockStatement
src/services/p2p-service.js:83:28
    *
    * @private
    */
-  _setupSignalingHandler() {
-    this.signalingClient.startPolling((message) => {
-      this._handleSignalingMessage(message);
-    });
-  }
+  _setupSignalingHandler() {}
 
   /**
killedBy: P2PService constructor should start polling on creation
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/services/p2p-service.js:84:52
    * @private
    */
   _setupSignalingHandler() {
-    this.signalingClient.startPolling((message) => {
-      this._handleSignalingMessage(message);
-    });
+    this.signalingClient.startPolling((message) => {});
   }
 
killedBy: P2PService handling signaling messages should handle offer and send answer
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-2', ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
src/services/p2p-service.js:95:42
    * @private
    * @param {import('./signaling-client.js').SignalingMessage} message
    */
-  async _handleSignalingMessage(message) {
-    const { fromId, type, payload } = message;
-
-    log.debug('Received signaling message', { from: fromId, type });
-
-    try {
-      switch (type) {
-        case 'offer':
-          await this._handleOffer(fromId, payload);
-          break;
-        case 'answer':
-          await this._handleAnswer(fromId, payload);
-          break;
-        case 'ice':
-          await this._handleIceCandidate(fromId, payload);
-          break;
-        default:
-          log.warn('Unknown message type', { type });
-      }
-    } catch (error) {
-      log.error('Error handling signaling message', { type, error: error.message });
-    }
-  }
+  async _handleSignalingMessage(message) {}
 
   /**
killedBy: P2PService handling signaling messages should handle offer and send answer
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-2', ObjectContaining{…} ]

Number of calls: 0

[Survived] StringLiteral
src/services/p2p-service.js:98:15
   async _handleSignalingMessage(message) {
     const { fromId, type, payload } = message;
 
-    log.debug('Received signaling message', { from: fromId, type });
+    log.debug("", { from: fromId, type });
 
     try {

[Killed] BlockStatement
src/services/p2p-service.js:100:9
 
     log.debug('Received signaling message', { from: fromId, type });
 
-    try {
-      switch (type) {
-        case 'offer':
-          await this._handleOffer(fromId, payload);
-          break;
-        case 'answer':
-          await this._handleAnswer(fromId, payload);
-          break;
-        case 'ice':
-          await this._handleIceCandidate(fromId, payload);
-          break;
-        default:
-          log.warn('Unknown message type', { type });
-      }
-    } catch (error) {
+    try {} catch (error) {
       log.error('Error handling signaling message', { type, error: error.message });
     }
killedBy: P2PService handling signaling messages should handle offer and send answer
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-2', ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/p2p-service.js:102:9
 
     try {
       switch (type) {
-        case 'offer':
-          await this._handleOffer(fromId, payload);
-          break;
+        case 'offer':
         case 'answer':
           await this._handleAnswer(fromId, payload);
killedBy: P2PService handling signaling messages should handle offer and send answer
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-2', ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/p2p-service.js:105:9
         case 'offer':
           await this._handleOffer(fromId, payload);
           break;
-        case 'answer':
-          await this._handleAnswer(fromId, payload);
-          break;
+        case 'answer':
         case 'ice':
           await this._handleIceCandidate(fromId, payload);
killedBy: P2PService handling signaling messages should handle answer
statusReason: expected null to deeply equal ObjectContaining {"type": "answer"}

[Killed] StringLiteral
src/services/p2p-service.js:105:14
         case 'offer':
           await this._handleOffer(fromId, payload);
           break;
-        case 'answer':
+        case "":
           await this._handleAnswer(fromId, payload);
           break;
killedBy: P2PService handling signaling messages should handle answer
statusReason: expected null to deeply equal ObjectContaining {"type": "answer"}

[Survived] ConditionalExpression
src/services/p2p-service.js:108:9
         case 'answer':
           await this._handleAnswer(fromId, payload);
           break;
-        case 'ice':
-          await this._handleIceCandidate(fromId, payload);
-          break;
+        case 'ice':
         default:
           log.warn('Unknown message type', { type });

[Survived] StringLiteral
src/services/p2p-service.js:108:14
         case 'answer':
           await this._handleAnswer(fromId, payload);
           break;
-        case 'ice':
+        case "":
           await this._handleIceCandidate(fromId, payload);
           break;

[NoCoverage] ConditionalExpression
src/services/p2p-service.js:111:9
         case 'ice':
           await this._handleIceCandidate(fromId, payload);
           break;
-        default:
-          log.warn('Unknown message type', { type });
+        default:
       }
     } catch (error) {

[NoCoverage] ObjectLiteral
src/services/p2p-service.js:112:44
           await this._handleIceCandidate(fromId, payload);
           break;
         default:
-          log.warn('Unknown message type', { type });
+          log.warn('Unknown message type', {});
       }
     } catch (error) {

[NoCoverage] BlockStatement
src/services/p2p-service.js:114:21
         default:
           log.warn('Unknown message type', { type });
       }
-    } catch (error) {
-      log.error('Error handling signaling message', { type, error: error.message });
-    }
+    } catch (error) {}
   }
 

[Killed] ConditionalExpression
src/services/p2p-service.js:126:9
    * @returns {Promise<void>}
    */
   async createConnection(peerId) {
-    if (this.peers.has(peerId)) {
+    if (false) {
       log.warn('Connection already exists', { peerId });
       return;
killedBy: P2PService createConnection should not create duplicate connections
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/services/p2p-service.js:126:33
    * @returns {Promise<void>}
    */
   async createConnection(peerId) {
-    if (this.peers.has(peerId)) {
-      log.warn('Connection already exists', { peerId });
-      return;
-    }
+    if (this.peers.has(peerId)) {}
 
     log.info('Creating connection to peer', { peerId });
killedBy: P2PService createConnection should not create duplicate connections
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Survived] StringLiteral
src/services/p2p-service.js:127:16
    */
   async createConnection(peerId) {
     if (this.peers.has(peerId)) {
-      log.warn('Connection already exists', { peerId });
+      log.warn("", { peerId });
       return;
     }

[Survived] ObjectLiteral
src/services/p2p-service.js:134:47
     log.info('Creating connection to peer', { peerId });
 
     // Track telemetry
-    telemetry.track('p2p_connection_attempt', {
-      peerId,
-      role: 'initiator',
-    });
+    telemetry.track('p2p_connection_attempt', {});
 
     const peerConnection = this._createPeerConnection(peerId);

[Survived] StringLiteral
src/services/p2p-service.js:134:21
     log.info('Creating connection to peer', { peerId });
 
     // Track telemetry
-    telemetry.track('p2p_connection_attempt', {
+    telemetry.track("", {
       peerId,
       role: 'initiator',

[Survived] BooleanLiteral
src/services/p2p-service.js:143:16
 
     // Create data channel (initiator creates the channel)
     const dataChannel = peerConnection.connection.createDataChannel('party', {
-      ordered: true,
+      ordered: false,
     });
 

[Killed] StringLiteral
src/services/p2p-service.js:155:28
 
     await this.signalingClient.sendOffer(peerId, offer);
 
-    peerConnection.state = 'connecting';
+    peerConnection.state = "";
   }
 
killedBy: P2PService createConnection should create a new peer connection
statusReason: expected '' to be 'connecting' // Object.is equality

[Survived] StringLiteral
src/services/p2p-service.js:166:14
    * @param {Object} payload - Offer payload
    */
   async _handleOffer(peerId, payload) {
-    log.info('Handling offer from peer', { peerId });
+    log.info("", { peerId });
 
     // Create connection if it doesn't exist

[Killed] BlockStatement
src/services/p2p-service.js:170:26
 
     // Create connection if it doesn't exist
     let peerConnection = this.peers.get(peerId);
-    if (!peerConnection) {
-      peerConnection = this._createPeerConnection(peerId);
-    }
+    if (!peerConnection) {}
 
     const { connection } = peerConnection;
killedBy: P2PService handling signaling messages should handle offer and send answer
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-2', ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/p2p-service.js:170:9
 
     // Create connection if it doesn't exist
     let peerConnection = this.peers.get(peerId);
-    if (!peerConnection) {
+    if (false) {
       peerConnection = this._createPeerConnection(peerId);
     }
killedBy: P2PService handling signaling messages should handle offer and send answer
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-2', ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/p2p-service.js:178:9
 
     // Only accept offer if we're in a state that can receive it
     const signalingState = connection.signalingState;
-    if (signalingState !== 'stable' && signalingState !== 'have-local-offer') {
+    if (true) {
       log.warn('Ignoring offer - wrong signaling state', { peerId, signalingState });
       return;
killedBy: P2PService handling signaling messages should handle offer and send answer
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-2', ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/p2p-service.js:178:9
 
     // Only accept offer if we're in a state that can receive it
     const signalingState = connection.signalingState;
-    if (signalingState !== 'stable' && signalingState !== 'have-local-offer') {
+    if (true && signalingState !== 'have-local-offer') {
       log.warn('Ignoring offer - wrong signaling state', { peerId, signalingState });
       return;
killedBy: P2PService handling signaling messages should handle offer and send answer
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-2', ObjectContaining{…} ]

Number of calls: 0

[NoCoverage] StringLiteral
src/services/p2p-service.js:179:16
     // Only accept offer if we're in a state that can receive it
     const signalingState = connection.signalingState;
     if (signalingState !== 'stable' && signalingState !== 'have-local-offer') {
-      log.warn('Ignoring offer - wrong signaling state', { peerId, signalingState });
+      log.warn("", { peerId, signalingState });
       return;
     }

[Killed] BlockStatement
src/services/p2p-service.js:208:40
    * @param {string} peerId - Peer ID
    * @param {Object} payload - Answer payload
    */
-  async _handleAnswer(peerId, payload) {
-    log.info('Handling answer from peer', { peerId });
-
-    const peerConnection = this.peers.get(peerId);
-    if (!peerConnection) {
-      log.warn('No connection for answer', { peerId });
-      return;
-    }
-
-    // Only accept answer if we're waiting for one (have-local-offer state)
-    const signalingState = peerConnection.connection.signalingState;
-    if (signalingState !== 'have-local-offer') {
-      log.warn('Ignoring answer - wrong signaling state', { peerId, signalingState });
-      return;
-    }
-
-    await peerConnection.connection.setRemoteDescription(new RTCSessionDescription({
-      type: 'answer',
-      sdp: payload.sdp,
-    }));
-
-    // Process any ICE candidates that arrived before the answer
-    await this._processPendingIceCandidates(peerId);
-  }
+  async _handleAnswer(peerId, payload) {}
 
   /**
killedBy: P2PService handling signaling messages should handle answer
statusReason: expected null to deeply equal ObjectContaining {"type": "answer"}

[Survived] StringLiteral
src/services/p2p-service.js:209:14
    * @param {Object} payload - Answer payload
    */
   async _handleAnswer(peerId, payload) {
-    log.info('Handling answer from peer', { peerId });
+    log.info("", { peerId });
 
     const peerConnection = this.peers.get(peerId);

[Killed] BooleanLiteral
src/services/p2p-service.js:212:9
     log.info('Handling answer from peer', { peerId });
 
     const peerConnection = this.peers.get(peerId);
-    if (!peerConnection) {
+    if (peerConnection) {
       log.warn('No connection for answer', { peerId });
       return;
killedBy: P2PService handling signaling messages should handle answer
statusReason: expected null to deeply equal ObjectContaining {"type": "answer"}

[NoCoverage] BlockStatement
src/services/p2p-service.js:212:26
     log.info('Handling answer from peer', { peerId });
 
     const peerConnection = this.peers.get(peerId);
-    if (!peerConnection) {
-      log.warn('No connection for answer', { peerId });
-      return;
-    }
+    if (!peerConnection) {}
 
     // Only accept answer if we're waiting for one (have-local-offer state)

[Killed] ConditionalExpression
src/services/p2p-service.js:219:9
 
     // Only accept answer if we're waiting for one (have-local-offer state)
     const signalingState = peerConnection.connection.signalingState;
-    if (signalingState !== 'have-local-offer') {
+    if (true) {
       log.warn('Ignoring answer - wrong signaling state', { peerId, signalingState });
       return;
killedBy: P2PService handling signaling messages should handle answer
statusReason: expected null to deeply equal ObjectContaining {"type": "answer"}

[Killed] EqualityOperator
src/services/p2p-service.js:219:9
 
     // Only accept answer if we're waiting for one (have-local-offer state)
     const signalingState = peerConnection.connection.signalingState;
-    if (signalingState !== 'have-local-offer') {
+    if (signalingState === 'have-local-offer') {
       log.warn('Ignoring answer - wrong signaling state', { peerId, signalingState });
       return;
killedBy: P2PService handling signaling messages should handle answer
statusReason: expected null to deeply equal ObjectContaining {"type": "answer"}

[NoCoverage] StringLiteral
src/services/p2p-service.js:220:16
     // Only accept answer if we're waiting for one (have-local-offer state)
     const signalingState = peerConnection.connection.signalingState;
     if (signalingState !== 'have-local-offer') {
-      log.warn('Ignoring answer - wrong signaling state', { peerId, signalingState });
+      log.warn("", { peerId, signalingState });
       return;
     }

[Survived] BlockStatement
src/services/p2p-service.js:240:46
    * @param {string} peerId - Peer ID
    * @param {Object} payload - ICE candidate payload
    */
-  async _handleIceCandidate(peerId, payload) {
-    const peerConnection = this.peers.get(peerId);
-    if (!peerConnection) {
-      log.warn('No connection for ICE candidate', { peerId });
-      return;
-    }
-
-    const candidate = new RTCIceCandidate({
-      candidate: payload.candidate,
-      sdpMid: payload.sdpMid,
-      sdpMLineIndex: payload.sdpMLineIndex,
-    });
-
-    // Queue candidate if remote description not yet set
-    if (!peerConnection.connection.remoteDescription) {
-      log.debug('Queuing ICE candidate (no remote description yet)', { peerId });
-      peerConnection.pendingIceCandidates.push(candidate);
-      return;
-    }
-
-    await peerConnection.connection.addIceCandidate(candidate);
-    log.debug('Added ICE candidate', { peerId });
-  }
+  async _handleIceCandidate(peerId, payload) {}
 
   /**

[NoCoverage] BlockStatement
src/services/p2p-service.js:242:26
    */
   async _handleIceCandidate(peerId, payload) {
     const peerConnection = this.peers.get(peerId);
-    if (!peerConnection) {
-      log.warn('No connection for ICE candidate', { peerId });
-      return;
-    }
+    if (!peerConnection) {}
 
     const candidate = new RTCIceCandidate({

[Survived] ConditionalExpression
src/services/p2p-service.js:242:9
    */
   async _handleIceCandidate(peerId, payload) {
     const peerConnection = this.peers.get(peerId);
-    if (!peerConnection) {
+    if (true) {
       log.warn('No connection for ICE candidate', { peerId });
       return;

[NoCoverage] StringLiteral
src/services/p2p-service.js:243:16
   async _handleIceCandidate(peerId, payload) {
     const peerConnection = this.peers.get(peerId);
     if (!peerConnection) {
-      log.warn('No connection for ICE candidate', { peerId });
+      log.warn("", { peerId });
       return;
     }

[Survived] ConditionalExpression
src/services/p2p-service.js:254:9
     });
 
     // Queue candidate if remote description not yet set
-    if (!peerConnection.connection.remoteDescription) {
+    if (true) {
       log.debug('Queuing ICE candidate (no remote description yet)', { peerId });
       peerConnection.pendingIceCandidates.push(candidate);

[Survived] ConditionalExpression
src/services/p2p-service.js:254:9
     });
 
     // Queue candidate if remote description not yet set
-    if (!peerConnection.connection.remoteDescription) {
+    if (false) {
       log.debug('Queuing ICE candidate (no remote description yet)', { peerId });
       peerConnection.pendingIceCandidates.push(candidate);

[NoCoverage] ObjectLiteral
src/services/p2p-service.js:261:38
     }
 
     await peerConnection.connection.addIceCandidate(candidate);
-    log.debug('Added ICE candidate', { peerId });
+    log.debug('Added ICE candidate', {});
   }
 

[Survived] BlockStatement
src/services/p2p-service.js:270:46
    * @private
    * @param {string} peerId - Peer ID
    */
-  async _processPendingIceCandidates(peerId) {
-    const peerConnection = this.peers.get(peerId);
-    if (!peerConnection) return;
-
-    const pending = peerConnection.pendingIceCandidates;
-    if (pending.length === 0) return;
-
-    log.debug('Processing queued ICE candidates', { peerId, count: pending.length });
-
-    for (const candidate of pending) {
-      try {
-        await peerConnection.connection.addIceCandidate(candidate);     
-      } catch (error) {
-        log.warn('Failed to add queued ICE candidate', { peerId, error: error.message });
-      }
-    }
-
-    // Clear the queue
-    peerConnection.pendingIceCandidates = [];
-  }
+  async _processPendingIceCandidates(peerId) {}
 
   /**

[Survived] BooleanLiteral
src/services/p2p-service.js:272:9
    */
   async _processPendingIceCandidates(peerId) {
     const peerConnection = this.peers.get(peerId);
-    if (!peerConnection) return;
+    if (peerConnection) return;
 
     const pending = peerConnection.pendingIceCandidates;

[Survived] ConditionalExpression
src/services/p2p-service.js:272:9
    */
   async _processPendingIceCandidates(peerId) {
     const peerConnection = this.peers.get(peerId);
-    if (!peerConnection) return;
+    if (true) return;
 
     const pending = peerConnection.pendingIceCandidates;

[Survived] ConditionalExpression
src/services/p2p-service.js:275:9
     if (!peerConnection) return;
 
     const pending = peerConnection.pendingIceCandidates;
-    if (pending.length === 0) return;
+    if (false) return;
 
     log.debug('Processing queued ICE candidates', { peerId, count: pending.length });

[Survived] ConditionalExpression
src/services/p2p-service.js:275:9
     if (!peerConnection) return;
 
     const pending = peerConnection.pendingIceCandidates;
-    if (pending.length === 0) return;
+    if (true) return;
 
     log.debug('Processing queued ICE candidates', { peerId, count: pending.length });

[NoCoverage] BlockStatement
src/services/p2p-service.js:279:38
 
     log.debug('Processing queued ICE candidates', { peerId, count: pending.length });
 
-    for (const candidate of pending) {
-      try {
-        await peerConnection.connection.addIceCandidate(candidate);     
-      } catch (error) {
-        log.warn('Failed to add queued ICE candidate', { peerId, error: error.message });
-      }
-    }
+    for (const candidate of pending) {}
 
     // Clear the queue

[NoCoverage] BlockStatement
src/services/p2p-service.js:280:11
     log.debug('Processing queued ICE candidates', { peerId, count: pending.length });
 
     for (const candidate of pending) {
-      try {
-        await peerConnection.connection.addIceCandidate(candidate);     
-      } catch (error) {
+      try {} catch (error) {
         log.warn('Failed to add queued ICE candidate', { peerId, error: error.message });
       }

[NoCoverage] BlockStatement
src/services/p2p-service.js:282:23
     for (const candidate of pending) {
       try {
         await peerConnection.connection.addIceCandidate(candidate);     
-      } catch (error) {
-        log.warn('Failed to add queued ICE candidate', { peerId, error: error.message });
-      }
+      } catch (error) {}
     }
 

[NoCoverage] ObjectLiteral
src/services/p2p-service.js:283:56
       try {
         await peerConnection.connection.addIceCandidate(candidate);     
       } catch (error) {
-        log.warn('Failed to add queued ICE candidate', { peerId, error: error.message });
+        log.warn('Failed to add queued ICE candidate', {});
       }
     }

[Killed] ObjectLiteral
src/services/p2p-service.js:304:28
     });
 
     /** @type {PeerConnection} */
-    const peerConnection = {
-      connection,
-      dataChannel: null,
-      state: 'new',
-      reconnectAttempts: 0,
-      connectionStartTime: Date.now(),
-      pendingIceCandidates: [],
-      dataChannelReady: false,
-      peerConnectedNotified: false,
-    };
+    const peerConnection = {};
 
     this.peers.set(peerId, peerConnection);
killedBy: P2PService createConnection should create a new peer connection
statusReason: Cannot read properties of undefined (reading 'createDataChannel')

[Killed] BooleanLiteral
src/services/p2p-service.js:311:25
       reconnectAttempts: 0,
       connectionStartTime: Date.now(),
       pendingIceCandidates: [],
-      dataChannelReady: false,
+      dataChannelReady: true,
       peerConnectedNotified: false,
     };
killedBy: P2PService onPeerConnected should call callback when peer connects and data channel opens
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "peer-1",

[Killed] BooleanLiteral
src/services/p2p-service.js:312:30
       connectionStartTime: Date.now(),
       pendingIceCandidates: [],
       dataChannelReady: false,
-      peerConnectedNotified: false,
+      peerConnectedNotified: true,
     };
 
killedBy: P2PService onPeerConnected should call callback when peer connects and data channel opens
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1' ]

Number of calls: 0

[NoCoverage] BlockStatement
src/services/p2p-service.js:318:44
     this.peers.set(peerId, peerConnection);
 
     // Handle ICE candidates
-    connection.onicecandidate = (event) => {
-      if (event.candidate) {
-        // Track ICE candidate type for STUN vs TURN evaluation
-        telemetry.track('p2p_ice_candidate', {
-          peerId,
-          type: event.candidate.type,
-          protocol: event.candidate.protocol,
-        });
-
-        this.signalingClient.sendIceCandidate(peerId, event.candidate);   
-      }
-    };
+    connection.onicecandidate = (event) => {};
 
     // Handle connection state changes

[NoCoverage] BlockStatement
src/services/p2p-service.js:319:28
 
     // Handle ICE candidates
     connection.onicecandidate = (event) => {
-      if (event.candidate) {
-        // Track ICE candidate type for STUN vs TURN evaluation
-        telemetry.track('p2p_ice_candidate', {
-          peerId,
-          type: event.candidate.type,
-          protocol: event.candidate.protocol,
-        });
-
-        this.signalingClient.sendIceCandidate(peerId, event.candidate);   
-      }
+      if (event.candidate) {}
     };
 

[NoCoverage] ConditionalExpression
src/services/p2p-service.js:319:11
 
     // Handle ICE candidates
     connection.onicecandidate = (event) => {
-      if (event.candidate) {
+      if (false) {
         // Track ICE candidate type for STUN vs TURN evaluation
         telemetry.track('p2p_ice_candidate', {

[Killed] ConditionalExpression
src/services/p2p-service.js:337:9
       log.info('Connection state changed', { peerId, state });
 
       switch (state) {
-        case 'connected':
-          peerConnection.state = 'connected';
-          peerConnection.reconnectAttempts = 0;
-
-          // Track telemetry
-          telemetry.track('p2p_connection_success', {
-            peerId,
-            connectionTime: Date.now() - peerConnection.connectionStartTime,    
-            iceState: connection.iceConnectionState,
-          });
-
-          // Only notify when both connection AND data channel are ready
-          this._notifyPeerConnectedIfReady(peerId);
-          break;
+        case 'connected':
 
         case 'disconnected':
killedBy: P2PService onPeerConnected should call callback when peer connects and data channel opens
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1' ]

Number of calls: 0

[Survived] ArithmeticOperator
src/services/p2p-service.js:344:29
           // Track telemetry
           telemetry.track('p2p_connection_success', {
             peerId,
-            connectionTime: Date.now() - peerConnection.connectionStartTime,    
+            connectionTime: Date.now() + peerConnection.connectionStartTime,    
             iceState: connection.iceConnectionState,
           });

[Killed] ConditionalExpression
src/services/p2p-service.js:352:9
           this._notifyPeerConnectedIfReady(peerId);
           break;
 
-        case 'disconnected':
-          peerConnection.state = 'disconnected';
-          this._handleDisconnection(peerId);
-          break;
+        case 'disconnected':
 
         case 'failed':
killedBy: P2PService onPeerDisconnected should call callback when peer disconnects
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1', 'disconnected' ]

Number of calls: 0

[Survived] StringLiteral
src/services/p2p-service.js:353:34
           break;
 
         case 'disconnected':
-          peerConnection.state = 'disconnected';
+          peerConnection.state = "";
           this._handleDisconnection(peerId);
           break;

[NoCoverage] ConditionalExpression
src/services/p2p-service.js:357:9
           this._handleDisconnection(peerId);
           break;
 
-        case 'failed':
-          peerConnection.state = 'failed';
-
-          // Track telemetry
-          telemetry.track('p2p_connection_failed', {
-            peerId,
-            error: 'connection_failed',
-            iceState: connection.iceConnectionState,
-          });
-
-          this._handleConnectionFailure(peerId);
-          break;
+        case 'failed':
       }
     };

[NoCoverage] StringLiteral
src/services/p2p-service.js:358:34
           break;
 
         case 'failed':
-          peerConnection.state = 'failed';
+          peerConnection.state = "";
 
           // Track telemetry

[NoCoverage] StringLiteral
src/services/p2p-service.js:361:27
           peerConnection.state = 'failed';
 
           // Track telemetry
-          telemetry.track('p2p_connection_failed', {
+          telemetry.track("", {
             peerId,
             error: 'connection_failed',

[NoCoverage] BlockStatement
src/services/p2p-service.js:373:43
     };
 
     // Handle data channel (for non-initiator)
-    connection.ondatachannel = (event) => {
-      log.debug('Data channel received', { peerId });
-      this._setupDataChannel(peerId, event.channel);
-      peerConnection.dataChannel = event.channel;
-    };
+    connection.ondatachannel = (event) => {};
 
     return peerConnection;
