[NoCoverage] StringLiteral
src/services/p2p-service.js:374:17
 
     // Handle data channel (for non-initiator)
     connection.ondatachannel = (event) => {
-      log.debug('Data channel received', { peerId });
+      log.debug("", { peerId });
       this._setupDataChannel(peerId, event.channel);
       peerConnection.dataChannel = event.channel;

[Killed] BlockStatement
src/services/p2p-service.js:390:28
    * @param {RTCDataChannel} channel - Data channel
    */
   _setupDataChannel(peerId, channel) {
-    channel.onopen = () => {
-      log.info('Data channel opened', { peerId });
-      const peerConnection = this.peers.get(peerId);
-      if (peerConnection) {
-        peerConnection.dataChannelReady = true;
-        // Only notify when both connection AND data channel are ready
-        this._notifyPeerConnectedIfReady(peerId);
-      }
-    };
+    channel.onopen = () => {};
 
     channel.onclose = () => {
killedBy: P2PService onPeerConnected should call callback when peer connects and data channel opens
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1' ]

Number of calls: 0

[Killed] BlockStatement
src/services/p2p-service.js:393:27
     channel.onopen = () => {
       log.info('Data channel opened', { peerId });
       const peerConnection = this.peers.get(peerId);
-      if (peerConnection) {
-        peerConnection.dataChannelReady = true;
-        // Only notify when both connection AND data channel are ready
-        this._notifyPeerConnectedIfReady(peerId);
-      }
+      if (peerConnection) {}
     };
 
killedBy: P2PService onPeerConnected should call callback when peer connects and data channel opens
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1' ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/p2p-service.js:393:11
     channel.onopen = () => {
       log.info('Data channel opened', { peerId });
       const peerConnection = this.peers.get(peerId);
-      if (peerConnection) {
+      if (false) {
         peerConnection.dataChannelReady = true;
         // Only notify when both connection AND data channel are ready
killedBy: P2PService onPeerConnected should call callback when peer connects and data channel opens
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1' ]

Number of calls: 0

[Killed] BooleanLiteral
src/services/p2p-service.js:394:43
       log.info('Data channel opened', { peerId });
       const peerConnection = this.peers.get(peerId);
       if (peerConnection) {
-        peerConnection.dataChannelReady = true;
+        peerConnection.dataChannelReady = false;
         // Only notify when both connection AND data channel are ready
         this._notifyPeerConnectedIfReady(peerId);
killedBy: P2PService onPeerConnected should call callback when peer connects and data channel opens
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1' ]

Number of calls: 0

[Survived] BlockStatement
src/services/p2p-service.js:400:29
       }
     };
 
-    channel.onclose = () => {
-      log.info('Data channel closed', { peerId });
-    };
+    channel.onclose = () => {};
 
     channel.onerror = (error) => {

[NoCoverage] BlockStatement
src/services/p2p-service.js:404:34
       log.info('Data channel closed', { peerId });
     };
 
-    channel.onerror = (error) => {
-      log.error('Data channel error', { peerId, error });
-    };
+    channel.onerror = (error) => {};
 
     channel.onmessage = (event) => {

[Killed] BlockStatement
src/services/p2p-service.js:408:36
       log.error('Data channel error', { peerId, error });
     };
 
-    channel.onmessage = (event) => {
-      try {
-        const message = JSON.parse(event.data);
-        log.debug('Received message', { peerId, type: message.type });
-
-        for (const callback of this.onMessageCallbacks) {
-          callback(peerId, message);
-        }
-      } catch (error) {
-        log.error('Error parsing message', { error: error.message });
-      }
-    };
+    channel.onmessage = (event) => {};
   }
 
killedBy: P2PService onMessage should call callback when message received
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/services/p2p-service.js:409:11
     };
 
     channel.onmessage = (event) => {
-      try {
-        const message = JSON.parse(event.data);
-        log.debug('Received message', { peerId, type: message.type });
-
-        for (const callback of this.onMessageCallbacks) {
-          callback(peerId, message);
-        }
-      } catch (error) {
+      try {} catch (error) {
         log.error('Error parsing message', { error: error.message });
       }
killedBy: P2PService onMessage should call callback when message received
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1', …(1) ]

Number of calls: 0

[Survived] StringLiteral
src/services/p2p-service.js:411:19
     channel.onmessage = (event) => {
       try {
         const message = JSON.parse(event.data);
-        log.debug('Received message', { peerId, type: message.type });
+        log.debug("", { peerId, type: message.type });
 
         for (const callback of this.onMessageCallbacks) {

[Survived] ObjectLiteral
src/services/p2p-service.js:411:39
     channel.onmessage = (event) => {
       try {
         const message = JSON.parse(event.data);
-        log.debug('Received message', { peerId, type: message.type });
+        log.debug('Received message', {});
 
         for (const callback of this.onMessageCallbacks) {

[Killed] BlockStatement
src/services/p2p-service.js:413:57
         const message = JSON.parse(event.data);
         log.debug('Received message', { peerId, type: message.type });
 
-        for (const callback of this.onMessageCallbacks) {
-          callback(peerId, message);
-        }
+        for (const callback of this.onMessageCallbacks) {}
       } catch (error) {
         log.error('Error parsing message', { error: error.message });
killedBy: P2PService onMessage should call callback when message received
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1', …(1) ]

Number of calls: 0

[NoCoverage] BlockStatement
src/services/p2p-service.js:416:23
         for (const callback of this.onMessageCallbacks) {
           callback(peerId, message);
         }
-      } catch (error) {
-        log.error('Error parsing message', { error: error.message });
-      }
+      } catch (error) {}
     };
   }

[Killed] BlockStatement
src/services/p2p-service.js:428:39
    * @private
    * @param {string} peerId - Peer ID
    */
-  _notifyPeerConnectedIfReady(peerId) {
-    const peerConnection = this.peers.get(peerId);
-    if (!peerConnection) return;
-
-    // Check if both conditions are met and we haven't notified yet
-    const isConnectionReady = peerConnection.state === 'connected';
-    const isDataChannelReady = peerConnection.dataChannelReady;
-    const alreadyNotified = peerConnection.peerConnectedNotified;
-
-    if (isConnectionReady && isDataChannelReady && !alreadyNotified) {
-      peerConnection.peerConnectedNotified = true;
-      log.info('Peer fully connected (connection + data channel ready)', { peerId });
-
-      for (const callback of this.onPeerConnectedCallbacks) {
-        callback(peerId);
-      }
-    } else {
-      log.debug('Peer not fully ready yet', {
-        peerId,
-        isConnectionReady,
-        isDataChannelReady,
-        alreadyNotified,
-      });
-    }
-  }
+  _notifyPeerConnectedIfReady(peerId) {}
 
   /**
killedBy: P2PService onPeerConnected should call callback when peer connects and data channel opens
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1' ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/p2p-service.js:433:31
     if (!peerConnection) return;
 
     // Check if both conditions are met and we haven't notified yet
-    const isConnectionReady = peerConnection.state === 'connected';
+    const isConnectionReady = false;
     const isDataChannelReady = peerConnection.dataChannelReady;
     const alreadyNotified = peerConnection.peerConnectedNotified;
killedBy: P2PService onPeerConnected should call callback when peer connects and data channel opens
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1' ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/p2p-service.js:433:31
     if (!peerConnection) return;
 
     // Check if both conditions are met and we haven't notified yet
-    const isConnectionReady = peerConnection.state === 'connected';
+    const isConnectionReady = true;
     const isDataChannelReady = peerConnection.dataChannelReady;
     const alreadyNotified = peerConnection.peerConnectedNotified;
killedBy: P2PService onPeerConnected should call callback when data channel opens before connection state
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "peer-1",

[Killed] BlockStatement
src/services/p2p-service.js:437:70
     const isDataChannelReady = peerConnection.dataChannelReady;
     const alreadyNotified = peerConnection.peerConnectedNotified;
 
-    if (isConnectionReady && isDataChannelReady && !alreadyNotified) {
-      peerConnection.peerConnectedNotified = true;
-      log.info('Peer fully connected (connection + data channel ready)', { peerId });
-
-      for (const callback of this.onPeerConnectedCallbacks) {
-        callback(peerId);
-      }
-    } else {
+    if (isConnectionReady && isDataChannelReady && !alreadyNotified) {} else {
       log.debug('Peer not fully ready yet', {
         peerId,
killedBy: P2PService onPeerConnected should call callback when peer connects and data channel opens
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1' ]

Number of calls: 0

[Killed] LogicalOperator
src/services/p2p-service.js:437:9
     const isDataChannelReady = peerConnection.dataChannelReady;
     const alreadyNotified = peerConnection.peerConnectedNotified;
 
-    if (isConnectionReady && isDataChannelReady && !alreadyNotified) {
+    if (isConnectionReady || isDataChannelReady && !alreadyNotified) {
       peerConnection.peerConnectedNotified = true;
       log.info('Peer fully connected (connection + data channel ready)', { peerId });
killedBy: P2PService onPeerConnected should call callback when peer connects and data channel opens
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "peer-1",

[Survived] BooleanLiteral
src/services/p2p-service.js:438:46
     const alreadyNotified = peerConnection.peerConnectedNotified;
 
     if (isConnectionReady && isDataChannelReady && !alreadyNotified) {
-      peerConnection.peerConnectedNotified = true;
+      peerConnection.peerConnectedNotified = false;
       log.info('Peer fully connected (connection + data channel ready)', { peerId });
 

[Killed] BlockStatement
src/services/p2p-service.js:441:61
       peerConnection.peerConnectedNotified = true;
       log.info('Peer fully connected (connection + data channel ready)', { peerId });
 
-      for (const callback of this.onPeerConnectedCallbacks) {
-        callback(peerId);
-      }
+      for (const callback of this.onPeerConnectedCallbacks) {}
     } else {
       log.debug('Peer not fully ready yet', {
killedBy: P2PService onPeerConnected should call callback when peer connects and data channel opens
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1' ]

Number of calls: 0

[Survived] BlockStatement
src/services/p2p-service.js:444:12
       for (const callback of this.onPeerConnectedCallbacks) {
         callback(peerId);
       }
-    } else {
-      log.debug('Peer not fully ready yet', {
-        peerId,
-        isConnectionReady,
-        isDataChannelReady,
-        alreadyNotified,
-      });
-    }
+    } else {}
   }
 

[Killed] BlockStatement
src/services/p2p-service.js:460:32
    * @private
    * @param {string} peerId - Peer ID
    */
-  _handleDisconnection(peerId) {
-    for (const callback of this.onPeerDisconnectedCallbacks) {
-      callback(peerId, 'disconnected');
-    }
-  }
+  _handleDisconnection(peerId) {}
 
   /**
killedBy: P2PService onPeerDisconnected should call callback when peer disconnects
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1', 'disconnected' ]

Number of calls: 0

[Killed] BlockStatement
src/services/p2p-service.js:461:62
    * @param {string} peerId - Peer ID
    */
   _handleDisconnection(peerId) {
-    for (const callback of this.onPeerDisconnectedCallbacks) {
-      callback(peerId, 'disconnected');
-    }
+    for (const callback of this.onPeerDisconnectedCallbacks) {}
   }
 
killedBy: P2PService onPeerDisconnected should call callback when peer disconnects
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1', 'disconnected' ]

Number of calls: 0

[NoCoverage] ConditionalExpression
src/services/p2p-service.js:474:9
    */
   async _handleConnectionFailure(peerId) {
     const peerConnection = this.peers.get(peerId);
-    if (!peerConnection) return;
+    if (false) return;
 
     if (peerConnection.reconnectAttempts < this.maxReconnectAttempts) {

[NoCoverage] EqualityOperator
src/services/p2p-service.js:476:9
     const peerConnection = this.peers.get(peerId);
     if (!peerConnection) return;
 
-    if (peerConnection.reconnectAttempts < this.maxReconnectAttempts) {
+    if (peerConnection.reconnectAttempts <= this.maxReconnectAttempts) {
       peerConnection.reconnectAttempts++;
       log.info('Attempting reconnection', { peerId, attempt: peerConnection.reconnectAttempts });

[NoCoverage] ConditionalExpression
src/services/p2p-service.js:476:9
     const peerConnection = this.peers.get(peerId);
     if (!peerConnection) return;
 
-    if (peerConnection.reconnectAttempts < this.maxReconnectAttempts) {
+    if (false) {
       peerConnection.reconnectAttempts++;
       log.info('Attempting reconnection', { peerId, attempt: peerConnection.reconnectAttempts });

[NoCoverage] UpdateOperator
src/services/p2p-service.js:477:7
     if (!peerConnection) return;
 
     if (peerConnection.reconnectAttempts < this.maxReconnectAttempts) {
-      peerConnection.reconnectAttempts++;
+      peerConnection.reconnectAttempts--;
       log.info('Attempting reconnection', { peerId, attempt: peerConnection.reconnectAttempts });
 

[NoCoverage] StringLiteral
src/services/p2p-service.js:478:16
 
     if (peerConnection.reconnectAttempts < this.maxReconnectAttempts) {
       peerConnection.reconnectAttempts++;
-      log.info('Attempting reconnection', { peerId, attempt: peerConnection.reconnectAttempts });
+      log.info("", { peerId, attempt: peerConnection.reconnectAttempts });
 
       // Track telemetry

[NoCoverage] ObjectLiteral
src/services/p2p-service.js:481:48
       log.info('Attempting reconnection', { peerId, attempt: peerConnection.reconnectAttempts });
 
       // Track telemetry
-      telemetry.track('p2p_reconnect_attempt', {
-        peerId,
-        attempt: peerConnection.reconnectAttempts,
-      });
+      telemetry.track('p2p_reconnect_attempt', {});
 
       // Clean up old connection

[NoCoverage] StringLiteral
src/services/p2p-service.js:481:23
       log.info('Attempting reconnection', { peerId, attempt: peerConnection.reconnectAttempts });
 
       // Track telemetry
-      telemetry.track('p2p_reconnect_attempt', {
+      telemetry.track("", {
         peerId,
         attempt: peerConnection.reconnectAttempts,

[NoCoverage] ArrowFunction
src/services/p2p-service.js:490:25
       this._cleanupPeerConnection(peerId);
 
       // Wait before reconnecting
-      await new Promise((resolve) => setTimeout(resolve, this.reconnectDelay));
+      await new Promise(() => undefined);
 
       // Try to reconnect

[NoCoverage] BooleanLiteral
src/services/p2p-service.js:493:11
       await new Promise((resolve) => setTimeout(resolve, this.reconnectDelay));
 
       // Try to reconnect
-      if (!this.isDestroyed) {
+      if (this.isDestroyed) {
         await this.createConnection(peerId);
       }

[NoCoverage] BlockStatement
src/services/p2p-service.js:493:30
       await new Promise((resolve) => setTimeout(resolve, this.reconnectDelay));
 
       // Try to reconnect
-      if (!this.isDestroyed) {
-        await this.createConnection(peerId);
-      }
+      if (!this.isDestroyed) {}
     } else {
       log.error('Max reconnection attempts reached', { peerId });

[NoCoverage] BlockStatement
src/services/p2p-service.js:496:12
       if (!this.isDestroyed) {
         await this.createConnection(peerId);
       }
-    } else {
-      log.error('Max reconnection attempts reached', { peerId });
-      this._cleanupPeerConnection(peerId);
-
-      for (const callback of this.onPeerDisconnectedCallbacks) {
-        callback(peerId, 'failed');
-      }
-    }
+    } else {}
   }
 

[NoCoverage] ObjectLiteral
src/services/p2p-service.js:497:54
         await this.createConnection(peerId);
       }
     } else {
-      log.error('Max reconnection attempts reached', { peerId });
+      log.error('Max reconnection attempts reached', {});
       this._cleanupPeerConnection(peerId);
 

[NoCoverage] StringLiteral
src/services/p2p-service.js:497:17
         await this.createConnection(peerId);
       }
     } else {
-      log.error('Max reconnection attempts reached', { peerId });
+      log.error("", { peerId });
       this._cleanupPeerConnection(peerId);
 

[NoCoverage] BlockStatement
src/services/p2p-service.js:500:64
       log.error('Max reconnection attempts reached', { peerId });
       this._cleanupPeerConnection(peerId);
 
-      for (const callback of this.onPeerDisconnectedCallbacks) {
-        callback(peerId, 'failed');
-      }
+      for (const callback of this.onPeerDisconnectedCallbacks) {}
     }
   }

[Killed] BlockStatement
src/services/p2p-service.js:512:34
    * @private
    * @param {string} peerId - Peer ID
    */
-  _cleanupPeerConnection(peerId) {
-    const peerConnection = this.peers.get(peerId);
-    if (!peerConnection) return;
-
-    if (peerConnection.dataChannel) {
-      peerConnection.dataChannel.close();
-    }
-
-    peerConnection.connection.close();
-    this.peers.delete(peerId);
-
-    log.debug('Cleaned up peer connection', { peerId });
-  }
+  _cleanupPeerConnection(peerId) {}
 
   /**
killedBy: P2PService disconnect should remove peer connection
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/services/p2p-service.js:516:9
     const peerConnection = this.peers.get(peerId);
     if (!peerConnection) return;
 
-    if (peerConnection.dataChannel) {
+    if (true) {
       peerConnection.dataChannel.close();
     }
killedBy: P2PService handling signaling messages should handle offer and send answer
statusReason: Cannot read properties of null (reading 'close')

[Survived] BlockStatement
src/services/p2p-service.js:516:37
     const peerConnection = this.peers.get(peerId);
     if (!peerConnection) return;
 
-    if (peerConnection.dataChannel) {
-      peerConnection.dataChannel.close();
-    }
+    if (peerConnection.dataChannel) {}
 
     peerConnection.connection.close();

[Survived] StringLiteral
src/services/p2p-service.js:523:15
     peerConnection.connection.close();
     this.peers.delete(peerId);
 
-    log.debug('Cleaned up peer connection', { peerId });
+    log.debug("", { peerId });
   }
 

[Killed] BlockStatement
src/services/p2p-service.js:533:25
    * @param {Object} message - Message to send
    * @returns {boolean} Whether the message was sent
    */
-  send(peerId, message) {
-    const peerConnection = this.peers.get(peerId);
-    if (!peerConnection?.dataChannel) {
-      log.warn('No data channel for peer', { peerId });
-      return false;
-    }
-
-    if (peerConnection.dataChannel.readyState !== 'open') {
-      log.warn('Data channel not open', { peerId, state: peerConnection.dataChannel.readyState });
-      return false;
-    }
-
-    try {
-      peerConnection.dataChannel.send(JSON.stringify(message));
-      return true;
-    } catch (error) {
-      log.error('Error sending message', { peerId, error: error.message });
-      return false;
-    }
-  }
+  send(peerId, message) {}
 
   /**
killedBy: P2PService send should return false when no data channel exists
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/services/p2p-service.js:535:39
    */
   send(peerId, message) {
     const peerConnection = this.peers.get(peerId);
-    if (!peerConnection?.dataChannel) {
-      log.warn('No data channel for peer', { peerId });
-      return false;
-    }
+    if (!peerConnection?.dataChannel) {}
 
     if (peerConnection.dataChannel.readyState !== 'open') {
killedBy: P2PService send should return false when no data channel exists
statusReason: Cannot read properties of undefined (reading 'dataChannel')

[Killed] BooleanLiteral
src/services/p2p-service.js:535:9
    */
   send(peerId, message) {
     const peerConnection = this.peers.get(peerId);
-    if (!peerConnection?.dataChannel) {
+    if (peerConnection?.dataChannel) {
       log.warn('No data channel for peer', { peerId });
       return false;
killedBy: P2PService send should return false when no data channel exists
statusReason: Cannot read properties of undefined (reading 'dataChannel')

[Killed] BooleanLiteral
src/services/p2p-service.js:537:14
     const peerConnection = this.peers.get(peerId);
     if (!peerConnection?.dataChannel) {
       log.warn('No data channel for peer', { peerId });
-      return false;
+      return true;
     }
 
killedBy: P2PService send should return false when no data channel exists
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/services/p2p-service.js:540:9
       return false;
     }
 
-    if (peerConnection.dataChannel.readyState !== 'open') {
+    if (peerConnection.dataChannel.readyState === 'open') {
       log.warn('Data channel not open', { peerId, state: peerConnection.dataChannel.readyState });
       return false;
killedBy: P2PService send should return false when data channel is not open
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/p2p-service.js:540:59
       return false;
     }
 
-    if (peerConnection.dataChannel.readyState !== 'open') {
-      log.warn('Data channel not open', { peerId, state: peerConnection.dataChannel.readyState });
-      return false;
-    }
+    if (peerConnection.dataChannel.readyState !== 'open') {}
 
     try {
killedBy: P2PService send should return false when data channel is not open
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/services/p2p-service.js:542:14
 
     if (peerConnection.dataChannel.readyState !== 'open') {
       log.warn('Data channel not open', { peerId, state: peerConnection.dataChannel.readyState });
-      return false;
+      return true;
     }
 
killedBy: P2PService send should return false when data channel is not open
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/p2p-service.js:545:9
       return false;
     }
 
-    try {
-      peerConnection.dataChannel.send(JSON.stringify(message));
-      return true;
-    } catch (error) {
+    try {} catch (error) {
       log.error('Error sending message', { peerId, error: error.message });
       return false;
killedBy: P2PService send should send message when data channel is open
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/services/p2p-service.js:547:14
 
     try {
       peerConnection.dataChannel.send(JSON.stringify(message));
-      return true;
+      return false;
     } catch (error) {
       log.error('Error sending message', { peerId, error: error.message });
killedBy: P2PService send should send message when data channel is open
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/services/p2p-service.js:548:21
     try {
       peerConnection.dataChannel.send(JSON.stringify(message));
       return true;
-    } catch (error) {
-      log.error('Error sending message', { peerId, error: error.message });
-      return false;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BooleanLiteral
src/services/p2p-service.js:550:14
       return true;
     } catch (error) {
       log.error('Error sending message', { peerId, error: error.message });
-      return false;
+      return true;
     }
   }

[Killed] BlockStatement
src/services/p2p-service.js:560:22
    * @param {Object} message - Message to broadcast
    * @returns {number} Number of peers the message was sent to
    */
-  broadcast(message) {
-    let sentCount = 0;
-
-    for (const [peerId] of this.peers) {
-      if (this.send(peerId, message)) {
-        sentCount++;
-      }
-    }
-
-    log.debug('Broadcast message', { sentTo: sentCount, total: this.peers.size });
-    return sentCount;
-  }
+  broadcast(message) {}
 
   /**
killedBy: P2PService broadcast should send to all connected peers
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/services/p2p-service.js:564:39
     let sentCount = 0;
 
     for (const [peerId] of this.peers) {
-      if (this.send(peerId, message)) {
-        sentCount++;
-      }
+      if (this.send(peerId, message)) {}
     }
 
killedBy: P2PService broadcast should send to all connected peers
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/services/p2p-service.js:564:11
     let sentCount = 0;
 
     for (const [peerId] of this.peers) {
-      if (this.send(peerId, message)) {
+      if (false) {
         sentCount++;
       }
killedBy: P2PService broadcast should send to all connected peers
statusReason: expected +0 to be 2 // Object.is equality

[Killed] UpdateOperator
src/services/p2p-service.js:565:9
 
     for (const [peerId] of this.peers) {
       if (this.send(peerId, message)) {
-        sentCount++;
+        sentCount--;
       }
     }
killedBy: P2PService broadcast should send to all connected peers
statusReason: expected -2 to be 2 // Object.is equality

[Killed] BlockStatement
src/services/p2p-service.js:578:23
    *
    * @param {Function} callback - Called with (peerId, message)
    */
-  onMessage(callback) {
-    this.onMessageCallbacks.push(callback);
-  }
+  onMessage(callback) {}
 
   /**
killedBy: P2PService onMessage should call callback when message received
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/services/p2p-service.js:587:29
    *
    * @param {Function} callback - Called with (peerId)
    */
-  onPeerConnected(callback) {
-    this.onPeerConnectedCallbacks.push(callback);
-  }
+  onPeerConnected(callback) {}
 
   /**
killedBy: P2PService onPeerConnected should call callback when peer connects and data channel opens
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1' ]

Number of calls: 0

[Killed] BlockStatement
src/services/p2p-service.js:596:32
    *
    * @param {Function} callback - Called with (peerId, reason)
    */
-  onPeerDisconnected(callback) {
-    this.onPeerDisconnectedCallbacks.push(callback);
-  }
+  onPeerDisconnected(callback) {}
 
   /**
killedBy: P2PService onPeerDisconnected should call callback when peer disconnects
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-1', 'disconnected' ]

Number of calls: 0

[Killed] BlockStatement
src/services/p2p-service.js:606:30
    * @param {string} peerId - Peer ID
    * @returns {string|null} Connection state or null if not found
    */
-  getConnectionState(peerId) {
-    return this.peers.get(peerId)?.state || null;
-  }
+  getConnectionState(peerId) {}
 
   /**
killedBy: P2PService getConnectionState should return null for unknown peer
statusReason: expected undefined to be null

[Killed] OptionalChaining
src/services/p2p-service.js:607:12
    * @returns {string|null} Connection state or null if not found
    */
   getConnectionState(peerId) {
-    return this.peers.get(peerId)?.state || null;
+    return this.peers.get(peerId).state || null;
   }
 
killedBy: P2PService getConnectionState should return null for unknown peer
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] ConditionalExpression
src/services/p2p-service.js:607:12
    * @returns {string|null} Connection state or null if not found
    */
   getConnectionState(peerId) {
-    return this.peers.get(peerId)?.state || null;
+    return true;
   }
 
killedBy: P2PService getConnectionState should return null for unknown peer
statusReason: expected true to be null

[Killed] BlockStatement
src/services/p2p-service.js:616:23
    * @param {string} peerId - Peer ID
    * @returns {boolean}
    */
-  isConnected(peerId) {
-    return this.getConnectionState(peerId) === 'connected';
-  }
+  isConnected(peerId) {}
 
   /**
killedBy: P2PService isConnected should return false for unknown peer
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/services/p2p-service.js:617:12
    * @returns {boolean}
    */
   isConnected(peerId) {
-    return this.getConnectionState(peerId) === 'connected';
+    return false;
   }
 
killedBy: P2PService isConnected should return true when connected
statusReason: expected false to be true // Object.is equality
