[Killed] ConditionalExpression
src/services/p2p-service.js:617:12
    * @returns {boolean}
    */
   isConnected(peerId) {
-    return this.getConnectionState(peerId) === 'connected';
+    return true;
   }
 
killedBy: P2PService isConnected should return false for unknown peer
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/p2p-service.js:625:23
    *
    * @returns {string[]}
    */
-  getConnectedPeers() {
-    const connected = [];
-    for (const [peerId, peer] of this.peers) {
-      if (peer.state === 'connected') {
-        connected.push(peerId);
-      }
-    }
-    return connected;
-  }
+  getConnectedPeers() {}
 
   /**
killedBy: P2PService getConnectedPeers should return empty array when no peers
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/services/p2p-service.js:628:11
   getConnectedPeers() {
     const connected = [];
     for (const [peerId, peer] of this.peers) {
-      if (peer.state === 'connected') {
+      if (false) {
         connected.push(peerId);
       }
killedBy: P2PService getConnectedPeers should return only connected peers
statusReason: expected [] to deeply equal [ 'peer-1' ]

[Killed] ConditionalExpression
src/services/p2p-service.js:628:11
   getConnectedPeers() {
     const connected = [];
     for (const [peerId, peer] of this.peers) {
-      if (peer.state === 'connected') {
+      if (true) {
         connected.push(peerId);
       }
killedBy: P2PService getConnectedPeers should return only connected peers
statusReason: expected [ 'peer-1', 'peer-2' ] to deeply equal [ 'peer-1' ]

[Killed] BlockStatement
src/services/p2p-service.js:640:22
    *
    * @param {string} peerId - Peer ID
    */
-  disconnect(peerId) {
-    this._cleanupPeerConnection(peerId);
-  }
+  disconnect(peerId) {}
 
   /**
killedBy: P2PService disconnect should remove peer connection
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/p2p-service.js:647:19
   /**
    * Disconnect from all peers.
    */
-  disconnectAll() {
-    for (const [peerId] of this.peers) {
-      this._cleanupPeerConnection(peerId);
-    }
-  }
+  disconnectAll() {}
 
   /**
killedBy: P2PService disconnectAll should remove all peer connections
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/services/p2p-service.js:648:40
    * Disconnect from all peers.
    */
   disconnectAll() {
-    for (const [peerId] of this.peers) {
-      this._cleanupPeerConnection(peerId);
-    }
+    for (const [peerId] of this.peers) {}
   }
 
killedBy: P2PService disconnectAll should remove all peer connections
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/services/p2p-service.js:657:24
    * Clean up all resources.
    */
   destroy() {
-    this.isDestroyed = true;
+    this.isDestroyed = false;
     this.disconnectAll();
     this.signalingClient.stopPolling();
killedBy: P2PService destroy should clean up all resources
statusReason: expected false to be true // Object.is equality
