[Killed] ObjectLiteral
src/services/party-session.js:18:24
 /**
  * Scoring configuration.
  */
-export const SCORING = {
-  basePoints: 10,           // Points for correct answer
-  maxSpeedBonus: 5,         // Maximum bonus for fast answers
-  speedBonusWindow: 5000,   // Milliseconds to get full speed bonus
-  wrongAnswerPoints: 0,     // No points for wrong answers
-  noAnswerPoints: 0,        // No points for timeout
-};
+export const SCORING = {};
 
 /**
killedBy: SCORING constants has expected default values
statusReason: expected undefined to be 10 // Object.is equality

[Killed] StringLiteral
src/services/party-session.js:32:15
 export const MESSAGE_TYPES = {
   // Host → Guests
   SESSION_INFO: 'session_info',     // Quiz data and settings
-  QUIZ_START: 'quiz_start',         // Start time for synchronization
+  QUIZ_START: "",         // Start time for synchronization
   SCORE_UPDATE: 'score_update',     // Live score updates
   QUIZ_END: 'quiz_end',             // Final results
killedBy: MESSAGE_TYPES constants has all expected message types
statusReason: expected '' to be 'quiz_start' // Object.is equality

[Killed] StringLiteral
src/services/party-session.js:38:11
   KICK: 'kick',                     // Remove participant
 
   // Guests → Host
-  ANSWER: 'answer',                 // Answer submission
+  ANSWER: "",                 // Answer submission
   LEAVE: 'leave',                   // Participant leaving
 };
killedBy: MESSAGE_TYPES constants has all expected message types
statusReason: expected '' to be 'answer' // Object.is equality

[Killed] StringLiteral
src/services/party-session.js:39:10
 
   // Guests → Host
   ANSWER: 'answer',                 // Answer submission
-  LEAVE: 'leave',                   // Participant leaving
+  LEAVE: "",                   // Participant leaving
 };
 
killedBy: MESSAGE_TYPES constants has all expected message types
statusReason: expected '' to be 'leave' // Object.is equality

[Killed] ObjectLiteral
src/services/party-session.js:45:31
 /**
  * Session states.
  */
-export const SESSION_STATES = {
-  WAITING: 'waiting',       // In lobby, waiting for participants
-  PLAYING: 'playing',       // Quiz in progress
-  FINISHED: 'finished',     // Quiz completed
-  ENDED: 'ended',           // Session terminated
-};
+export const SESSION_STATES = {};
 
 /**
killedBy: SESSION_STATES constants has all expected states
statusReason: expected undefined to be 'waiting' // Object.is equality

[Killed] StringLiteral
src/services/party-session.js:48:13
 export const SESSION_STATES = {
   WAITING: 'waiting',       // In lobby, waiting for participants
   PLAYING: 'playing',       // Quiz in progress
-  FINISHED: 'finished',     // Quiz completed
+  FINISHED: "",     // Quiz completed
   ENDED: 'ended',           // Session terminated
 };
killedBy: SESSION_STATES constants has all expected states
statusReason: expected '' to be 'finished' // Object.is equality

[Killed] StringLiteral
src/services/party-session.js:49:10
   WAITING: 'waiting',       // In lobby, waiting for participants
   PLAYING: 'playing',       // Quiz in progress
   FINISHED: 'finished',     // Quiz completed
-  ENDED: 'ended',           // Session terminated
+  ENDED: "",           // Session terminated
 };
 
killedBy: SESSION_STATES constants has all expected states
statusReason: expected '' to be 'ended' // Object.is equality

[Killed] BlockStatement
src/services/party-session.js:81:58
  * @param {number} responseTimeMs - Time taken to answer in milliseconds
  * @returns {number} Points earned
  */
-export function calculatePoints(correct, responseTimeMs) {
-  if (!correct) {
-    return SCORING.wrongAnswerPoints;
-  }
-
-  // Base points for correct answer
-  let points = SCORING.basePoints;
-
-  // Speed bonus: faster answers get more bonus points
-  if (responseTimeMs < SCORING.speedBonusWindow) {
-    const speedRatio = 1 - (responseTimeMs / SCORING.speedBonusWindow);
-    points += Math.round(SCORING.maxSpeedBonus * speedRatio);
-  }
-
-  return points;
-}
+export function calculatePoints(correct, responseTimeMs) {}
 
 /**
killedBy: calculatePoints returns 0 for wrong answers
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BooleanLiteral
src/services/party-session.js:82:7
  * @returns {number} Points earned
  */
 export function calculatePoints(correct, responseTimeMs) {
-  if (!correct) {
+  if (correct) {
     return SCORING.wrongAnswerPoints;
   }
killedBy: calculatePoints returns 0 for wrong answers
statusReason: expected 15 to be +0 // Object.is equality

[Killed] BlockStatement
src/services/party-session.js:82:17
  * @returns {number} Points earned
  */
 export function calculatePoints(correct, responseTimeMs) {
-  if (!correct) {
-    return SCORING.wrongAnswerPoints;
-  }
+  if (!correct) {}
 
   // Base points for correct answer
killedBy: calculatePoints returns 0 for wrong answers
statusReason: expected 15 to be +0 // Object.is equality

[Killed] EqualityOperator
src/services/party-session.js:90:7
   let points = SCORING.basePoints;
 
   // Speed bonus: faster answers get more bonus points
-  if (responseTimeMs < SCORING.speedBonusWindow) {
+  if (responseTimeMs >= SCORING.speedBonusWindow) {
     const speedRatio = 1 - (responseTimeMs / SCORING.speedBonusWindow);
     points += Math.round(SCORING.maxSpeedBonus * speedRatio);
killedBy: calculatePoints returns base points for correct answers with no speed bonus
statusReason: expected 9 to be 10 // Object.is equality

[Killed] BlockStatement
src/services/party-session.js:90:50
   let points = SCORING.basePoints;
 
   // Speed bonus: faster answers get more bonus points
-  if (responseTimeMs < SCORING.speedBonusWindow) {
-    const speedRatio = 1 - (responseTimeMs / SCORING.speedBonusWindow);
-    points += Math.round(SCORING.maxSpeedBonus * speedRatio);
-  }
+  if (responseTimeMs < SCORING.speedBonusWindow) {}
 
   return points;
killedBy: calculatePoints returns max points for instant answers
statusReason: expected 10 to be 15 // Object.is equality

[Killed] ArithmeticOperator
src/services/party-session.js:91:24
 
   // Speed bonus: faster answers get more bonus points
   if (responseTimeMs < SCORING.speedBonusWindow) {
-    const speedRatio = 1 - (responseTimeMs / SCORING.speedBonusWindow);
+    const speedRatio = 1 + responseTimeMs / SCORING.speedBonusWindow;
     points += Math.round(SCORING.maxSpeedBonus * speedRatio);
   }
killedBy: calculatePoints calculates speed bonus correctly for fast answers
statusReason: expected 16 to be 14 // Object.is equality

[Killed] ArithmeticOperator
src/services/party-session.js:91:29
 
   // Speed bonus: faster answers get more bonus points
   if (responseTimeMs < SCORING.speedBonusWindow) {
-    const speedRatio = 1 - (responseTimeMs / SCORING.speedBonusWindow);
+    const speedRatio = 1 - (responseTimeMs * SCORING.speedBonusWindow);
     points += Math.round(SCORING.maxSpeedBonus * speedRatio);
   }
killedBy: calculatePoints calculates speed bonus correctly for fast answers
statusReason: expected -24999985 to be 14 // Object.is equality

[Killed] ArithmeticOperator
src/services/party-session.js:92:26
   // Speed bonus: faster answers get more bonus points
   if (responseTimeMs < SCORING.speedBonusWindow) {
     const speedRatio = 1 - (responseTimeMs / SCORING.speedBonusWindow);
-    points += Math.round(SCORING.maxSpeedBonus * speedRatio);
+    points += Math.round(SCORING.maxSpeedBonus / speedRatio);
   }
 
killedBy: calculatePoints calculates speed bonus correctly for fast answers
statusReason: expected 16 to be 14 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:107:7
  * @returns {number} Current question index (0-based), or -1 if not started
  */
 export function getCurrentQuestionIndex(startTime, secondsPerQuestion, totalQuestions) {
-  if (!startTime) return -1;
+  if (false) return -1;
 
   const elapsed = Date.now() - startTime;
killedBy: getCurrentQuestionIndex returns -1 when startTime is 0 or falsy
statusReason: expected 4 to be -1 // Object.is equality

[Killed] BooleanLiteral
src/services/party-session.js:107:7
  * @returns {number} Current question index (0-based), or -1 if not started
  */
 export function getCurrentQuestionIndex(startTime, secondsPerQuestion, totalQuestions) {
-  if (!startTime) return -1;
+  if (startTime) return -1;
 
   const elapsed = Date.now() - startTime;
killedBy: getCurrentQuestionIndex returns -1 when startTime is 0 or falsy
statusReason: expected 4 to be -1 // Object.is equality

[Killed] ArithmeticOperator
src/services/party-session.js:110:24
   if (!startTime) return -1;
 
   const elapsed = Date.now() - startTime;
-  const questionTime = secondsPerQuestion * 1000;
+  const questionTime = secondsPerQuestion / 1000;
   const index = Math.floor(elapsed / questionTime);
 
killedBy: getCurrentQuestionIndex advances to next question after time elapses
statusReason: expected 4 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/services/party-session.js:111:28
 
   const elapsed = Date.now() - startTime;
   const questionTime = secondsPerQuestion * 1000;
-  const index = Math.floor(elapsed / questionTime);
+  const index = Math.floor(elapsed * questionTime);
 
   return Math.min(index, totalQuestions - 1);
killedBy: getCurrentQuestionIndex advances to next question after time elapses
statusReason: expected 4 to be +0 // Object.is equality

[Killed] MethodExpression
src/services/party-session.js:113:10
   const questionTime = secondsPerQuestion * 1000;
   const index = Math.floor(elapsed / questionTime);
 
-  return Math.min(index, totalQuestions - 1);
+  return Math.max(index, totalQuestions - 1);
 }
 
killedBy: getCurrentQuestionIndex returns 0 for first question
statusReason: expected 4 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/services/party-session.js:113:26
   const questionTime = secondsPerQuestion * 1000;
   const index = Math.floor(elapsed / questionTime);
 
-  return Math.min(index, totalQuestions - 1);
+  return Math.min(index, totalQuestions + 1);
 }
 
killedBy: getCurrentQuestionIndex caps at last question index
statusReason: expected 6 to be 4 // Object.is equality

[Killed] BooleanLiteral
src/services/party-session.js:124:7
  * @returns {number} Milliseconds remaining, or 0 if not started
  */
 export function getTimeRemaining(startTime, secondsPerQuestion) {
-  if (!startTime) return 0;
+  if (startTime) return 0;
 
   const elapsed = Date.now() - startTime;
killedBy: getTimeRemaining returns 0 when startTime is 0 or falsy
statusReason: expected 3271 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:124:7
  * @returns {number} Milliseconds remaining, or 0 if not started
  */
 export function getTimeRemaining(startTime, secondsPerQuestion) {
-  if (!startTime) return 0;
+  if (false) return 0;
 
   const elapsed = Date.now() - startTime;
killedBy: getTimeRemaining returns 0 when startTime is 0 or falsy
statusReason: expected 3270 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/services/party-session.js:126:19
 export function getTimeRemaining(startTime, secondsPerQuestion) {
   if (!startTime) return 0;
 
-  const elapsed = Date.now() - startTime;
+  const elapsed = Date.now() + startTime;
   const questionTime = secondsPerQuestion * 1000;
   const timeInQuestion = elapsed % questionTime;
killedBy: getTimeRemaining returns full time at question start
statusReason: expected 6534 to be 30000 // Object.is equality

[Killed] ArithmeticOperator
src/services/party-session.js:128:26
 
   const elapsed = Date.now() - startTime;
   const questionTime = secondsPerQuestion * 1000;
-  const timeInQuestion = elapsed % questionTime;
+  const timeInQuestion = elapsed * questionTime;
 
   return questionTime - timeInQuestion;
killedBy: getTimeRemaining returns decreasing time as question progresses
statusReason: expected -299970000 to be 20000 // Object.is equality

[Killed] ArithmeticOperator
src/services/party-session.js:130:10
   const questionTime = secondsPerQuestion * 1000;
   const timeInQuestion = elapsed % questionTime;
 
-  return questionTime - timeInQuestion;
+  return questionTime + timeInQuestion;
 }
 
killedBy: getTimeRemaining returns decreasing time as question progresses
statusReason: expected 40000 to be 20000 // Object.is equality

[Killed] StringLiteral
src/services/party-session.js:151:26
     this.isHost = isHost;
 
     /** @type {string} */
-    this.participantId = `${isHost ? 'host' : 'guest'}-${Date.now()}`;
+    this.participantId = ``;
 
     /** @type {string} */
killedBy: PartySession constructor initializes as host correctly
statusReason: expected '' to match /^host-/

[Survived] UnaryOperator
src/services/party-session.js:172:28
     this.secondsPerQuestion = 30;
 
     /** @type {number} */
-    this.currentQuestion = -1;
+    this.currentQuestion = +1;
 
     /** @type {Map<string, Participant>} */

[Killed] BlockStatement
src/services/party-session.js:206:26
    *
    * @private
    */
-  _setupMessageHandler() {
-    this.p2p.onMessage((peerId, message) => {
-      this._handleMessage(peerId, message);
-    });
-
-    this.p2p.onPeerConnected((peerId) => {
-      log.info('Peer connected', { peerId });
-      if (this.isHost) {
-        this._sendSessionInfo(peerId);
-      }
-    });
-
-    this.p2p.onPeerDisconnected((peerId, reason) => {
-      log.info('Peer disconnected', { peerId, reason });
-      this._handlePeerDisconnected(peerId);
-    });
-  }
+  _setupMessageHandler() {}
 
   /**
killedBy: PartySession constructor sets up P2P message handlers
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/services/party-session.js:207:45
    * @private
    */
   _setupMessageHandler() {
-    this.p2p.onMessage((peerId, message) => {
-      this._handleMessage(peerId, message);
-    });
+    this.p2p.onMessage((peerId, message) => {});
 
     this.p2p.onPeerConnected((peerId) => {
killedBy: PartySession message handling SESSION_INFO (guest receives) updates guest with session info
statusReason: Cannot read properties of null (reading 'topic')

[Killed] BlockStatement
src/services/party-session.js:211:42
       this._handleMessage(peerId, message);
     });
 
-    this.p2p.onPeerConnected((peerId) => {
-      log.info('Peer connected', { peerId });
-      if (this.isHost) {
-        this._sendSessionInfo(peerId);
-      }
-    });
+    this.p2p.onPeerConnected((peerId) => {});
 
     this.p2p.onPeerDisconnected((peerId, reason) => {
killedBy: PartySession peer connection events sends session info when peer connects (host)
statusReason: expected "vi.fn()" to be called with arguments: [ 'new-peer', …(1) ]

Number of calls: 0

[Survived] ObjectLiteral
src/services/party-session.js:212:34
     });
 
     this.p2p.onPeerConnected((peerId) => {
-      log.info('Peer connected', { peerId });
+      log.info('Peer connected', {});
       if (this.isHost) {
         this._sendSessionInfo(peerId);

[Survived] StringLiteral
src/services/party-session.js:212:16
     });
 
     this.p2p.onPeerConnected((peerId) => {
-      log.info('Peer connected', { peerId });
+      log.info("", { peerId });
       if (this.isHost) {
         this._sendSessionInfo(peerId);

[Killed] BlockStatement
src/services/party-session.js:213:24
 
     this.p2p.onPeerConnected((peerId) => {
       log.info('Peer connected', { peerId });
-      if (this.isHost) {
-        this._sendSessionInfo(peerId);
-      }
+      if (this.isHost) {}
     });
 
killedBy: PartySession peer connection events sends session info when peer connects (host)
statusReason: expected "vi.fn()" to be called with arguments: [ 'new-peer', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/party-session.js:213:11
 
     this.p2p.onPeerConnected((peerId) => {
       log.info('Peer connected', { peerId });
-      if (this.isHost) {
+      if (false) {
         this._sendSessionInfo(peerId);
       }
killedBy: PartySession peer connection events sends session info when peer connects (host)
statusReason: expected "vi.fn()" to be called with arguments: [ 'new-peer', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-session.js:218:53
       }
     });
 
-    this.p2p.onPeerDisconnected((peerId, reason) => {
-      log.info('Peer disconnected', { peerId, reason });
-      this._handlePeerDisconnected(peerId);
-    });
+    this.p2p.onPeerDisconnected((peerId, reason) => {});
   }
 
killedBy: PartySession peer connection events marks participant as disconnected on peer disconnect
statusReason: expected 'connected' to be 'disconnected' // Object.is equality

[Survived] ObjectLiteral
src/services/party-session.js:219:37
     });
 
     this.p2p.onPeerDisconnected((peerId, reason) => {
-      log.info('Peer disconnected', { peerId, reason });
+      log.info('Peer disconnected', {});
       this._handlePeerDisconnected(peerId);
     });

[Killed] ConditionalExpression
src/services/party-session.js:237:7
     log.debug('Received message', { peerId, type });
 
     switch (type) {
-      case MESSAGE_TYPES.SESSION_INFO:
-        this._handleSessionInfo(payload);
-        break;
+      case MESSAGE_TYPES.SESSION_INFO:
 
       case MESSAGE_TYPES.QUIZ_START:
killedBy: PartySession message handling SESSION_INFO (guest receives) updates guest with session info
statusReason: Cannot read properties of null (reading 'topic')

[Killed] ConditionalExpression
src/services/party-session.js:241:7
         this._handleSessionInfo(payload);
         break;
 
-      case MESSAGE_TYPES.QUIZ_START:
-        this._handleQuizStart(payload);
-        break;
+      case MESSAGE_TYPES.QUIZ_START:
 
       case MESSAGE_TYPES.ANSWER:
killedBy: PartySession message handling QUIZ_START (guest receives) sets startTime and state
statusReason: expected +0 to be 1234567890 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:245:7
         this._handleQuizStart(payload);
         break;
 
-      case MESSAGE_TYPES.ANSWER:
-        if (this.isHost) {
-          this._handleAnswer(peerId, payload);
-        }
-        break;
+      case MESSAGE_TYPES.ANSWER:
 
       case MESSAGE_TYPES.SCORE_UPDATE:
killedBy: PartySession message handling ANSWER (host receives) processes guest answer and updates score
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/services/party-session.js:246:26
         break;
 
       case MESSAGE_TYPES.ANSWER:
-        if (this.isHost) {
-          this._handleAnswer(peerId, payload);
-        }
+        if (this.isHost) {}
         break;
 
killedBy: PartySession message handling ANSWER (host receives) processes guest answer and updates score
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:246:13
         break;
 
       case MESSAGE_TYPES.ANSWER:
-        if (this.isHost) {
+        if (false) {
           this._handleAnswer(peerId, payload);
         }
killedBy: PartySession message handling ANSWER (host receives) processes guest answer and updates score
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:251:7
         }
         break;
 
-      case MESSAGE_TYPES.SCORE_UPDATE:
-        this._handleScoreUpdate(payload);
-        break;
+      case MESSAGE_TYPES.SCORE_UPDATE:
 
       case MESSAGE_TYPES.QUIZ_END:
killedBy: PartySession message handling SCORE_UPDATE (guest receives) updates participant scores
statusReason: expected +0 to be 15 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:255:7
         this._handleScoreUpdate(payload);
         break;
 
-      case MESSAGE_TYPES.QUIZ_END:
-        this._handleQuizEnd(payload);
-        break;
+      case MESSAGE_TYPES.QUIZ_END:
 
       case MESSAGE_TYPES.LEAVE:
killedBy: PartySession message handling QUIZ_END (guest receives) sets state to finished and calls callback
statusReason: expected 'waiting' to be 'finished' // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:259:7
         this._handleQuizEnd(payload);
         break;
 
-      case MESSAGE_TYPES.LEAVE:
-        this._handleParticipantLeave(peerId);
-        break;
+      case MESSAGE_TYPES.LEAVE:
 
       default:
killedBy: PartySession message handling LEAVE (host receives) removes participant
statusReason: expected 2 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/services/party-session.js:263:7
         this._handleParticipantLeave(peerId);
         break;
 
-      default:
-        log.warn('Unknown message type', { type });
+      default:
     }
   }

[Survived] StringLiteral
src/services/party-session.js:264:18
         break;
 
       default:
-        log.warn('Unknown message type', { type });
+        log.warn("", { type });
     }
   }

[Killed] ConditionalExpression
src/services/party-session.js:281:9
    * @param {number} [secondsPerQuestion=30] - Time per question
    */
   createSession(quiz, roomCode, hostName, secondsPerQuestion = 30) {
-    if (!this.isHost) {
+    if (true) {
       throw new Error('Only host can create session');
     }
killedBy: PartySession createSession (host) creates a session with quiz data
statusReason: Only host can create session

[Killed] BlockStatement
src/services/party-session.js:281:23
    * @param {number} [secondsPerQuestion=30] - Time per question
    */
   createSession(quiz, roomCode, hostName, secondsPerQuestion = 30) {
-    if (!this.isHost) {
-      throw new Error('Only host can create session');
-    }
+    if (!this.isHost) {}
 
     this.quiz = quiz;
killedBy: PartySession createSession (host) throws error if called by guest
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/services/party-session.js:282:23
    */
   createSession(quiz, roomCode, hostName, secondsPerQuestion = 30) {
     if (!this.isHost) {
-      throw new Error('Only host can create session');
+      throw new Error("");
     }
 
killedBy: PartySession createSession (host) throws error if called by guest
statusReason: expected [Function] to throw error including 'Only host can create session' but got ''

[Killed] BooleanLiteral
src/services/party-session.js:295:15
     this.participants.set(this.participantId, {
       id: this.participantId,
       name: hostName,
-      isHost: true,
+      isHost: false,
       score: 0,
       answers: [],
killedBy: PartySession createSession (host) adds host as first participant
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/services/party-session.js:299:15
       score: 0,
       answers: [],
       answerTimes: [],
-      status: 'connected',
+      status: "",
     });
 

[Survived] ObjectLiteral
src/services/party-session.js:305:43
     this._notifyParticipantsChange();
 
     // Track telemetry
-    telemetry.track('party_room_created', { roomCode });
+    telemetry.track('party_room_created', {});
 
     log.info('Session created', { roomCode, quiz: quiz.topic });

[Killed] BlockStatement
src/services/party-session.js:316:28
    * @private
    * @param {string} peerId - Peer to send info to
    */
-  _sendSessionInfo(peerId) {
-    this.p2p.send(peerId, {
-      type: MESSAGE_TYPES.SESSION_INFO,
-      payload: {
-        quiz: this.quiz,
-        roomCode: this.roomCode,
-        secondsPerQuestion: this.secondsPerQuestion,
-        participants: Array.from(this.participants.values()),
-        state: this.state,
-      },
-    });
-  }
+  _sendSessionInfo(peerId) {}
 
   /**
killedBy: PartySession peer connection events sends session info when peer connects (host)
statusReason: expected "vi.fn()" to be called with arguments: [ 'new-peer', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/party-session.js:336:9
    * @param {string} name - Participant name
    */
   addParticipant(peerId, name) {
-    if (!this.isHost) return;
+    if (false) return;
 
     /** @type {Participant} */
killedBy: PartySession addParticipant (host) does nothing if called by guest
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/services/party-session.js:336:9
    * @param {string} name - Participant name
    */
   addParticipant(peerId, name) {
-    if (!this.isHost) return;
+    if (this.isHost) return;
 
     /** @type {Participant} */
killedBy: PartySession addParticipant (host) adds a new participant
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/services/party-session.js:342:15
     const participant = {
       id: peerId,
       name,
-      isHost: false,
+      isHost: true,
       score: 0,
       answers: [],
killedBy: PartySession addParticipant (host) adds a new participant
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
src/services/party-session.js:344:16
       name,
       isHost: false,
       score: 0,
-      answers: [],
+      answers: ["Stryker was here"],
       answerTimes: [],
       status: 'connected',
killedBy: PartySession message handling ANSWER (host receives) processes guest answer and updates score
statusReason: expected 'Stryker was here' to be +0 // Object.is equality

[Survived] ArrayDeclaration
src/services/party-session.js:345:20
       isHost: false,
       score: 0,
       answers: [],
-      answerTimes: [],
+      answerTimes: ["Stryker was here"],
       status: 'connected',
     };

[Survived] ObjectLiteral
src/services/party-session.js:359:35
       participantCount: this.participants.size,
     });
 
-    log.info('Participant added', { peerId, name });
+    log.info('Participant added', {});
   }
 

[Killed] ConditionalExpression
src/services/party-session.js:366:9
    * Start the quiz (host only).
    */
   startQuiz() {
-    if (!this.isHost) {
+    if (true) {
       throw new Error('Only host can start quiz');
     }
killedBy: PartySession startQuiz (host) starts the quiz
statusReason: Only host can start quiz

[Killed] BooleanLiteral
src/services/party-session.js:366:9
    * Start the quiz (host only).
    */
   startQuiz() {
-    if (!this.isHost) {
+    if (this.isHost) {
       throw new Error('Only host can start quiz');
     }
killedBy: PartySession startQuiz (host) starts the quiz
statusReason: Only host can start quiz

[Killed] ConditionalExpression
src/services/party-session.js:370:9
       throw new Error('Only host can start quiz');
     }
 
-    if (this.state !== SESSION_STATES.WAITING) {
+    if (false) {
       throw new Error('Quiz already started');
     }
killedBy: PartySession startQuiz (host) throws error if quiz already started
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/services/party-session.js:370:9
       throw new Error('Only host can start quiz');
     }
 
-    if (this.state !== SESSION_STATES.WAITING) {
+    if (this.state === SESSION_STATES.WAITING) {
       throw new Error('Quiz already started');
     }
killedBy: PartySession startQuiz (host) starts the quiz
statusReason: Quiz already started

[Killed] BlockStatement
src/services/party-session.js:379:59
     this.currentQuestion = 0;
 
     // Update all participants to "thinking" status
-    for (const participant of this.participants.values()) {
-      participant.status = 'thinking';
-    }
+    for (const participant of this.participants.values()) {}
 
     // Broadcast start time to all peers
killedBy: PartySession startQuiz (host) sets all participants to thinking status
statusReason: expected 'connected' to be 'thinking' // Object.is equality

[Killed] ObjectLiteral
src/services/party-session.js:384:24
     }
 
     // Broadcast start time to all peers
-    this.p2p.broadcast({
-      type: MESSAGE_TYPES.QUIZ_START,
-      payload: {
-        startTime: this.startTime,
-      },
-    });
+    this.p2p.broadcast({});
 
     this._notifyStateChange();
killedBy: PartySession startQuiz (host) broadcasts start time to peers
statusReason: expected "vi.fn()" to be called with arguments: [ { type: 'quiz_start', …(1) } ]

Received: 

  1st vi.fn() call:

  [
-   {

[Survived] ObjectLiteral
src/services/party-session.js:396:43
     this._startQuestionTimer();
 
     // Track telemetry
-    telemetry.track('party_room_started', {
-      roomCode: this.roomCode,
-      participantCount: this.participants.size,
-      questionCount: this.quiz.questions.length,
-    });
+    telemetry.track('party_room_started', {});
 
     log.info('Quiz started', { startTime: this.startTime });

[Survived] StringLiteral
src/services/party-session.js:396:21
     this._startQuestionTimer();
 
     // Track telemetry
-    telemetry.track('party_room_started', {
+    telemetry.track("", {
       roomCode: this.roomCode,
       participantCount: this.participants.size,

[Killed] BooleanLiteral
src/services/party-session.js:416:9
     const { questionIndex, answerIndex, timestamp } = payload;
 
     const participant = this.participants.get(peerId);
-    if (!participant) {
+    if (participant) {
       log.warn('Answer from unknown participant', { peerId });
       return;
killedBy: PartySession message handling ANSWER (host receives) processes guest answer and updates score
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:416:9
     const { questionIndex, answerIndex, timestamp } = payload;
 
     const participant = this.participants.get(peerId);
-    if (!participant) {
+    if (false) {
       log.warn('Answer from unknown participant', { peerId });
       return;
killedBy: PartySession message handling ANSWER (host receives) ignores answer from unknown participant
statusReason: Cannot read properties of undefined (reading 'answers')
