[Killed] EqualityOperator
src/services/party-session.js:422:9
     }
 
     // Ignore if already answered this question
-    if (participant.answers[questionIndex] !== undefined) {
+    if (participant.answers[questionIndex] === undefined) {
       log.debug('Duplicate answer ignored', { peerId, questionIndex });
       return;
killedBy: PartySession message handling ANSWER (host receives) processes guest answer and updates score
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:422:9
     }
 
     // Ignore if already answered this question
-    if (participant.answers[questionIndex] !== undefined) {
+    if (true) {
       log.debug('Duplicate answer ignored', { peerId, questionIndex });
       return;
killedBy: PartySession message handling ANSWER (host receives) processes guest answer and updates score
statusReason: expected undefined to be +0 // Object.is equality

[Survived] ObjectLiteral
src/services/party-session.js:423:45
 
     // Ignore if already answered this question
     if (participant.answers[questionIndex] !== undefined) {
-      log.debug('Duplicate answer ignored', { peerId, questionIndex });
+      log.debug('Duplicate answer ignored', {});
       return;
     }

[Survived] ArithmeticOperator
src/services/party-session.js:428:31
     }
 
     // Calculate response time
-    const questionStartTime = this.startTime + (questionIndex * this.secondsPerQuestion * 1000);
+    const questionStartTime = this.startTime - questionIndex * this.secondsPerQuestion * 1000;
     const responseTime = timestamp - questionStartTime;
 

[Survived] ArithmeticOperator
src/services/party-session.js:428:49
     }
 
     // Calculate response time
-    const questionStartTime = this.startTime + (questionIndex * this.secondsPerQuestion * 1000);
+    const questionStartTime = this.startTime + (questionIndex / this.secondsPerQuestion * 1000);
     const responseTime = timestamp - questionStartTime;
 

[Killed] ArithmeticOperator
src/services/party-session.js:429:26
 
     // Calculate response time
     const questionStartTime = this.startTime + (questionIndex * this.secondsPerQuestion * 1000);
-    const responseTime = timestamp - questionStartTime;
+    const responseTime = timestamp + questionStartTime;
 
     // Check if correct
killedBy: PartySession message handling ANSWER (host receives) processes guest answer and updates score
statusReason: expected 10 to be greater than 10

[Killed] EqualityOperator
src/services/party-session.js:433:23
 
     // Check if correct
     const question = this.quiz.questions[questionIndex];
-    const isCorrect = answerIndex === question.correct;
+    const isCorrect = answerIndex !== question.correct;
 
     // Calculate points
killedBy: PartySession message handling ANSWER (host receives) processes guest answer and updates score
statusReason: expected 0 to be greater than 10

[Killed] ConditionalExpression
src/services/party-session.js:433:23
 
     // Check if correct
     const question = this.quiz.questions[questionIndex];
-    const isCorrect = answerIndex === question.correct;
+    const isCorrect = false;
 
     // Calculate points
killedBy: PartySession message handling ANSWER (host receives) processes guest answer and updates score
statusReason: expected 0 to be greater than 10

[Killed] AssignmentOperator
src/services/party-session.js:441:5
     // Update participant
     participant.answers[questionIndex] = answerIndex;
     participant.answerTimes[questionIndex] = responseTime;
-    participant.score += points;
+    participant.score -= points;
     participant.status = 'answered';
 
killedBy: PartySession message handling ANSWER (host receives) processes guest answer and updates score
statusReason: expected -15 to be greater than 10

[Survived] ObjectLiteral
src/services/party-session.js:455:33
       correct: isCorrect,
     });
 
-    log.info('Answer received', {
-      peerId,
-      questionIndex,
-      isCorrect,
-      points,
-      totalScore: participant.score,
-    });
+    log.info('Answer received', {});
   }
 

[Killed] BlockStatement
src/services/party-session.js:470:48
    * @param {number} questionIndex - Question index
    * @param {number} answerIndex - Selected answer index
    */
-  submitHostAnswer(questionIndex, answerIndex) {
-    if (!this.isHost) return;
-
-    const participant = this.participants.get(this.participantId);
-    if (!participant) return;
-
-    // Ignore if already answered
-    if (participant.answers[questionIndex] !== undefined) return;
-
-    const questionStartTime = this.startTime + (questionIndex * this.secondsPerQuestion * 1000);
-    const responseTime = Date.now() - questionStartTime;
-
-    const question = this.quiz.questions[questionIndex];
-    const isCorrect = answerIndex === question.correct;
-    const points = calculatePoints(isCorrect, responseTime);
-
-    participant.answers[questionIndex] = answerIndex;
-    participant.answerTimes[questionIndex] = responseTime;
-    participant.score += points;
-    participant.status = 'answered';
-
-    this._notifyParticipantsChange();
-    this._broadcastScoreUpdate();
-  }
+  submitHostAnswer(questionIndex, answerIndex) {}
 
   /**
killedBy: PartySession submitHostAnswer records host answer and calculates score
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BooleanLiteral
src/services/party-session.js:471:9
    * @param {number} answerIndex - Selected answer index
    */
   submitHostAnswer(questionIndex, answerIndex) {
-    if (!this.isHost) return;
+    if (this.isHost) return;
 
     const participant = this.participants.get(this.participantId);
killedBy: PartySession submitHostAnswer records host answer and calculates score
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:471:9
    * @param {number} answerIndex - Selected answer index
    */
   submitHostAnswer(questionIndex, answerIndex) {
-    if (!this.isHost) return;
+    if (true) return;
 
     const participant = this.participants.get(this.participantId);
killedBy: PartySession submitHostAnswer records host answer and calculates score
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:474:9
     if (!this.isHost) return;
 
     const participant = this.participants.get(this.participantId);
-    if (!participant) return;
+    if (true) return;
 
     // Ignore if already answered
killedBy: PartySession submitHostAnswer records host answer and calculates score
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BooleanLiteral
src/services/party-session.js:474:9
     if (!this.isHost) return;
 
     const participant = this.participants.get(this.participantId);
-    if (!participant) return;
+    if (participant) return;
 
     // Ignore if already answered
killedBy: PartySession submitHostAnswer records host answer and calculates score
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:477:9
     if (!participant) return;
 
     // Ignore if already answered
-    if (participant.answers[questionIndex] !== undefined) return;
+    if (true) return;
 
     const questionStartTime = this.startTime + (questionIndex * this.secondsPerQuestion * 1000);
killedBy: PartySession submitHostAnswer records host answer and calculates score
statusReason: expected undefined to be +0 // Object.is equality

[Survived] ConditionalExpression
src/services/party-session.js:477:9
     if (!participant) return;
 
     // Ignore if already answered
-    if (participant.answers[questionIndex] !== undefined) return;
+    if (false) return;
 
     const questionStartTime = this.startTime + (questionIndex * this.secondsPerQuestion * 1000);

[Survived] ArithmeticOperator
src/services/party-session.js:479:31
     // Ignore if already answered
     if (participant.answers[questionIndex] !== undefined) return;
 
-    const questionStartTime = this.startTime + (questionIndex * this.secondsPerQuestion * 1000);
+    const questionStartTime = this.startTime - questionIndex * this.secondsPerQuestion * 1000;
     const responseTime = Date.now() - questionStartTime;
 

[Killed] ArithmeticOperator
src/services/party-session.js:480:26
     if (participant.answers[questionIndex] !== undefined) return;
 
     const questionStartTime = this.startTime + (questionIndex * this.secondsPerQuestion * 1000);
-    const responseTime = Date.now() - questionStartTime;
+    const responseTime = Date.now() + questionStartTime;
 
     const question = this.quiz.questions[questionIndex];
killedBy: PartySession submitHostAnswer records host answer and calculates score
statusReason: expected 10 to be 15 // Object.is equality

[Survived] ConditionalExpression
src/services/party-session.js:501:9
    * @private
    */
   _startQuestionTimer() {
-    if (this.questionTimer) {
+    if (true) {
       clearInterval(this.questionTimer);
     }

[NoCoverage] BlockStatement
src/services/party-session.js:501:29
    * @private
    */
   _startQuestionTimer() {
-    if (this.questionTimer) {
-      clearInterval(this.questionTimer);
-    }
+    if (this.questionTimer) {}
 
     this.questionTimer = setInterval(() => {

[Killed] EqualityOperator
src/services/party-session.js:512:11
         this.quiz.questions.length
       );
 
-      if (newQuestion !== this.currentQuestion) {
+      if (newQuestion === this.currentQuestion) {
         this.currentQuestion = newQuestion;
 
killedBy: PartySession callbacks calls onQuestionChange callback when question changes
statusReason: expected "vi.fn()" to be called with arguments: [ 1, { question: 'Q2?', …(2) } ]

Received: 

  1st vi.fn() call:

  [
-   1,

[Killed] BlockStatement
src/services/party-session.js:512:49
         this.quiz.questions.length
       );
 
-      if (newQuestion !== this.currentQuestion) {
-        this.currentQuestion = newQuestion;
-
-        // Reset participant status for new question
-        for (const participant of this.participants.values()) {
-          if (participant.answers[newQuestion] === undefined) {
-            participant.status = 'thinking';
-          }
-        }
-
-        this._notifyQuestionChange();
-        this._notifyParticipantsChange();
-
-        // Check if quiz is finished
-        if (newQuestion >= this.quiz.questions.length - 1) {
-          // Wait for the last question to complete
-          setTimeout(() => {
-            this._endQuiz();
-          }, this.secondsPerQuestion * 1000);
-        }
-      }
+      if (newQuestion !== this.currentQuestion) {}
     }, 100); // Check every 100ms
   }
killedBy: PartySession callbacks calls onQuestionChange callback when question changes
statusReason: expected "vi.fn()" to be called with arguments: [ 1, { question: 'Q2?', …(2) } ]

Number of calls: 0

[Survived] BlockStatement
src/services/party-session.js:516:63
         this.currentQuestion = newQuestion;
 
         // Reset participant status for new question
-        for (const participant of this.participants.values()) {
-          if (participant.answers[newQuestion] === undefined) {
-            participant.status = 'thinking';
-          }
-        }
+        for (const participant of this.participants.values()) {}
 
         this._notifyQuestionChange();

[Survived] BlockStatement
src/services/party-session.js:517:63
 
         // Reset participant status for new question
         for (const participant of this.participants.values()) {
-          if (participant.answers[newQuestion] === undefined) {
-            participant.status = 'thinking';
-          }
+          if (participant.answers[newQuestion] === undefined) {}
         }
 

[Survived] EqualityOperator
src/services/party-session.js:517:15
 
         // Reset participant status for new question
         for (const participant of this.participants.values()) {
-          if (participant.answers[newQuestion] === undefined) {
+          if (participant.answers[newQuestion] !== undefined) {
             participant.status = 'thinking';
           }

[Killed] EqualityOperator
src/services/party-session.js:526:13
         this._notifyParticipantsChange();
 
         // Check if quiz is finished
-        if (newQuestion >= this.quiz.questions.length - 1) {
+        if (newQuestion < this.quiz.questions.length - 1) {
           // Wait for the last question to complete
           setTimeout(() => {
killedBy: PartySession callbacks calls onQuizEnd callback when quiz finishes
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array> ]

Number of calls: 0

[Killed] ArithmeticOperator
src/services/party-session.js:526:28
         this._notifyParticipantsChange();
 
         // Check if quiz is finished
-        if (newQuestion >= this.quiz.questions.length - 1) {
+        if (newQuestion >= this.quiz.questions.length + 1) {
           // Wait for the last question to complete
           setTimeout(() => {
killedBy: PartySession callbacks calls onQuizEnd callback when quiz finishes
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array> ]

Number of calls: 0

[Survived] ArithmeticOperator
src/services/party-session.js:530:14
           // Wait for the last question to complete
           setTimeout(() => {
             this._endQuiz();
-          }, this.secondsPerQuestion * 1000);
+          }, this.secondsPerQuestion / 1000);
         }
       }

[Survived] ConditionalExpression
src/services/party-session.js:542:9
    * @private
    */
   _endQuiz() {
-    if (this.questionTimer) {
+    if (true) {
       clearInterval(this.questionTimer);
       this.questionTimer = null;

[Survived] BlockStatement
src/services/party-session.js:542:29
    * @private
    */
   _endQuiz() {
-    if (this.questionTimer) {
-      clearInterval(this.questionTimer);
-      this.questionTimer = null;
-    }
+    if (this.questionTimer) {}
 
     this.state = SESSION_STATES.FINISHED;

[Killed] ConditionalExpression
src/services/party-session.js:561:9
     });
 
     this._notifyStateChange();
-    if (this.onQuizEndCallback) {
+    if (false) {
       this.onQuizEndCallback(standings);
     }
killedBy: PartySession callbacks calls onQuizEnd callback when quiz finishes
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array> ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-session.js:561:33
     });
 
     this._notifyStateChange();
-    if (this.onQuizEndCallback) {
-      this.onQuizEndCallback(standings);
-    }
+    if (this.onQuizEndCallback) {}
 
     // Track telemetry
killedBy: PartySession callbacks calls onQuizEnd callback when quiz finishes
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array> ]

Number of calls: 0

[Survived] ArithmeticOperator
src/services/party-session.js:566:22
     }
 
     // Track telemetry
-    const duration = Date.now() - this.startTime;
+    const duration = Date.now() + this.startTime;
     telemetry.track('party_room_ended', {
       roomCode: this.roomCode,

[Survived] ArrowFunction
src/services/party-session.js:573:55
       duration,
     });
 
-    log.info('Quiz ended', { standings: standings.map(p => ({ name: p.name, score: p.score })) });
+    log.info('Quiz ended', { standings: standings.map(() => undefined) });
   }
 

[Killed] BlockStatement
src/services/party-session.js:581:27
    *
    * @private
    */
-  _broadcastScoreUpdate() {
-    const scores = Array.from(this.participants.values()).map(p => ({
-      id: p.id,
-      name: p.name,
-      score: p.score,
-      status: p.status,
-    }));
-
-    this.p2p.broadcast({
-      type: MESSAGE_TYPES.SCORE_UPDATE,
-      payload: { scores },
-    });
-
-    if (this.onScoreUpdateCallback) {
-      this.onScoreUpdateCallback(scores);
-    }
-  }
+  _broadcastScoreUpdate() {}
 
   /**
killedBy: PartySession submitHostAnswer broadcasts score update
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ArrowFunction
src/services/party-session.js:582:63
    * @private
    */
   _broadcastScoreUpdate() {
-    const scores = Array.from(this.participants.values()).map(p => ({
-      id: p.id,
-      name: p.name,
-      score: p.score,
-      status: p.status,
-    }));
+    const scores = Array.from(this.participants.values()).map(() => undefined);
 
     this.p2p.broadcast({
killedBy: PartySession callbacks calls onScoreUpdate callback
statusReason: expected "vi.fn()" to be called with arguments: [ ArrayContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ArrayContaining [

[Survived] ObjectLiteral
src/services/party-session.js:591:16
 
     this.p2p.broadcast({
       type: MESSAGE_TYPES.SCORE_UPDATE,
-      payload: { scores },
+      payload: {},
     });
 

[Killed] ConditionalExpression
src/services/party-session.js:594:9
       payload: { scores },
     });
 
-    if (this.onScoreUpdateCallback) {
+    if (true) {
       this.onScoreUpdateCallback(scores);
     }
killedBy: PartySession submitHostAnswer records host answer and calculates score
statusReason: this.onScoreUpdateCallback is not a function

[Survived] BlockStatement
src/services/party-session.js:604:28
    *
    * @private
    */
-  _broadcastParticipants() {
-    const participants = Array.from(this.participants.values());
-
-    // Send updated session info to all peers
-    for (const [peerId] of this.p2p.peers || new Map()) {
-      this._sendSessionInfo(peerId);
-    }
-  }
+  _broadcastParticipants() {}
 
   /**

[Killed] ConditionalExpression
src/services/party-session.js:608:28
     const participants = Array.from(this.participants.values());
 
     // Send updated session info to all peers
-    for (const [peerId] of this.p2p.peers || new Map()) {
+    for (const [peerId] of true) {
       this._sendSessionInfo(peerId);
     }
killedBy: PartySession addParticipant (host) adds a new participant
statusReason: Map is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/services/party-session.js:608:28
     const participants = Array.from(this.participants.values());
 
     // Send updated session info to all peers
-    for (const [peerId] of this.p2p.peers || new Map()) {
+    for (const [peerId] of false) {
       this._sendSessionInfo(peerId);
     }
killedBy: PartySession addParticipant (host) adds a new participant
statusReason: Map is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/services/party-session.js:616:16
   /**
    * End the session.
    */
-  endSession() {
-    if (this.questionTimer) {
-      clearInterval(this.questionTimer);
-      this.questionTimer = null;
-    }
-
-    this.state = SESSION_STATES.ENDED;
-    this.p2p.destroy();
-    this._notifyStateChange();
-
-    log.info('Session ended');
-  }
+  endSession() {}
 
   // ============================================
killedBy: PartySession endSession ends the session and destroys P2P
statusReason: expected 'playing' to be 'ended' // Object.is equality

[Killed] BlockStatement
src/services/party-session.js:617:29
    * End the session.
    */
   endSession() {
-    if (this.questionTimer) {
-      clearInterval(this.questionTimer);
-      this.questionTimer = null;
-    }
+    if (this.questionTimer) {}
 
     this.state = SESSION_STATES.ENDED;
killedBy: PartySession endSession clears question timer
statusReason: expected { refed: true, …(4), …(1) } to be null

[Killed] BlockStatement
src/services/party-session.js:639:31
    * @param {string} roomCode - Room code
    * @param {string} name - Guest's display name
    */
-  joinSession(roomCode, name) {
-    if (this.isHost) {
-      throw new Error('Host cannot join as guest');
-    }
-
-    this.roomCode = roomCode;
-    this.participantName = name;
-
-    log.info('Joining session', { roomCode, name });
-  }
+  joinSession(roomCode, name) {}
 
   /**
killedBy: PartySession joinSession (guest) sets room code and name
statusReason: expected '' to be 'ABCD' // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:640:9
    * @param {string} name - Guest's display name
    */
   joinSession(roomCode, name) {
-    if (this.isHost) {
+    if (false) {
       throw new Error('Host cannot join as guest');
     }
killedBy: PartySession joinSession (guest) throws error if called by host
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/services/party-session.js:640:9
    * @param {string} name - Guest's display name
    */
   joinSession(roomCode, name) {
-    if (this.isHost) {
+    if (true) {
       throw new Error('Host cannot join as guest');
     }
killedBy: PartySession joinSession (guest) sets room code and name
statusReason: Host cannot join as guest

[Killed] ConditionalExpression
src/services/party-session.js:657:9
    * @param {Object} payload - Session info
    */
   _handleSessionInfo(payload) {
-    if (this.isHost) return;
+    if (false) return;
 
     const { quiz, roomCode, secondsPerQuestion, participants, state } = payload;
killedBy: PartySession message handling SESSION_INFO (guest receives) ignores if host
statusReason: participants is not iterable

[Killed] ConditionalExpression
src/services/party-session.js:657:9
    * @param {Object} payload - Session info
    */
   _handleSessionInfo(payload) {
-    if (this.isHost) return;
+    if (true) return;
 
     const { quiz, roomCode, secondsPerQuestion, participants, state } = payload;
killedBy: PartySession message handling SESSION_INFO (guest receives) updates guest with session info
statusReason: Cannot read properties of null (reading 'topic')

[Killed] BlockStatement
src/services/party-session.js:668:35
 
     // Update participants
     this.participants.clear();
-    for (const p of participants) {
-      this.participants.set(p.id, p);
-    }
+    for (const p of participants) {}
 
     // Add self if not in list
killedBy: PartySession message handling SESSION_INFO (guest receives) updates guest with session info
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/services/party-session.js:673:53
     }
 
     // Add self if not in list
-    if (!this.participants.has(this.participantId)) {
-      this.participants.set(this.participantId, {
-        id: this.participantId,
-        name: this.participantName,
-        isHost: false,
-        score: 0,
-        answers: [],
-        answerTimes: [],
-        status: 'connected',
-      });
-    }
+    if (!this.participants.has(this.participantId)) {}
 
     this._notifyStateChange();
killedBy: PartySession message handling SESSION_INFO (guest receives) updates guest with session info
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:673:9
     }
 
     // Add self if not in list
-    if (!this.participants.has(this.participantId)) {
+    if (false) {
       this.participants.set(this.participantId, {
         id: this.participantId,
killedBy: PartySession message handling SESSION_INFO (guest receives) updates guest with session info
statusReason: expected 1 to be 2 // Object.is equality

[Survived] BooleanLiteral
src/services/party-session.js:677:17
       this.participants.set(this.participantId, {
         id: this.participantId,
         name: this.participantName,
-        isHost: false,
+        isHost: true,
         score: 0,
         answers: [],

[Survived] OptionalChaining
src/services/party-session.js:688:47
     this._notifyStateChange();
     this._notifyParticipantsChange();
 
-    log.info('Session info received', { quiz: quiz?.topic, participants: participants.length });
+    log.info('Session info received', { quiz: quiz.topic, participants: participants.length });
   }
 

[Survived] ObjectLiteral
src/services/party-session.js:688:39
     this._notifyStateChange();
     this._notifyParticipantsChange();
 
-    log.info('Session info received', { quiz: quiz?.topic, participants: participants.length });
+    log.info('Session info received', {});
   }
 

[Killed] BlockStatement
src/services/party-session.js:697:29
    * @private
    * @param {Object} payload - Start info
    */
-  _handleQuizStart(payload) {
-    if (this.isHost) return;
-
-    this.startTime = payload.startTime;
-    this.state = SESSION_STATES.PLAYING;
-    this.currentQuestion = 0;
-
-    this._notifyStateChange();
-    this._startGuestQuestionTracker();
-
-    log.info('Quiz started (guest)', { startTime: this.startTime });
-  }
+  _handleQuizStart(payload) {}
 
   /**
killedBy: PartySession message handling QUIZ_START (guest receives) sets startTime and state
statusReason: expected +0 to be 1234567890 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:698:9
    * @param {Object} payload - Start info
    */
   _handleQuizStart(payload) {
-    if (this.isHost) return;
+    if (false) return;
 
     this.startTime = payload.startTime;
killedBy: PartySession edge cases _handleQuizStart for guest ignores if host
statusReason: expected 9999999 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:698:9
    * @param {Object} payload - Start info
    */
   _handleQuizStart(payload) {
-    if (this.isHost) return;
+    if (true) return;
 
     this.startTime = payload.startTime;
killedBy: PartySession message handling QUIZ_START (guest receives) sets startTime and state
statusReason: expected +0 to be 1234567890 // Object.is equality

[Survived] StringLiteral
src/services/party-session.js:707:14
     this._notifyStateChange();
     this._startGuestQuestionTracker();
 
-    log.info('Quiz started (guest)', { startTime: this.startTime });
+    log.info("", { startTime: this.startTime });
   }
 

[Survived] BlockStatement
src/services/party-session.js:715:32
    *
    * @private
    */
-  _startGuestQuestionTracker() {
-    if (this.questionTimer) {
-      clearInterval(this.questionTimer);
-    }
-
-    this.questionTimer = setInterval(() => {
-      const newQuestion = getCurrentQuestionIndex(
-        this.startTime,
-        this.secondsPerQuestion,
-        this.quiz.questions.length
-      );
-
-      if (newQuestion !== this.currentQuestion) {
-        this.currentQuestion = newQuestion;
-        this._notifyQuestionChange();
-      }
-    }, 100);
-  }
+  _startGuestQuestionTracker() {}
 
   /**

[NoCoverage] BlockStatement
src/services/party-session.js:716:29
    * @private
    */
   _startGuestQuestionTracker() {
-    if (this.questionTimer) {
-      clearInterval(this.questionTimer);
-    }
+    if (this.questionTimer) {}
 
     this.questionTimer = setInterval(() => {

[Survived] ConditionalExpression
src/services/party-session.js:716:9
    * @private
    */
   _startGuestQuestionTracker() {
-    if (this.questionTimer) {
+    if (true) {
       clearInterval(this.questionTimer);
     }

[NoCoverage] BlockStatement
src/services/party-session.js:720:44
       clearInterval(this.questionTimer);
     }
 
-    this.questionTimer = setInterval(() => {
-      const newQuestion = getCurrentQuestionIndex(
-        this.startTime,
-        this.secondsPerQuestion,
-        this.quiz.questions.length
-      );
-
-      if (newQuestion !== this.currentQuestion) {
-        this.currentQuestion = newQuestion;
-        this._notifyQuestionChange();
-      }
-    }, 100);
+    this.questionTimer = setInterval(() => {}, 100);
   }
 

[NoCoverage] ConditionalExpression
src/services/party-session.js:727:11
         this.quiz.questions.length
       );
 
-      if (newQuestion !== this.currentQuestion) {
+      if (false) {
         this.currentQuestion = newQuestion;
         this._notifyQuestionChange();

[NoCoverage] ConditionalExpression
src/services/party-session.js:727:11
         this.quiz.questions.length
       );
 
-      if (newQuestion !== this.currentQuestion) {
+      if (true) {
         this.currentQuestion = newQuestion;
         this._notifyQuestionChange();

[Killed] ConditionalExpression
src/services/party-session.js:741:9
    * @param {number} answerIndex - Selected answer index
    */
   submitAnswer(questionIndex, answerIndex) {
-    if (this.isHost) {
+    if (true) {
       this.submitHostAnswer(questionIndex, answerIndex);
       return;
killedBy: PartySession submitAnswer (guest) broadcasts answer to host
statusReason: expected "vi.fn()" to be called with arguments: [ { type: 'answer', …(1) } ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/party-session.js:741:9
    * @param {number} answerIndex - Selected answer index
    */
   submitAnswer(questionIndex, answerIndex) {
-    if (this.isHost) {
+    if (false) {
       this.submitHostAnswer(questionIndex, answerIndex);
       return;
killedBy: PartySession submitAnswer (guest) delegates to submitHostAnswer if called by host
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/services/party-session.js:758:22
 
     // Update local participant status
     const participant = this.participants.get(this.participantId);
-    if (participant) {
-      participant.answers[questionIndex] = answerIndex;
-      participant.status = 'answered';
-      this._notifyParticipantsChange();
-    }
+    if (participant) {}
 
     log.info('Answer submitted', { questionIndex, answerIndex });
killedBy: PartySession submitAnswer (guest) updates local participant status
statusReason: expected undefined to be 1 // Object.is equality

[Survived] ConditionalExpression
src/services/party-session.js:758:9
 
     // Update local participant status
     const participant = this.participants.get(this.participantId);
-    if (participant) {
+    if (true) {
       participant.answers[questionIndex] = answerIndex;
       participant.status = 'answered';
