[Killed] BlockStatement
src/services/party-session.js:773:31
    * @private
    * @param {Object} payload - Score update
    */
-  _handleScoreUpdate(payload) {
-    if (this.isHost) return;
-
-    const { scores } = payload;
-
-    for (const score of scores) {
-      const participant = this.participants.get(score.id);
-      if (participant) {
-        participant.score = score.score;
-        participant.status = score.status;
-      }
-    }
-
-    this._notifyParticipantsChange();
-    if (this.onScoreUpdateCallback) {
-      this.onScoreUpdateCallback(scores);
-    }
-  }
+  _handleScoreUpdate(payload) {}
 
   /**
killedBy: PartySession message handling SCORE_UPDATE (guest receives) updates participant scores
statusReason: expected +0 to be 15 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:774:9
    * @param {Object} payload - Score update
    */
   _handleScoreUpdate(payload) {
-    if (this.isHost) return;
+    if (false) return;
 
     const { scores } = payload;
killedBy: PartySession edge cases _handleScoreUpdate edge cases ignores if host
statusReason: expected 999 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:774:9
    * @param {Object} payload - Score update
    */
   _handleScoreUpdate(payload) {
-    if (this.isHost) return;
+    if (true) return;
 
     const { scores } = payload;
killedBy: PartySession message handling SCORE_UPDATE (guest receives) updates participant scores
statusReason: expected +0 to be 15 // Object.is equality

[Killed] BlockStatement
src/services/party-session.js:778:33
 
     const { scores } = payload;
 
-    for (const score of scores) {
-      const participant = this.participants.get(score.id);
-      if (participant) {
-        participant.score = score.score;
-        participant.status = score.status;
-      }
-    }
+    for (const score of scores) {}
 
     this._notifyParticipantsChange();
killedBy: PartySession message handling SCORE_UPDATE (guest receives) updates participant scores
statusReason: expected +0 to be 15 // Object.is equality

[Killed] BlockStatement
src/services/party-session.js:780:24
 
     for (const score of scores) {
       const participant = this.participants.get(score.id);
-      if (participant) {
-        participant.score = score.score;
-        participant.status = score.status;
-      }
+      if (participant) {}
     }
 
killedBy: PartySession message handling SCORE_UPDATE (guest receives) updates participant scores
statusReason: expected +0 to be 15 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:780:11
 
     for (const score of scores) {
       const participant = this.participants.get(score.id);
-      if (participant) {
+      if (true) {
         participant.score = score.score;
         participant.status = score.status;
killedBy: PartySession edge cases _handleScoreUpdate edge cases ignores scores for unknown participants
statusReason: Cannot set properties of undefined (setting 'score')

[Killed] ConditionalExpression
src/services/party-session.js:787:9
     }
 
     this._notifyParticipantsChange();
-    if (this.onScoreUpdateCallback) {
+    if (true) {
       this.onScoreUpdateCallback(scores);
     }
killedBy: PartySession message handling SCORE_UPDATE (guest receives) updates participant scores
statusReason: this.onScoreUpdateCallback is not a function

[NoCoverage] BlockStatement
src/services/party-session.js:787:37
     }
 
     this._notifyParticipantsChange();
-    if (this.onScoreUpdateCallback) {
-      this.onScoreUpdateCallback(scores);
-    }
+    if (this.onScoreUpdateCallback) {}
   }
 

[Killed] BlockStatement
src/services/party-session.js:798:27
    * @private
    * @param {Object} payload - End info
    */
-  _handleQuizEnd(payload) {
-    if (this.questionTimer) {
-      clearInterval(this.questionTimer);
-      this.questionTimer = null;
-    }
-
-    this.state = SESSION_STATES.FINISHED;
-    this._notifyStateChange();
-
-    if (this.onQuizEndCallback) {
-      this.onQuizEndCallback(payload.standings);
-    }
-
-    log.info('Quiz ended (guest)');
-  }
+  _handleQuizEnd(payload) {}
 
   /**
killedBy: PartySession message handling QUIZ_END (guest receives) sets state to finished and calls callback
statusReason: expected 'waiting' to be 'finished' // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:799:9
    * @param {Object} payload - End info
    */
   _handleQuizEnd(payload) {
-    if (this.questionTimer) {
+    if (false) {
       clearInterval(this.questionTimer);
       this.questionTimer = null;
killedBy: PartySession message handling QUIZ_END (guest receives) sets state to finished and calls callback
statusReason: expected { refed: true, …(4), …(1) } to be null

[Killed] BlockStatement
src/services/party-session.js:799:29
    * @param {Object} payload - End info
    */
   _handleQuizEnd(payload) {
-    if (this.questionTimer) {
-      clearInterval(this.questionTimer);
-      this.questionTimer = null;
-    }
+    if (this.questionTimer) {}
 
     this.state = SESSION_STATES.FINISHED;
killedBy: PartySession message handling QUIZ_END (guest receives) sets state to finished and calls callback
statusReason: expected { refed: true, …(4), …(1) } to be null

[Killed] ConditionalExpression
src/services/party-session.js:807:9
     this.state = SESSION_STATES.FINISHED;
     this._notifyStateChange();
 
-    if (this.onQuizEndCallback) {
+    if (false) {
       this.onQuizEndCallback(payload.standings);
     }
killedBy: PartySession message handling QUIZ_END (guest receives) sets state to finished and calls callback
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: 'host-1', …(2) } ] ]

Number of calls: 0

[Survived] ConditionalExpression
src/services/party-session.js:807:9
     this.state = SESSION_STATES.FINISHED;
     this._notifyStateChange();
 
-    if (this.onQuizEndCallback) {
+    if (true) {
       this.onQuizEndCallback(payload.standings);
     }

[Killed] BlockStatement
src/services/party-session.js:817:18
   /**
    * Leave the session (guest only).
    */
-  leaveSession() {
-    // Notify host
-    this.p2p.broadcast({
-      type: MESSAGE_TYPES.LEAVE,
-      payload: { participantId: this.participantId },
-    });
-
-    if (this.questionTimer) {
-      clearInterval(this.questionTimer);
-      this.questionTimer = null;
-    }
-
-    this.state = SESSION_STATES.ENDED;
-    this.p2p.destroy();
-
-    // Track telemetry
-    telemetry.track('party_room_left', {
-      roomCode: this.roomCode,
-      reason: 'user_left',
-    });
-
-    log.info('Left session');
-  }
+  leaveSession() {}
 
   /**
killedBy: PartySession leaveSession (guest) broadcasts leave message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ObjectLiteral
src/services/party-session.js:819:24
    */
   leaveSession() {
     // Notify host
-    this.p2p.broadcast({
-      type: MESSAGE_TYPES.LEAVE,
-      payload: { participantId: this.participantId },
-    });
+    this.p2p.broadcast({});
 
     if (this.questionTimer) {
killedBy: PartySession leaveSession (guest) broadcasts leave message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   {

[Killed] BlockStatement
src/services/party-session.js:824:29
       payload: { participantId: this.participantId },
     });
 
-    if (this.questionTimer) {
-      clearInterval(this.questionTimer);
-      this.questionTimer = null;
-    }
+    if (this.questionTimer) {}
 
     this.state = SESSION_STATES.ENDED;
killedBy: PartySession edge cases leaveSession edge cases clears questionTimer if running
statusReason: expected { refed: true, …(4), …(1) } to be null

[Killed] ConditionalExpression
src/services/party-session.js:824:9
       payload: { participantId: this.participantId },
     });
 
-    if (this.questionTimer) {
+    if (false) {
       clearInterval(this.questionTimer);
       this.questionTimer = null;
killedBy: PartySession edge cases leaveSession edge cases clears questionTimer if running
statusReason: expected { refed: true, …(4), …(1) } to be null

[Survived] StringLiteral
src/services/party-session.js:833:21
     this.p2p.destroy();
 
     // Track telemetry
-    telemetry.track('party_room_left', {
+    telemetry.track("", {
       roomCode: this.roomCode,
       reason: 'user_left',

[Survived] ObjectLiteral
src/services/party-session.js:833:40
     this.p2p.destroy();
 
     // Track telemetry
-    telemetry.track('party_room_left', {
-      roomCode: this.roomCode,
-      reason: 'user_left',
-    });
+    telemetry.track('party_room_left', {});
 
     log.info('Left session');

[Survived] ConditionalExpression
src/services/party-session.js:851:9
     this.participants.delete(peerId);
     this._notifyParticipantsChange();
 
-    if (this.isHost) {
+    if (false) {
       this._broadcastParticipants();
     }

[Survived] BlockStatement
src/services/party-session.js:851:22
     this.participants.delete(peerId);
     this._notifyParticipantsChange();
 
-    if (this.isHost) {
-      this._broadcastParticipants();
-    }
+    if (this.isHost) {}
 
     // Track telemetry

[Killed] BlockStatement
src/services/party-session.js:870:35
    * @private
    * @param {string} peerId - Disconnected peer
    */
-  _handlePeerDisconnected(peerId) {
-    const participant = this.participants.get(peerId);
-    if (participant) {
-      participant.status = 'disconnected';
-      this._notifyParticipantsChange();
-
-      // Track telemetry
-      telemetry.track('p2p_disconnected', {
-        roomCode: this.roomCode,
-        peerId,
-        reason: 'connection_lost',
-      });
-    }
-  }
+  _handlePeerDisconnected(peerId) {}
 
   // ============================================
killedBy: PartySession peer connection events marks participant as disconnected on peer disconnect
statusReason: expected 'connected' to be 'disconnected' // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:872:9
    */
   _handlePeerDisconnected(peerId) {
     const participant = this.participants.get(peerId);
-    if (participant) {
+    if (true) {
       participant.status = 'disconnected';
       this._notifyParticipantsChange();
killedBy: PartySession edge cases _handlePeerDisconnected edge cases does nothing if participant not found
statusReason: Cannot set properties of undefined (setting 'status')

[Killed] BlockStatement
src/services/party-session.js:872:22
    */
   _handlePeerDisconnected(peerId) {
     const participant = this.participants.get(peerId);
-    if (participant) {
-      participant.status = 'disconnected';
-      this._notifyParticipantsChange();
-
-      // Track telemetry
-      telemetry.track('p2p_disconnected', {
-        roomCode: this.roomCode,
-        peerId,
-        reason: 'connection_lost',
-      });
-    }
+    if (participant) {}
   }
 
killedBy: PartySession peer connection events marks participant as disconnected on peer disconnect
statusReason: expected 'connected' to be 'disconnected' // Object.is equality

[Killed] StringLiteral
src/services/party-session.js:873:28
   _handlePeerDisconnected(peerId) {
     const participant = this.participants.get(peerId);
     if (participant) {
-      participant.status = 'disconnected';
+      participant.status = "";
       this._notifyParticipantsChange();
 
killedBy: PartySession peer connection events marks participant as disconnected on peer disconnect
statusReason: expected '' to be 'disconnected' // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:895:9
    * @returns {Object|null} Current question or null
    */
   getCurrentQuestion() {
-    if (!this.quiz || this.currentQuestion < 0) return null;
+    if (true) return null;
     return this.quiz.questions[this.currentQuestion];
   }
killedBy: PartySession getCurrentQuestion returns current question
statusReason: expected null to be { question: 'Q1?', …(2) } // Object.is equality

[Killed] EqualityOperator
src/services/party-session.js:895:23
    * @returns {Object|null} Current question or null
    */
   getCurrentQuestion() {
-    if (!this.quiz || this.currentQuestion < 0) return null;
+    if (!this.quiz || this.currentQuestion >= 0) return null;
     return this.quiz.questions[this.currentQuestion];
   }
killedBy: PartySession getCurrentQuestion returns null if currentQuestion is -1
statusReason: expected undefined to be null

[Killed] BlockStatement
src/services/party-session.js:904:22
    *
    * @returns {number} Milliseconds remaining
    */
-  getTimeRemaining() {
-    return getTimeRemaining(this.startTime, this.secondsPerQuestion);
-  }
+  getTimeRemaining() {}
 
   /**
killedBy: PartySession edge cases getTimeRemaining method returns time from helper function
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
src/services/party-session.js:922:18
    *
    * @returns {Participant[]} Sorted participants
    */
-  getStandings() {
-    return Array.from(this.participants.values())
-      .sort((a, b) => b.score - a.score);
-  }
+  getStandings() {}
 
   /**
killedBy: PartySession getStandings returns participants sorted by score (highest first)
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArithmeticOperator
src/services/party-session.js:924:23
    */
   getStandings() {
     return Array.from(this.participants.values())
-      .sort((a, b) => b.score - a.score);
+      .sort((a, b) => b.score + a.score);
   }
 
killedBy: PartySession getStandings returns participants sorted by score (highest first)
statusReason: expected 'Host' to be 'Guest 1' // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:933:12
    * @returns {Participant|null}
    */
   getSelf() {
-    return this.participants.get(this.participantId) || null;
+    return false;
   }
 
killedBy: PartySession getSelf returns own participant data
statusReason: expected undefined to be 'My Name' // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:933:12
    * @returns {Participant|null}
    */
   getSelf() {
-    return this.participants.get(this.participantId) || null;
+    return true;
   }
 
killedBy: PartySession getSelf returns own participant data
statusReason: expected undefined to be 'My Name' // Object.is equality

[Killed] BlockStatement
src/services/party-session.js:945:27
    *
    * @param {Function} callback - Called with (state)
    */
-  onStateChange(callback) {
-    this.onStateChangeCallback = callback;
-  }
+  onStateChange(callback) {}
 
   /**
killedBy: PartySession callbacks calls onStateChange callback
statusReason: expected "vi.fn()" to be called with arguments: [ 'playing' ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-session.js:954:34
    *
    * @param {Function} callback - Called with (participants)
    */
-  onParticipantsChange(callback) {
-    this.onParticipantsChangeCallback = callback;
-  }
+  onParticipantsChange(callback) {}
 
   /**
killedBy: PartySession createSession (host) triggers participants change callback
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array> ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-session.js:963:30
    *
    * @param {Function} callback - Called with (questionIndex, question)
    */
-  onQuestionChange(callback) {
-    this.onQuestionChangeCallback = callback;
-  }
+  onQuestionChange(callback) {}
 
   /**
killedBy: PartySession callbacks calls onQuestionChange callback when question changes
statusReason: expected "vi.fn()" to be called with arguments: [ 1, { question: 'Q2?', …(2) } ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-session.js:972:27
    *
    * @param {Function} callback - Called with (scores)
    */
-  onScoreUpdate(callback) {
-    this.onScoreUpdateCallback = callback;
-  }
+  onScoreUpdate(callback) {}
 
   /**
killedBy: PartySession callbacks calls onScoreUpdate callback
statusReason: expected "vi.fn()" to be called with arguments: [ ArrayContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-session.js:981:23
    *
    * @param {Function} callback - Called with (standings)
    */
-  onQuizEnd(callback) {
-    this.onQuizEndCallback = callback;
-  }
+  onQuizEnd(callback) {}
 
   /**
killedBy: PartySession message handling QUIZ_END (guest receives) sets state to finished and calls callback
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: 'host-1', …(2) } ] ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-session.js:990:24
    *
    * @private
    */
-  _notifyStateChange() {
-    if (this.onStateChangeCallback) {
-      this.onStateChangeCallback(this.state);
-    }
-  }
+  _notifyStateChange() {}
 
   /**
killedBy: PartySession callbacks calls onStateChange callback
statusReason: expected "vi.fn()" to be called with arguments: [ 'playing' ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/party-session.js:991:9
    * @private
    */
   _notifyStateChange() {
-    if (this.onStateChangeCallback) {
+    if (true) {
       this.onStateChangeCallback(this.state);
     }
killedBy: PartySession startQuiz (host) starts the quiz
statusReason: this.onStateChangeCallback is not a function

[Killed] ConditionalExpression
src/services/party-session.js:991:9
    * @private
    */
   _notifyStateChange() {
-    if (this.onStateChangeCallback) {
+    if (false) {
       this.onStateChangeCallback(this.state);
     }
killedBy: PartySession callbacks calls onStateChange callback
statusReason: expected "vi.fn()" to be called with arguments: [ 'playing' ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-session.js:1001:31
    *
    * @private
    */
-  _notifyParticipantsChange() {
-    if (this.onParticipantsChangeCallback) {
-      this.onParticipantsChangeCallback(this.getParticipants());
-    }
-  }
+  _notifyParticipantsChange() {}
 
   /**
killedBy: PartySession createSession (host) triggers participants change callback
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array> ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/party-session.js:1002:9
    * @private
    */
   _notifyParticipantsChange() {
-    if (this.onParticipantsChangeCallback) {
+    if (true) {
       this.onParticipantsChangeCallback(this.getParticipants());
     }
killedBy: PartySession createSession (host) creates a session with quiz data
statusReason: this.onParticipantsChangeCallback is not a function

[Killed] ConditionalExpression
src/services/party-session.js:1002:9
    * @private
    */
   _notifyParticipantsChange() {
-    if (this.onParticipantsChangeCallback) {
+    if (false) {
       this.onParticipantsChangeCallback(this.getParticipants());
     }
killedBy: PartySession createSession (host) triggers participants change callback
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array> ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/party-session.js:1013:9
    * @private
    */
   _notifyQuestionChange() {
-    if (this.onQuestionChangeCallback) {
+    if (false) {
       this.onQuestionChangeCallback(this.currentQuestion, this.getCurrentQuestion());
     }
killedBy: PartySession callbacks calls onQuestionChange callback when question changes
statusReason: expected "vi.fn()" to be called with arguments: [ 1, { question: 'Q2?', …(2) } ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-session.js:1013:40
    * @private
    */
   _notifyQuestionChange() {
-    if (this.onQuestionChangeCallback) {
-      this.onQuestionChangeCallback(this.currentQuestion, this.getCurrentQuestion());
-    }
+    if (this.onQuestionChangeCallback) {}
   }
 
killedBy: PartySession callbacks calls onQuestionChange callback when question changes
statusReason: expected "vi.fn()" to be called with arguments: [ 1, { question: 'Q2?', …(2) } ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-session.js:1021:13
   /**
    * Clean up resources.
    */
-  destroy() {
-    if (this.questionTimer) {
-      clearInterval(this.questionTimer);
-      this.questionTimer = null;
-    }
-
-    this.onStateChangeCallback = null;
-    this.onParticipantsChangeCallback = null;
-    this.onQuestionChangeCallback = null;
-    this.onScoreUpdateCallback = null;
-    this.onQuizEndCallback = null;
-
-    log.info('PartySession destroyed');
-  }
+  destroy() {}
 }
 
killedBy: PartySession destroy cleans up resources
statusReason: expected { refed: true, …(4), …(1) } to be null

[Survived] ConditionalExpression
src/services/party-session.js:1022:9
    * Clean up resources.
    */
   destroy() {
-    if (this.questionTimer) {
+    if (true) {
       clearInterval(this.questionTimer);
       this.questionTimer = null;
