[Killed] StringLiteral
src/services/quiz-serializer.js:12:12
 
   // Short keys for smaller JSON payload
   const QUIZ_KEY_MAP = {
-    topic: 't',
+    topic: "",
     gradeLevel: 'g',
     creator: 'c',
killedBy: quiz-share generateShareUrl fails for quiz that is too large
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/services/quiz-serializer.js:15:11
     topic: 't',
     gradeLevel: 'g',
     creator: 'c',
-    mode: 'm',
+    mode: "",
     questions: 'q',
   };
killedBy: quiz-serializer roundtrip serialize then deserialize preserves data
statusReason: expected undefined to be 'party' // Object.is equality

[Killed] StringLiteral
src/services/quiz-serializer.js:16:16
     gradeLevel: 'g',
     creator: 'c',
     mode: 'm',
-    questions: 'q',
+    questions: "",
   };
 
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] StringLiteral
src/services/quiz-serializer.js:21:14
 
   const QUESTION_KEY_MAP = {
     question: 'q',
-    options: 'o',
+    options: "",
     correct: 'c',
     difficulty: 'd',
killedBy: quiz-share generateShareUrl fails for quiz that is too large
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/services/quiz-serializer.js:22:14
   const QUESTION_KEY_MAP = {
     question: 'q',
     options: 'o',
-    correct: 'c',
+    correct: "",
     difficulty: 'd',
   };
killedBy: quiz-serializer roundtrip preserves correct property from API-style quiz (issue #86)
statusReason: expected undefined to be +0 // Object.is equality

[Killed] StringLiteral
src/services/quiz-serializer.js:23:17
     question: 'q',
     options: 'o',
     correct: 'c',
-    difficulty: 'd',
+    difficulty: "",
   };
 
killedBy: quiz-serializer difficulty field handling preserves difficulty field in roundtrip
statusReason: expected undefined to be 'easy' // Object.is equality

[Survived] ArrowFunction
src/services/quiz-serializer.js:28:38
 
   // Reverse mappings for deserialization
   const QUIZ_KEY_REVERSE = Object.fromEntries(
-    Object.entries(QUIZ_KEY_MAP).map(([k, v]) => [v, k])
+    Object.entries(QUIZ_KEY_MAP).map(() => undefined)
   );
 

[Survived] ArrowFunction
src/services/quiz-serializer.js:32:42
   );
 
   const QUESTION_KEY_REVERSE = Object.fromEntries(
-    Object.entries(QUESTION_KEY_MAP).map(([k, v]) => [v, k])
+    Object.entries(QUESTION_KEY_MAP).map(() => undefined)
   );
 

[Killed] BlockStatement
src/services/quiz-serializer.js:43:30
    * @param {Object} quiz - Full quiz object
    * @returns {Object} Quiz with short keys
    */
-  function toShortKeys(quiz) {
-    const short = {};
-
-    // Map quiz-level fields
-    if (quiz.topic) short[QUIZ_KEY_MAP.topic] = quiz.topic;
-    if (quiz.gradeLevel) short[QUIZ_KEY_MAP.gradeLevel] = quiz.gradeLevel;
-    if (quiz.creator) short[QUIZ_KEY_MAP.creator] = quiz.creator;
-    if (quiz.mode) short[QUIZ_KEY_MAP.mode] = quiz.mode;
-
-    // Map questions array
-    if (quiz.questions) {
-      short[QUIZ_KEY_MAP.questions] = quiz.questions.map(q => {
-        const shortQ = {};
-        shortQ[QUESTION_KEY_MAP.question] = q.question;
-        shortQ[QUESTION_KEY_MAP.options] = q.options;
-        shortQ[QUESTION_KEY_MAP.correct] = q.correct;
-        if (q.difficulty) shortQ[QUESTION_KEY_MAP.difficulty] = q.difficulty;
-        // Note: explanations are intentionally excluded to keep URLs short
-        return shortQ;
-      });
-    }
-
-    return short;
-  }
+  function toShortKeys(quiz) {}
 
   /**
killedBy: quiz-share generateShareUrl fails for quiz that is too large
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/services/quiz-serializer.js:47:9
     const short = {};
 
     // Map quiz-level fields
-    if (quiz.topic) short[QUIZ_KEY_MAP.topic] = quiz.topic;
+    if (false) short[QUIZ_KEY_MAP.topic] = quiz.topic;
     if (quiz.gradeLevel) short[QUIZ_KEY_MAP.gradeLevel] = quiz.gradeLevel;
     if (quiz.creator) short[QUIZ_KEY_MAP.creator] = quiz.creator;
killedBy: quiz-import importQuizFromUrl successfully imports valid encoded data
statusReason: expected undefined to be 'History' // Object.is equality

[Survived] ConditionalExpression
src/services/quiz-serializer.js:47:9
     const short = {};
 
     // Map quiz-level fields
-    if (quiz.topic) short[QUIZ_KEY_MAP.topic] = quiz.topic;
+    if (true) short[QUIZ_KEY_MAP.topic] = quiz.topic;
     if (quiz.gradeLevel) short[QUIZ_KEY_MAP.gradeLevel] = quiz.gradeLevel;
     if (quiz.creator) short[QUIZ_KEY_MAP.creator] = quiz.creator;

[Killed] ConditionalExpression
src/services/quiz-serializer.js:48:9
 
     // Map quiz-level fields
     if (quiz.topic) short[QUIZ_KEY_MAP.topic] = quiz.topic;
-    if (quiz.gradeLevel) short[QUIZ_KEY_MAP.gradeLevel] = quiz.gradeLevel;
+    if (false) short[QUIZ_KEY_MAP.gradeLevel] = quiz.gradeLevel;
     if (quiz.creator) short[QUIZ_KEY_MAP.creator] = quiz.creator;
     if (quiz.mode) short[QUIZ_KEY_MAP.mode] = quiz.mode;
killedBy: quiz-serializer deserializeQuiz recovers original quiz data
statusReason: expected undefined to be 'middle school' // Object.is equality

[Survived] ConditionalExpression
src/services/quiz-serializer.js:48:9
 
     // Map quiz-level fields
     if (quiz.topic) short[QUIZ_KEY_MAP.topic] = quiz.topic;
-    if (quiz.gradeLevel) short[QUIZ_KEY_MAP.gradeLevel] = quiz.gradeLevel;
+    if (true) short[QUIZ_KEY_MAP.gradeLevel] = quiz.gradeLevel;
     if (quiz.creator) short[QUIZ_KEY_MAP.creator] = quiz.creator;
     if (quiz.mode) short[QUIZ_KEY_MAP.mode] = quiz.mode;

[Killed] ConditionalExpression
src/services/quiz-serializer.js:49:9
     // Map quiz-level fields
     if (quiz.topic) short[QUIZ_KEY_MAP.topic] = quiz.topic;
     if (quiz.gradeLevel) short[QUIZ_KEY_MAP.gradeLevel] = quiz.gradeLevel;
-    if (quiz.creator) short[QUIZ_KEY_MAP.creator] = quiz.creator;
+    if (false) short[QUIZ_KEY_MAP.creator] = quiz.creator;
     if (quiz.mode) short[QUIZ_KEY_MAP.mode] = quiz.mode;
 
killedBy: quiz-serializer roundtrip serialize then deserialize preserves data
statusReason: expected undefined to be 'João' // Object.is equality

[Survived] ConditionalExpression
src/services/quiz-serializer.js:49:9
     // Map quiz-level fields
     if (quiz.topic) short[QUIZ_KEY_MAP.topic] = quiz.topic;
     if (quiz.gradeLevel) short[QUIZ_KEY_MAP.gradeLevel] = quiz.gradeLevel;
-    if (quiz.creator) short[QUIZ_KEY_MAP.creator] = quiz.creator;
+    if (true) short[QUIZ_KEY_MAP.creator] = quiz.creator;
     if (quiz.mode) short[QUIZ_KEY_MAP.mode] = quiz.mode;
 

[Killed] ConditionalExpression
src/services/quiz-serializer.js:50:9
     if (quiz.topic) short[QUIZ_KEY_MAP.topic] = quiz.topic;
     if (quiz.gradeLevel) short[QUIZ_KEY_MAP.gradeLevel] = quiz.gradeLevel;
     if (quiz.creator) short[QUIZ_KEY_MAP.creator] = quiz.creator;
-    if (quiz.mode) short[QUIZ_KEY_MAP.mode] = quiz.mode;
+    if (false) short[QUIZ_KEY_MAP.mode] = quiz.mode;
 
     // Map questions array
killedBy: quiz-serializer roundtrip serialize then deserialize preserves data
statusReason: expected undefined to be 'party' // Object.is equality

[Survived] ConditionalExpression
src/services/quiz-serializer.js:50:9
     if (quiz.topic) short[QUIZ_KEY_MAP.topic] = quiz.topic;
     if (quiz.gradeLevel) short[QUIZ_KEY_MAP.gradeLevel] = quiz.gradeLevel;
     if (quiz.creator) short[QUIZ_KEY_MAP.creator] = quiz.creator;
-    if (quiz.mode) short[QUIZ_KEY_MAP.mode] = quiz.mode;
+    if (true) short[QUIZ_KEY_MAP.mode] = quiz.mode;
 
     // Map questions array

[Killed] ConditionalExpression
src/services/quiz-serializer.js:53:9
     if (quiz.mode) short[QUIZ_KEY_MAP.mode] = quiz.mode;
 
     // Map questions array
-    if (quiz.questions) {
+    if (false) {
       short[QUIZ_KEY_MAP.questions] = quiz.questions.map(q => {
         const shortQ = {};
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] BlockStatement
src/services/quiz-serializer.js:53:25
     if (quiz.mode) short[QUIZ_KEY_MAP.mode] = quiz.mode;
 
     // Map questions array
-    if (quiz.questions) {
-      short[QUIZ_KEY_MAP.questions] = quiz.questions.map(q => {
-        const shortQ = {};
-        shortQ[QUESTION_KEY_MAP.question] = q.question;
-        shortQ[QUESTION_KEY_MAP.options] = q.options;
-        shortQ[QUESTION_KEY_MAP.correct] = q.correct;
-        if (q.difficulty) shortQ[QUESTION_KEY_MAP.difficulty] = q.difficulty;
-        // Note: explanations are intentionally excluded to keep URLs short
-        return shortQ;
-      });
-    }
+    if (quiz.questions) {}
 
     return short;
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] BlockStatement
src/services/quiz-serializer.js:54:63
 
     // Map questions array
     if (quiz.questions) {
-      short[QUIZ_KEY_MAP.questions] = quiz.questions.map(q => {
-        const shortQ = {};
-        shortQ[QUESTION_KEY_MAP.question] = q.question;
-        shortQ[QUESTION_KEY_MAP.options] = q.options;
-        shortQ[QUESTION_KEY_MAP.correct] = q.correct;
-        if (q.difficulty) shortQ[QUESTION_KEY_MAP.difficulty] = q.difficulty;
-        // Note: explanations are intentionally excluded to keep URLs short
-        return shortQ;
-      });
+      short[QUIZ_KEY_MAP.questions] = quiz.questions.map(q => {});
     }
 
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] ConditionalExpression
src/services/quiz-serializer.js:59:13
         shortQ[QUESTION_KEY_MAP.question] = q.question;
         shortQ[QUESTION_KEY_MAP.options] = q.options;
         shortQ[QUESTION_KEY_MAP.correct] = q.correct;
-        if (q.difficulty) shortQ[QUESTION_KEY_MAP.difficulty] = q.difficulty;
+        if (false) shortQ[QUESTION_KEY_MAP.difficulty] = q.difficulty;
         // Note: explanations are intentionally excluded to keep URLs short
         return shortQ;
killedBy: quiz-serializer difficulty field handling preserves difficulty field in roundtrip
statusReason: expected undefined to be 'easy' // Object.is equality

[Survived] ConditionalExpression
src/services/quiz-serializer.js:59:13
         shortQ[QUESTION_KEY_MAP.question] = q.question;
         shortQ[QUESTION_KEY_MAP.options] = q.options;
         shortQ[QUESTION_KEY_MAP.correct] = q.correct;
-        if (q.difficulty) shortQ[QUESTION_KEY_MAP.difficulty] = q.difficulty;
+        if (true) shortQ[QUESTION_KEY_MAP.difficulty] = q.difficulty;
         // Note: explanations are intentionally excluded to keep URLs short
         return shortQ;

[Killed] BlockStatement
src/services/quiz-serializer.js:73:30
    * @param {Object} short - Quiz with short keys
    * @returns {Object} Quiz with full keys
    */
-  function toFullKeys(short) {
-    const quiz = {};
-
-    // Map quiz-level fields
-    if (short.t) quiz.topic = short.t;
-    if (short.g) quiz.gradeLevel = short.g;
-    if (short.c) quiz.creator = short.c;
-    if (short.m) quiz.mode = short.m;
-
-    // Map questions array
-    if (short.q) {
-      quiz.questions = short.q.map(sq => {
-        const question = {
-          question: sq.q,
-          options: sq.o,
-          correct: sq.c,
-        };
-        if (sq.d) question.difficulty = sq.d;
-        return question;
-      });
-    }
-
-    return quiz;
-  }  
+  function toFullKeys(short) {}  
 
   /**
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[Survived] ConditionalExpression
src/services/quiz-serializer.js:77:9
     const quiz = {};
 
     // Map quiz-level fields
-    if (short.t) quiz.topic = short.t;
+    if (true) quiz.topic = short.t;
     if (short.g) quiz.gradeLevel = short.g;
     if (short.c) quiz.creator = short.c;

[Killed] ConditionalExpression
src/services/quiz-serializer.js:78:9
 
     // Map quiz-level fields
     if (short.t) quiz.topic = short.t;
-    if (short.g) quiz.gradeLevel = short.g;
+    if (false) quiz.gradeLevel = short.g;
     if (short.c) quiz.creator = short.c;
     if (short.m) quiz.mode = short.m;
killedBy: quiz-serializer deserializeQuiz recovers original quiz data
statusReason: expected undefined to be 'middle school' // Object.is equality

[Survived] ConditionalExpression
src/services/quiz-serializer.js:78:9
 
     // Map quiz-level fields
     if (short.t) quiz.topic = short.t;
-    if (short.g) quiz.gradeLevel = short.g;
+    if (true) quiz.gradeLevel = short.g;
     if (short.c) quiz.creator = short.c;
     if (short.m) quiz.mode = short.m;

[Killed] ConditionalExpression
src/services/quiz-serializer.js:79:9
     // Map quiz-level fields
     if (short.t) quiz.topic = short.t;
     if (short.g) quiz.gradeLevel = short.g;
-    if (short.c) quiz.creator = short.c;
+    if (false) quiz.creator = short.c;
     if (short.m) quiz.mode = short.m;
 
killedBy: quiz-serializer roundtrip serialize then deserialize preserves data
statusReason: expected undefined to be 'João' // Object.is equality

[Survived] ConditionalExpression
src/services/quiz-serializer.js:79:9
     // Map quiz-level fields
     if (short.t) quiz.topic = short.t;
     if (short.g) quiz.gradeLevel = short.g;
-    if (short.c) quiz.creator = short.c;
+    if (true) quiz.creator = short.c;
     if (short.m) quiz.mode = short.m;
 

[Killed] ConditionalExpression
src/services/quiz-serializer.js:80:9
     if (short.t) quiz.topic = short.t;
     if (short.g) quiz.gradeLevel = short.g;
     if (short.c) quiz.creator = short.c;
-    if (short.m) quiz.mode = short.m;
+    if (false) quiz.mode = short.m;
 
     // Map questions array
killedBy: quiz-serializer roundtrip serialize then deserialize preserves data
statusReason: expected undefined to be 'party' // Object.is equality

[Survived] ConditionalExpression
src/services/quiz-serializer.js:80:9
     if (short.t) quiz.topic = short.t;
     if (short.g) quiz.gradeLevel = short.g;
     if (short.c) quiz.creator = short.c;
-    if (short.m) quiz.mode = short.m;
+    if (true) quiz.mode = short.m;
 
     // Map questions array

[Killed] BlockStatement
src/services/quiz-serializer.js:83:18
     if (short.m) quiz.mode = short.m;
 
     // Map questions array
-    if (short.q) {
-      quiz.questions = short.q.map(sq => {
-        const question = {
-          question: sq.q,
-          options: sq.o,
-          correct: sq.c,
-        };
-        if (sq.d) question.difficulty = sq.d;
-        return question;
-      });
-    }
+    if (short.q) {}
 
     return quiz;
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] ConditionalExpression
src/services/quiz-serializer.js:83:9
     if (short.m) quiz.mode = short.m;
 
     // Map questions array
-    if (short.q) {
+    if (false) {
       quiz.questions = short.q.map(sq => {
         const question = {
killedBy: quiz-import importQuizFromUrl successfully imports valid encoded data
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/services/quiz-serializer.js:84:42
 
     // Map questions array
     if (short.q) {
-      quiz.questions = short.q.map(sq => {
-        const question = {
-          question: sq.q,
-          options: sq.o,
-          correct: sq.c,
-        };
-        if (sq.d) question.difficulty = sq.d;
-        return question;
-      });
+      quiz.questions = short.q.map(sq => {});
     }
 
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'explanation')

[Killed] ObjectLiteral
src/services/quiz-serializer.js:85:26
     // Map questions array
     if (short.q) {
       quiz.questions = short.q.map(sq => {
-        const question = {
-          question: sq.q,
-          options: sq.o,
-          correct: sq.c,
-        };
+        const question = {};
         if (sq.d) question.difficulty = sq.d;
         return question;
killedBy: quiz-serializer deserializeQuiz recovers original quiz data
statusReason: expected undefined to be 'Question 1?' // Object.is equality

[Killed] ConditionalExpression
src/services/quiz-serializer.js:90:13
           options: sq.o,
           correct: sq.c,
         };
-        if (sq.d) question.difficulty = sq.d;
+        if (false) question.difficulty = sq.d;
         return question;
       });
killedBy: quiz-serializer difficulty field handling preserves difficulty field in roundtrip
statusReason: expected undefined to be 'easy' // Object.is equality

[Survived] ConditionalExpression
src/services/quiz-serializer.js:90:13
           options: sq.o,
           correct: sq.c,
         };
-        if (sq.d) question.difficulty = sq.d;
+        if (true) question.difficulty = sq.d;
         return question;
       });

[Killed] BlockStatement
src/services/quiz-serializer.js:119:68
   export function serializeQuiz(quiz) {
     try {
       // Validate input
-      if (!quiz || !quiz.questions || quiz.questions.length === 0) {
-        return { success: false, error: 'Quiz must have at least one question' };
-      }
+      if (!quiz || !quiz.questions || quiz.questions.length === 0) {}
 
       // Convert to short keys (also strips explanations)
killedBy: quiz-serializer serializeQuiz rejects empty quiz
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/services/quiz-serializer.js:119:11
   export function serializeQuiz(quiz) {
     try {
       // Validate input
-      if (!quiz || !quiz.questions || quiz.questions.length === 0) {
+      if (false) {
         return { success: false, error: 'Quiz must have at least one question' };
       }
killedBy: quiz-serializer serializeQuiz rejects empty quiz
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/services/quiz-serializer.js:120:16
     try {
       // Validate input
       if (!quiz || !quiz.questions || quiz.questions.length === 0) {
-        return { success: false, error: 'Quiz must have at least one question' };
+        return {};
       }
 
killedBy: quiz-serializer serializeQuiz rejects empty quiz
statusReason: expected undefined to be false // Object.is equality

[Killed] StringLiteral
src/services/quiz-serializer.js:131:25
 
       // Compress and make truly URL-safe (replace + with -)
       const compressed = LZString.compressToEncodedURIComponent(json)
-        .replace(/\+/g, '_');
+        .replace(/\+/g, "");
 
       // Check length
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] ConditionalExpression
src/services/quiz-serializer.js:134:11
         .replace(/\+/g, '_');
 
       // Check length
-      if (compressed.length > MAX_URL_LENGTH) {
+      if (true) {
         return {
           success: false,
killedBy: quiz-serializer serializeQuiz produces valid encoded string for a valid quiz
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/quiz-serializer.js:134:11
         .replace(/\+/g, '_');
 
       // Check length
-      if (compressed.length > MAX_URL_LENGTH) {
+      if (false) {
         return {
           success: false,
killedBy: quiz-serializer rejects quiz exceeding max URL length
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/services/quiz-serializer.js:137:18
       if (compressed.length > MAX_URL_LENGTH) {
         return {
           success: false,
-          error: 'Quiz too large to share',
+          error: "",
           length: compressed.length,
         };
killedBy: quiz-serializer rejects quiz exceeding max URL length
statusReason: expected '' to contain 'too large'

[Killed] ObjectLiteral
src/services/quiz-serializer.js:142:14
         };
       }
 
-      return {
-        success: true,
-        data: compressed,
-        length: compressed.length,
-      };
+      return {};
     } catch (err) {
       return { success: false, error: err.message };
killedBy: quiz-serializer serializeQuiz produces valid encoded string for a valid quiz
statusReason: expected undefined to be true // Object.is equality

[NoCoverage] BlockStatement
src/services/quiz-serializer.js:147:19
         data: compressed,
         length: compressed.length,
       };
-    } catch (err) {
-      return { success: false, error: err.message };
-    }
+    } catch (err) {}
   }
 

[NoCoverage] BooleanLiteral
src/services/quiz-serializer.js:148:25
         length: compressed.length,
       };
     } catch (err) {
-      return { success: false, error: err.message };
+      return { success: true, error: err.message };
     }
   }

[NoCoverage] ObjectLiteral
src/services/quiz-serializer.js:148:14
         length: compressed.length,
       };
     } catch (err) {
-      return { success: false, error: err.message };
+      return {};
     }
   }

[Killed] ConditionalExpression
src/services/quiz-serializer.js:167:11
   export function deserializeQuiz(encoded) {
     try {
       // Validate input
-      if (!encoded || typeof encoded !== 'string') {
+      if (true) {
         return { success: false, error: 'Invalid encoded data' };
       }
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] BooleanLiteral
src/services/quiz-serializer.js:167:11
   export function deserializeQuiz(encoded) {
     try {
       // Validate input
-      if (!encoded || typeof encoded !== 'string') {
+      if (encoded || typeof encoded !== 'string') {
         return { success: false, error: 'Invalid encoded data' };
       }
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] BooleanLiteral
src/services/quiz-serializer.js:168:27
     try {
       // Validate input
       if (!encoded || typeof encoded !== 'string') {
-        return { success: false, error: 'Invalid encoded data' };
+        return { success: true, error: 'Invalid encoded data' };
       }
 
killedBy: quiz-serializer deserializeQuiz rejects empty string
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/services/quiz-serializer.js:168:16
     try {
       // Validate input
       if (!encoded || typeof encoded !== 'string') {
-        return { success: false, error: 'Invalid encoded data' };
+        return {};
       }
 
killedBy: quiz-serializer deserializeQuiz rejects empty string
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/services/quiz-serializer.js:174:11
       // Restore + before decompressing (we replaced with - for URL safety)
       const safeEncoded = encoded.replace(/_/g, '+');
       const json = LZString.decompressFromEncodedURIComponent(safeEncoded);
-      if (!json) {
+      if (true) {
         return { success: false, error: 'Decompression failed' };
       }
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] BooleanLiteral
src/services/quiz-serializer.js:174:11
       // Restore + before decompressing (we replaced with - for URL safety)
       const safeEncoded = encoded.replace(/_/g, '+');
       const json = LZString.decompressFromEncodedURIComponent(safeEncoded);
-      if (!json) {
+      if (json) {
         return { success: false, error: 'Decompression failed' };
       }
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] BooleanLiteral
src/services/quiz-serializer.js:175:27
       const safeEncoded = encoded.replace(/_/g, '+');
       const json = LZString.decompressFromEncodedURIComponent(safeEncoded);
       if (!json) {
-        return { success: false, error: 'Decompression failed' };
+        return { success: true, error: 'Decompression failed' };
       }
 
killedBy: quiz-serializer deserializeQuiz rejects invalid encoded data
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/services/quiz-serializer.js:175:16
       const safeEncoded = encoded.replace(/_/g, '+');
       const json = LZString.decompressFromEncodedURIComponent(safeEncoded);
       if (!json) {
-        return { success: false, error: 'Decompression failed' };
+        return {};
       }
 
killedBy: quiz-import importQuizFromUrl fails for invalid encoded data
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/services/quiz-serializer.js:185:30
       const quiz = toFullKeys(shortQuiz);
 
       // Basic validation
-      if (!quiz.questions || quiz.questions.length === 0) {
+      if (!quiz.questions || quiz.questions.length !== 0) {
         return { success: false, error: 'Quiz has no questions' };
       }
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] ConditionalExpression
src/services/quiz-serializer.js:185:11
       const quiz = toFullKeys(shortQuiz);
 
       // Basic validation
-      if (!quiz.questions || quiz.questions.length === 0) {
+      if (true) {
         return { success: false, error: 'Quiz has no questions' };
       }
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[NoCoverage] BooleanLiteral
src/services/quiz-serializer.js:186:27
 
       // Basic validation
       if (!quiz.questions || quiz.questions.length === 0) {
-        return { success: false, error: 'Quiz has no questions' };
+        return { success: true, error: 'Quiz has no questions' };
       }
 

[NoCoverage] StringLiteral
src/services/quiz-serializer.js:186:41
 
       // Basic validation
       if (!quiz.questions || quiz.questions.length === 0) {
-        return { success: false, error: 'Quiz has no questions' };
+        return { success: false, error: "" };
       }
 

[Killed] BooleanLiteral
src/services/quiz-serializer.js:189:25
         return { success: false, error: 'Quiz has no questions' };
       }
 
-      return { success: true, quiz };
+      return { success: false, quiz };
     } catch (err) {
       return { success: false, error: err.message };
killedBy: quiz-serializer serializeQuiz handles quiz with only required fields (no optional fields)
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/services/quiz-serializer.js:190:19
       }
 
       return { success: true, quiz };
-    } catch (err) {
-      return { success: false, error: err.message };
-    }
+    } catch (err) {}
   }  
 

[Killed] BlockStatement
src/services/quiz-serializer.js:202:38
    * @param {Object} quiz - The quiz to check
    * @returns {{canShare: boolean, estimatedLength: number, maxLength: number}}
    */
-  export function canShareQuiz(quiz) {
-    if (!quiz || !quiz.questions) {
-      return { canShare: false, estimatedLength: 0, maxLength: MAX_URL_LENGTH };
-    }
-
-    const result = serializeQuiz(quiz);
-
-    return {
-      canShare: result.success,
-      estimatedLength: result.length || 0,
-      maxLength: MAX_URL_LENGTH,
-    };
-  }
+  export function canShareQuiz(quiz) {}
 
   /**
killedBy: quiz-serializer canShareQuiz returns true for small quiz
statusReason: Cannot read properties of undefined (reading 'canShare')

[Killed] BooleanLiteral
src/services/quiz-serializer.js:203:9
    * @returns {{canShare: boolean, estimatedLength: number, maxLength: number}}
    */
   export function canShareQuiz(quiz) {
-    if (!quiz || !quiz.questions) {
+    if (quiz || !quiz.questions) {
       return { canShare: false, estimatedLength: 0, maxLength: MAX_URL_LENGTH };
     }
killedBy: quiz-serializer canShareQuiz returns true for small quiz
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/services/quiz-serializer.js:203:18
    * @returns {{canShare: boolean, estimatedLength: number, maxLength: number}}
    */
   export function canShareQuiz(quiz) {
-    if (!quiz || !quiz.questions) {
+    if (!quiz || quiz.questions) {
       return { canShare: false, estimatedLength: 0, maxLength: MAX_URL_LENGTH };
     }
killedBy: quiz-serializer canShareQuiz returns true for small quiz
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/services/quiz-serializer.js:204:26
    */
   export function canShareQuiz(quiz) {
     if (!quiz || !quiz.questions) {
-      return { canShare: false, estimatedLength: 0, maxLength: MAX_URL_LENGTH };
+      return { canShare: true, estimatedLength: 0, maxLength: MAX_URL_LENGTH };
     }
 
killedBy: quiz-serializer canShareQuiz returns false for null quiz
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/services/quiz-serializer.js:209:12
 
     const result = serializeQuiz(quiz);
 
-    return {
-      canShare: result.success,
-      estimatedLength: result.length || 0,
-      maxLength: MAX_URL_LENGTH,
-    };
+    return {};
   }
 
killedBy: quiz-serializer canShareQuiz returns true for small quiz
statusReason: expected undefined to be true // Object.is equality
