[Killed] ConditionalExpression
src/services/quiz-serializer.js:211:24
 
     return {
       canShare: result.success,
-      estimatedLength: result.length || 0,
+      estimatedLength: false,
       maxLength: MAX_URL_LENGTH,
     };
killedBy: quiz-serializer canShareQuiz returns true for small quiz
statusReason: actual value must be number or bigint, received "boolean"

[Killed] LogicalOperator
src/services/quiz-serializer.js:211:24
 
     return {
       canShare: result.success,
-      estimatedLength: result.length || 0,
+      estimatedLength: result.length && 0,
       maxLength: MAX_URL_LENGTH,
     };
killedBy: quiz-serializer canShareQuiz returns true for small quiz
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/services/quiz-serializer.js:221:46
    * Based on typical question sizes.
    * @returns {number}
    */
-  export function getMaxShareableQuestions() {
-    return 10; // Conservative estimate based on ~200 chars per question
-  }  
+  export function getMaxShareableQuestions() {}  
killedBy: quiz-serializer getMaxShareableQuestions returns a reasonable number
statusReason: actual value must be number or bigint, received "undefined"
