[Killed] BooleanLiteral
src/services/signaling-client.js:49:22
     this.pollInterval = null;
 
     /** @type {boolean} */
-    this.isPolling = false;
+    this.isPolling = true;
 
     /** @type {Function|null} */
killedBy: SignalingClient polling should start polling and call callback with messages
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 1, fromId: 'user-2', …(2) } ]

Number of calls: 0

[Killed] BlockStatement
src/services/signaling-client.js:73:36
    * @param {RTCSessionDescriptionInit} offer - SDP offer
    * @returns {Promise<void>}
    */
-  async sendOffer(toPeerId, offer) {
-    await this._sendMessage(toPeerId, 'offer', { sdp: offer.sdp, type: offer.type });
-    log.debug('Sent offer', { to: toPeerId });
-  }
+  async sendOffer(toPeerId, offer) {}
 
   /**
killedBy: SignalingClient sendOffer should send offer to correct endpoint
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] StringLiteral
src/services/signaling-client.js:74:39
    * @returns {Promise<void>}
    */
   async sendOffer(toPeerId, offer) {
-    await this._sendMessage(toPeerId, 'offer', { sdp: offer.sdp, type: offer.type });
+    await this._sendMessage(toPeerId, "", { sdp: offer.sdp, type: offer.type });
     log.debug('Sent offer', { to: toPeerId });
   }
killedBy: SignalingClient sendOffer should send offer to correct endpoint
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Survived] StringLiteral
src/services/signaling-client.js:75:15
    */
   async sendOffer(toPeerId, offer) {
     await this._sendMessage(toPeerId, 'offer', { sdp: offer.sdp, type: offer.type });
-    log.debug('Sent offer', { to: toPeerId });
+    log.debug("", { to: toPeerId });
   }
 

[Killed] BlockStatement
src/services/signaling-client.js:85:38
    * @param {RTCSessionDescriptionInit} answer - SDP answer
    * @returns {Promise<void>}
    */
-  async sendAnswer(toPeerId, answer) {
-    await this._sendMessage(toPeerId, 'answer', { sdp: answer.sdp, type: answer.type });
-    log.debug('Sent answer', { to: toPeerId });
-  }
+  async sendAnswer(toPeerId, answer) {}
 
   /**
killedBy: SignalingClient sendAnswer should send answer to correct endpoint
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Survived] StringLiteral
src/services/signaling-client.js:86:39
    * @returns {Promise<void>}
    */
   async sendAnswer(toPeerId, answer) {
-    await this._sendMessage(toPeerId, 'answer', { sdp: answer.sdp, type: answer.type });
+    await this._sendMessage(toPeerId, "", { sdp: answer.sdp, type: answer.type });
     log.debug('Sent answer', { to: toPeerId });
   }

[Survived] StringLiteral
src/services/signaling-client.js:87:15
    */
   async sendAnswer(toPeerId, answer) {
     await this._sendMessage(toPeerId, 'answer', { sdp: answer.sdp, type: answer.type });
-    log.debug('Sent answer', { to: toPeerId });
+    log.debug("", { to: toPeerId });
   }
 

[Killed] BlockStatement
src/services/signaling-client.js:97:47
    * @param {RTCIceCandidate} candidate - ICE candidate
    * @returns {Promise<void>}
    */
-  async sendIceCandidate(toPeerId, candidate) {
-    await this._sendMessage(toPeerId, 'ice', {
-      candidate: candidate.candidate,
-      sdpMid: candidate.sdpMid,
-      sdpMLineIndex: candidate.sdpMLineIndex,
-    });
-    log.debug('Sent ICE candidate', { to: toPeerId });
-  }
+  async sendIceCandidate(toPeerId, candidate) {}
 
   /**
killedBy: SignalingClient sendIceCandidate should send ICE candidate with correct payload
statusReason: Cannot read properties of undefined (reading '1')

[Killed] StringLiteral
src/services/signaling-client.js:98:39
    * @returns {Promise<void>}
    */
   async sendIceCandidate(toPeerId, candidate) {
-    await this._sendMessage(toPeerId, 'ice', {
+    await this._sendMessage(toPeerId, "", {
       candidate: candidate.candidate,
       sdpMid: candidate.sdpMid,
killedBy: SignalingClient sendIceCandidate should send ICE candidate with correct payload
statusReason: expected '' to be 'ice' // Object.is equality

[Survived] StringLiteral
src/services/signaling-client.js:103:15
       sdpMid: candidate.sdpMid,
       sdpMLineIndex: candidate.sdpMLineIndex,
     });
-    log.debug('Sent ICE candidate', { to: toPeerId });
+    log.debug("", { to: toPeerId });
   }
 

[Killed] BlockStatement
src/services/signaling-client.js:115:43
    * @param {Object} payload - Message payload
    * @returns {Promise<Object>} Server response
    */
-  async _sendMessage(toId, type, payload) {
-    const response = await fetch(`${this.baseUrl}/endpoints/signal.php`, {
-      method: 'POST',
-      headers: {
-        'Content-Type': 'application/json',
-      },
-      body: JSON.stringify({
-        roomCode: this.roomCode,
-        fromId: this.participantId,
-        toId,
-        type,
-        payload,
-      }),
-    });
-
-    if (!response.ok) {
-      const error = await response.json().catch(() => ({}));
-      throw new Error(error.error?.message || `HTTP ${response.status}`);
-    }
-
-    return response.json();
-  }
+  async _sendMessage(toId, type, payload) {}
 
   /**
killedBy: SignalingClient sendOffer should send offer to correct endpoint
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] StringLiteral
src/services/signaling-client.js:116:34
    * @returns {Promise<Object>} Server response
    */
   async _sendMessage(toId, type, payload) {
-    const response = await fetch(`${this.baseUrl}/endpoints/signal.php`, {
+    const response = await fetch(``, {
       method: 'POST',
       headers: {
killedBy: SignalingClient sendOffer should send offer to correct endpoint
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

@@ -1,8 +1,8 @@
  [

[Killed] ArrowFunction
src/services/signaling-client.js:131:49
     });
 
     if (!response.ok) {
-      const error = await response.json().catch(() => ({}));
+      const error = await response.json().catch(() => undefined);
       throw new Error(error.error?.message || `HTTP ${response.status}`);
     }
killedBy: SignalingClient error handling should handle JSON parse error
statusReason: expected [Function] to throw error including 'HTTP 500' but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
src/services/signaling-client.js:132:23
 
     if (!response.ok) {
       const error = await response.json().catch(() => ({}));
-      throw new Error(error.error?.message || `HTTP ${response.status}`);
+      throw new Error(error.error?.message && `HTTP ${response.status}`);
     }
 
killedBy: SignalingClient error handling should throw on send error
statusReason: expected [Function] to throw error including 'Bad request' but got 'HTTP 400'

[Killed] OptionalChaining
src/services/signaling-client.js:132:23
 
     if (!response.ok) {
       const error = await response.json().catch(() => ({}));
-      throw new Error(error.error?.message || `HTTP ${response.status}`);
+      throw new Error(error.error.message || `HTTP ${response.status}`);
     }
 
killedBy: SignalingClient error handling should handle JSON parse error
statusReason: expected [Function] to throw error including 'HTTP 500' but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/services/signaling-client.js:143:20
    *
    * @returns {Promise<string[]>} Array of peer IDs
    */
-  async getPeers() {
-    const url = `${this.baseUrl}/endpoints/signal.php/${this.roomCode}/${this.participantId}/peers`;
-
-    const response = await fetch(url);
-
-    if (!response.ok) {
-      throw new Error(`Failed to get peers: HTTP ${response.status}`);
-    }
-
-    const data = await response.json();
-    return data.data?.peers || [];
-  }
+  async getPeers() {}
 
   /**
killedBy: SignalingClient getPeers should fetch peers from correct endpoint
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
src/services/signaling-client.js:144:17
    * @returns {Promise<string[]>} Array of peer IDs
    */
   async getPeers() {
-    const url = `${this.baseUrl}/endpoints/signal.php/${this.roomCode}/${this.participantId}/peers`;
+    const url = ``;
 
     const response = await fetch(url);
killedBy: SignalingClient getPeers should fetch peers from correct endpoint
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "https://example.com/party/endpoints/signal.php/ABC123/user-1/peers",

[Killed] OptionalChaining
src/services/signaling-client.js:153:12
     }
 
     const data = await response.json();
-    return data.data?.peers || [];
+    return data.data.peers || [];
   }
 
killedBy: SignalingClient edge cases getPeers edge cases should return empty array when data.data is undefined
statusReason: Cannot read properties of undefined (reading 'peers')

[Killed] ConditionalExpression
src/services/signaling-client.js:153:12
     }
 
     const data = await response.json();
-    return data.data?.peers || [];
+    return true;
   }
 
killedBy: SignalingClient getPeers should fetch peers from correct endpoint
statusReason: expected true to deeply equal [ 'user-2', 'user-3' ]

[Killed] BlockStatement
src/services/signaling-client.js:161:27
    *
    * @param {Function} onMessage - Callback for received messages
    */
-  startPolling(onMessage) {
-    if (this.isPolling) {
-      log.warn('Already polling');
-      return;
-    }
-
-    this.onMessageCallback = onMessage;
-    this.isPolling = true;
-    this.consecutiveErrors = 0;
-
-    log.info('Started polling', { roomCode: this.roomCode });
-
-    this._poll();
-  }
+  startPolling(onMessage) {}
 
   /**
killedBy: SignalingClient polling should start polling and call callback with messages
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 1, fromId: 'user-2', …(2) } ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/signaling-client.js:162:9
    * @param {Function} onMessage - Callback for received messages
    */
   startPolling(onMessage) {
-    if (this.isPolling) {
+    if (true) {
       log.warn('Already polling');
       return;
killedBy: SignalingClient polling should start polling and call callback with messages
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 1, fromId: 'user-2', …(2) } ]

Number of calls: 0

[Survived] BlockStatement
src/services/signaling-client.js:162:25
    * @param {Function} onMessage - Callback for received messages
    */
   startPolling(onMessage) {
-    if (this.isPolling) {
-      log.warn('Already polling');
-      return;
-    }
+    if (this.isPolling) {}
 
     this.onMessageCallback = onMessage;

[Survived] StringLiteral
src/services/signaling-client.js:163:16
    */
   startPolling(onMessage) {
     if (this.isPolling) {
-      log.warn('Already polling');
+      log.warn("");
       return;
     }

[Killed] BooleanLiteral
src/services/signaling-client.js:168:22
     }
 
     this.onMessageCallback = onMessage;
-    this.isPolling = true;
+    this.isPolling = false;
     this.consecutiveErrors = 0;
 
killedBy: SignalingClient polling should start polling and call callback with messages
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 1, fromId: 'user-2', …(2) } ]

Number of calls: 0

[Survived] StringLiteral
src/services/signaling-client.js:171:14
     this.isPolling = true;
     this.consecutiveErrors = 0;
 
-    log.info('Started polling', { roomCode: this.roomCode });
+    log.info("", { roomCode: this.roomCode });
 
     this._poll();

[Killed] BlockStatement
src/services/signaling-client.js:179:17
   /**
    * Stop polling for messages.
    */
-  stopPolling() {
-    this.isPolling = false;
-
-    if (this.pollInterval) {
-      clearTimeout(this.pollInterval);
-      this.pollInterval = null;
-    }
-
-    log.info('Stopped polling', { roomCode: this.roomCode });
-  }
+  stopPolling() {}
 
   /**
killedBy: SignalingClient polling should stop polling when stopPolling is called
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/services/signaling-client.js:180:22
    * Stop polling for messages.
    */
   stopPolling() {
-    this.isPolling = false;
+    this.isPolling = true;
 
     if (this.pollInterval) {
killedBy: SignalingClient polling should stop polling when stopPolling is called
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
src/services/signaling-client.js:182:9
   stopPolling() {
     this.isPolling = false;
 
-    if (this.pollInterval) {
+    if (true) {
       clearTimeout(this.pollInterval);
       this.pollInterval = null;

[Survived] BlockStatement
src/services/signaling-client.js:182:28
   stopPolling() {
     this.isPolling = false;
 
-    if (this.pollInterval) {
-      clearTimeout(this.pollInterval);
-      this.pollInterval = null;
-    }
+    if (this.pollInterval) {}
 
     log.info('Stopped polling', { roomCode: this.roomCode });

[Killed] ConditionalExpression
src/services/signaling-client.js:196:9
    * @private
    */
   async _poll() {
-    if (!this.isPolling) return;
+    if (false) return;
 
     try {
killedBy: SignalingClient edge cases _poll edge cases should return early if not polling
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "https://example.com/party/endpoints/signal.php/ABC123/user-1",

[Killed] ConditionalExpression
src/services/signaling-client.js:196:9
    * @private
    */
   async _poll() {
-    if (!this.isPolling) return;
+    if (true) return;
 
     try {
killedBy: SignalingClient polling should start polling and call callback with messages
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 1, fromId: 'user-2', …(2) } ]

Number of calls: 0

[Killed] BlockStatement
src/services/signaling-client.js:198:9
   async _poll() {
     if (!this.isPolling) return;
 
-    try {
-      const messages = await this._fetchMessages();
-      this.consecutiveErrors = 0;
-
-      for (const message of messages) {
-        if (this.onMessageCallback) {
-          this.onMessageCallback(message);
-        }
-      }
-    } catch (error) {
+    try {} catch (error) {
       this.consecutiveErrors++;
       log.error('Poll error', { error: error.message, consecutive: this.consecutiveErrors });
killedBy: SignalingClient polling should start polling and call callback with messages
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 1, fromId: 'user-2', …(2) } ]

Number of calls: 0

[Killed] BlockStatement
src/services/signaling-client.js:202:39
       const messages = await this._fetchMessages();
       this.consecutiveErrors = 0;
 
-      for (const message of messages) {
-        if (this.onMessageCallback) {
-          this.onMessageCallback(message);
-        }
-      }
+      for (const message of messages) {}
     } catch (error) {
       this.consecutiveErrors++;
killedBy: SignalingClient polling should start polling and call callback with messages
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 1, fromId: 'user-2', …(2) } ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/signaling-client.js:203:13
       this.consecutiveErrors = 0;
 
       for (const message of messages) {
-        if (this.onMessageCallback) {
+        if (false) {
           this.onMessageCallback(message);
         }
killedBy: SignalingClient polling should start polling and call callback with messages
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 1, fromId: 'user-2', …(2) } ]

Number of calls: 0

[Killed] BlockStatement
src/services/signaling-client.js:203:37
       this.consecutiveErrors = 0;
 
       for (const message of messages) {
-        if (this.onMessageCallback) {
-          this.onMessageCallback(message);
-        }
+        if (this.onMessageCallback) {}
       }
     } catch (error) {
killedBy: SignalingClient polling should start polling and call callback with messages
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 1, fromId: 'user-2', …(2) } ]

Number of calls: 0

[Killed] BlockStatement
src/services/signaling-client.js:207:21
           this.onMessageCallback(message);
         }
       }
-    } catch (error) {
-      this.consecutiveErrors++;
-      log.error('Poll error', { error: error.message, consecutive: this.consecutiveErrors });
-
-      if (this.consecutiveErrors >= this.maxConsecutiveErrors) {
-        log.error('Too many consecutive errors, stopping polling');
-        this.stopPolling();
-        return;
-      }
-    }
+    } catch (error) {}
 
     // Schedule next poll
killedBy: SignalingClient polling should stop polling after max consecutive errors
statusReason: expected true to be false // Object.is equality

[Killed] UpdateOperator
src/services/signaling-client.js:208:7
         }
       }
     } catch (error) {
-      this.consecutiveErrors++;
+      this.consecutiveErrors--;
       log.error('Poll error', { error: error.message, consecutive: this.consecutiveErrors });
 
killedBy: SignalingClient polling should stop polling after max consecutive errors
statusReason: expected true to be false // Object.is equality

[Survived] ObjectLiteral
src/services/signaling-client.js:209:31
       }
     } catch (error) {
       this.consecutiveErrors++;
-      log.error('Poll error', { error: error.message, consecutive: this.consecutiveErrors });
+      log.error('Poll error', {});
 
       if (this.consecutiveErrors >= this.maxConsecutiveErrors) {

[Killed] ConditionalExpression
src/services/signaling-client.js:211:11
       this.consecutiveErrors++;
       log.error('Poll error', { error: error.message, consecutive: this.consecutiveErrors });
 
-      if (this.consecutiveErrors >= this.maxConsecutiveErrors) {
+      if (true) {
         log.error('Too many consecutive errors, stopping polling');
         this.stopPolling();
killedBy: SignalingClient edge cases polling retry behavior should reset consecutiveErrors on successful poll
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/services/signaling-client.js:211:11
       this.consecutiveErrors++;
       log.error('Poll error', { error: error.message, consecutive: this.consecutiveErrors });
 
-      if (this.consecutiveErrors >= this.maxConsecutiveErrors) {
+      if (false) {
         log.error('Too many consecutive errors, stopping polling');
         this.stopPolling();
killedBy: SignalingClient polling should stop polling after max consecutive errors
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/services/signaling-client.js:219:9
     }
 
     // Schedule next poll
-    if (this.isPolling) {
+    if (false) {
       this.pollInterval = setTimeout(() => this._poll(), this.pollIntervalMs);
     }
killedBy: SignalingClient polling should stop polling after max consecutive errors
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/signaling-client.js:219:25
     }
 
     // Schedule next poll
-    if (this.isPolling) {
-      this.pollInterval = setTimeout(() => this._poll(), this.pollIntervalMs);
-    }
+    if (this.isPolling) {}
   }
 
killedBy: SignalingClient polling should stop polling after max consecutive errors
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/services/signaling-client.js:220:38
 
     // Schedule next poll
     if (this.isPolling) {
-      this.pollInterval = setTimeout(() => this._poll(), this.pollIntervalMs);
+      this.pollInterval = setTimeout(() => undefined, this.pollIntervalMs);
     }
   }
killedBy: SignalingClient polling should stop polling after max consecutive errors
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/signaling-client.js:230:26
    * @private
    * @returns {Promise<SignalingMessage[]>}
    */
-  async _fetchMessages() {
-    const url = `${this.baseUrl}/endpoints/signal.php/${this.roomCode}/${this.participantId}`;
-
-    const response = await fetch(url);
-
-    if (!response.ok) {
-      throw new Error(`HTTP ${response.status}`);
-    }
-
-    const data = await response.json();
-    return data.data?.messages || [];
-  }
+  async _fetchMessages() {}
 
   /**
killedBy: SignalingClient polling should start polling and call callback with messages
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 1, fromId: 'user-2', …(2) } ]

Number of calls: 0

[NoCoverage] StringLiteral
src/services/signaling-client.js:236:23
     const response = await fetch(url);
 
     if (!response.ok) {
-      throw new Error(`HTTP ${response.status}`);
+      throw new Error(``);
     }
 

[Killed] ConditionalExpression
src/services/signaling-client.js:240:12
     }
 
     const data = await response.json();
-    return data.data?.messages || [];
+    return false;
   }
 
killedBy: SignalingClient polling should start polling and call callback with messages
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 1, fromId: 'user-2', …(2) } ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/signaling-client.js:240:12
     }
 
     const data = await response.json();
-    return data.data?.messages || [];
+    return true;
   }
 
killedBy: SignalingClient polling should start polling and call callback with messages
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 1, fromId: 'user-2', …(2) } ]

Number of calls: 0

[Killed] BlockStatement
src/services/signaling-client.js:248:23
    *
    * @param {number} ms - Interval in milliseconds
    */
-  setPollInterval(ms) {
-    this.pollIntervalMs = ms;
-  }
+  setPollInterval(ms) {}
 
   /**
killedBy: SignalingClient setPollInterval should update poll interval
statusReason: expected 500 to be 1000 // Object.is equality

[Killed] BlockStatement
src/services/signaling-client.js:255:13
   /**
    * Clean up resources.
    */
-  destroy() {
-    this.stopPolling();
-    this.onMessageCallback = null;
-    log.debug('SignalingClient destroyed');
-  }
+  destroy() {}
 }
 
killedBy: SignalingClient edge cases destroy should stop polling and clear callback
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
src/services/signaling-client.js:258:15
   destroy() {
     this.stopPolling();
     this.onMessageCallback = null;
-    log.debug('SignalingClient destroyed');
+    log.debug("");
   }
 }

[Killed] BlockStatement
src/services/signaling-client.js:267:39
  *
  * @returns {string} Base URL
  */
-export function getSignalingBaseUrl() {
-  // Use environment variable or default to production
-  return import.meta.env.VITE_PARTY_API_URL || 'https://saberloop.com/party';
-}
+export function getSignalingBaseUrl() {}
 
killedBy: getSignalingBaseUrl should return configured or default URL
statusReason: expected undefined to be 'https://saberloop.com/party' // Object.is equality

[Killed] ConditionalExpression
src/services/signaling-client.js:269:10
  */
 export function getSignalingBaseUrl() {
   // Use environment variable or default to production
-  return import.meta.env.VITE_PARTY_API_URL || 'https://saberloop.com/party';
+  return true;
 }
 
killedBy: getSignalingBaseUrl should return configured or default URL
statusReason: expected true to be 'https://saberloop.com/party' // Object.is equality

[Killed] LogicalOperator
src/services/signaling-client.js:269:10
  */
 export function getSignalingBaseUrl() {
   // Use environment variable or default to production
-  return import.meta.env.VITE_PARTY_API_URL || 'https://saberloop.com/party';
+  return import.meta.env.VITE_PARTY_API_URL && 'https://saberloop.com/party';
 }
 
killedBy: getSignalingBaseUrl should return configured or default URL
statusReason: expected undefined to be 'https://saberloop.com/party' // Object.is equality
