[Killed] BooleanLiteral
src/services/party-connection-manager.js:142:16
       } catch (error) {
         log.error('Connection failed', { error: error.message });
         this._handleConnectionFailure(error);
-        return false;
+        return true;
       }
     }
killedBy: PartyConnectionManager connect should handle connection failure and return false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/services/party-connection-manager.js:154:11
     async disconnect() {
       this._clearConnectionTimeout();
 
-      if (this.session) {
+      if (true) {
         this.session.destroy();
         this.session = null;
killedBy: PartyConnectionManager disconnect edge cases should handle disconnect when services are null
statusReason: Cannot read properties of null (reading 'destroy')

[Killed] ConditionalExpression
src/services/party-connection-manager.js:159:11
         this.session = null;
       }
 
-      if (this.p2pService) {
+      if (true) {
         this.p2pService.destroy();
         this.p2pService = null;
killedBy: PartyConnectionManager disconnect edge cases should handle disconnect when services are null
statusReason: Cannot read properties of null (reading 'destroy')

[Killed] ConditionalExpression
src/services/party-connection-manager.js:164:11
         this.p2pService = null;
       }
 
-      if (this.signalingClient) {
+      if (true) {
         this.signalingClient.destroy();
         this.signalingClient = null;
killedBy: PartyConnectionManager disconnect edge cases should handle disconnect when services are null
statusReason: Cannot read properties of null (reading 'destroy')

[Killed] EqualityOperator
src/services/party-connection-manager.js:289:11
         error: error.message,
       });
 
-      if (this.retryCount < CONFIG.maxRetries) {
+      if (this.retryCount >= CONFIG.maxRetries) {
         log.info('Retrying P2P connection', { attempt: this.retryCount });
         // Retry after a short delay
killedBy: PartyConnectionManager connect should handle connection failure and return false
statusReason: expected 'connecting' to be 'http_fallback' // Object.is equality

[Killed] ConditionalExpression
src/services/party-connection-manager.js:305:11
      * @private
      */
     _handleAllPeersDisconnected() {
-      if (this.mode === CONNECTION_MODES.P2P) {
+      if (true) {
         log.warn('All peers disconnected');
         // Could attempt reconnection or fallback here
killedBy: PartyConnectionManager _handleAllPeersDisconnected edge cases should not call onError if not in P2P mode
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      [Error: All peers disconnected],

[Killed] BlockStatement
src/services/party-connection-manager.js:360:19
      *
      * @returns {boolean}
      */
-    isConnected() {
-      return this.mode === CONNECTION_MODES.P2P || this.mode === CONNECTION_MODES.HTTP_FALLBACK;
-    }
+    isConnected() {}
 
     /**
killedBy: PartyConnectionManager isConnected should return false when disconnected
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/services/party-connection-manager.js:361:14
      * @returns {boolean}
      */
     isConnected() {
-      return this.mode === CONNECTION_MODES.P2P || this.mode === CONNECTION_MODES.HTTP_FALLBACK;
+      return this.mode !== CONNECTION_MODES.P2P || this.mode === CONNECTION_MODES.HTTP_FALLBACK;
     }
 
killedBy: PartyConnectionManager isConnected should return false when disconnected
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/services/party-connection-manager.js:370:14
      * @returns {boolean}
      */
     isP2P() {
-      return this.mode === CONNECTION_MODES.P2P;
+      return true;
     }
 
killedBy: PartyConnectionManager isP2P should return false when not in P2P mode
statusReason: expected true to be false // Object.is equality
