[Killed] BlockStatement
src/services/party-connection-store.js:21:42
    * Store a connection manager.
    * @param {import('./party-connection-manager.js').PartyConnectionManager} manager
    */
-  export function setConnection(manager) {
-    // Clean up any existing connection first
-    if (currentConnection && currentConnection !== manager) {
-      log.warn('Replacing existing connection');
-      currentConnection.destroy();
-    }
-    currentConnection = manager;
-    log.info('Connection stored', { roomCode: manager.roomCode });
-  }
+  export function setConnection(manager) {}
 
   /**
killedBy: party-connection-store setConnection should store a connection manager
statusReason: expected null to be { roomCode: 'ABC123', …(1) } // Object.is equality

[Killed] ConditionalExpression
src/services/party-connection-store.js:23:9
    */
   export function setConnection(manager) {
     // Clean up any existing connection first
-    if (currentConnection && currentConnection !== manager) {
+    if (true) {
       log.warn('Replacing existing connection');
       currentConnection.destroy();
killedBy: party-connection-store setConnection should store a connection manager
statusReason: Cannot read properties of null (reading 'destroy')

[Killed] EqualityOperator
src/services/party-connection-store.js:23:30
    */
   export function setConnection(manager) {
     // Clean up any existing connection first
-    if (currentConnection && currentConnection !== manager) {
+    if (currentConnection && currentConnection === manager) {
       log.warn('Replacing existing connection');
       currentConnection.destroy();
killedBy: party-connection-store setConnection should destroy existing connection when replacing
statusReason: expected "vi.fn()" to be called at least once

[Survived] StringLiteral
src/services/party-connection-store.js:28:14
       currentConnection.destroy();
     }
     currentConnection = manager;
-    log.info('Connection stored', { roomCode: manager.roomCode });
+    log.info("", { roomCode: manager.roomCode });
   }
 

[Killed] BlockStatement
src/services/party-connection-store.js:35:35
    * Get the current connection manager.
    * @returns {import('./party-connection-manager.js').PartyConnectionManager|null}
    */
-  export function getConnection() {
-    return currentConnection;
-  }
+  export function getConnection() {}
 
   /**
killedBy: party-connection-store setConnection should store a connection manager
statusReason: expected undefined to be { roomCode: 'ABC123', …(1) } // Object.is equality

[Killed] BlockStatement
src/services/party-connection-store.js:42:37
   /**
    * Clear and destroy the current connection.
    */
-  export function clearConnection() {
-    if (currentConnection) {
-      log.info('Clearing connection', { roomCode: currentConnection.roomCode });
-      currentConnection.destroy();
-      currentConnection = null;
-    }
-  }
+  export function clearConnection() {}
 
   /**
killedBy: party-connection-store getConnection should return null when no connection stored
statusReason: expected { roomCode: 'ABC123', …(1) } to be null

[Killed] BlockStatement
src/services/party-connection-store.js:43:28
    * Clear and destroy the current connection.
    */
   export function clearConnection() {
-    if (currentConnection) {
-      log.info('Clearing connection', { roomCode: currentConnection.roomCode });
-      currentConnection.destroy();
-      currentConnection = null;
-    }
+    if (currentConnection) {}
   }
 
killedBy: party-connection-store getConnection should return null when no connection stored
statusReason: expected { roomCode: 'ABC123', …(1) } to be null

[Killed] ConditionalExpression
src/services/party-connection-store.js:43:9
    * Clear and destroy the current connection.
    */
   export function clearConnection() {
-    if (currentConnection) {
+    if (false) {
       log.info('Clearing connection', { roomCode: currentConnection.roomCode });
       currentConnection.destroy();
killedBy: party-connection-store getConnection should return null when no connection stored
statusReason: expected { roomCode: 'ABC123', …(1) } to be null

[Killed] BlockStatement
src/services/party-connection-store.js:54:35
    * Check if a connection exists.
    * @returns {boolean}
    */
-  export function hasConnection() {
-    return currentConnection !== null;
-  }
+  export function hasConnection() {}
killedBy: party-connection-store hasConnection should return false when no connection
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/services/party-connection-store.js:55:12
    * @returns {boolean}
    */
   export function hasConnection() {
-    return currentConnection !== null;
+    return currentConnection === null;
   }
killedBy: party-connection-store hasConnection should return false when no connection
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/services/party-connection-store.js:55:12
    * @returns {boolean}
    */
   export function hasConnection() {
-    return currentConnection !== null;
+    return false;
   }
killedBy: party-connection-store hasConnection should return true when connection exists
statusReason: expected false to be true // Object.is equality
