[Survived] StringLiteral
src/services/quiz-import.js:24:36
  * }
  */
 export async function importQuizFromUrl(encodedData) {
-  telemetry.track('event', { name: 'quiz_import_started' });
+  telemetry.track('event', { name: "" });
 
   // Use deserializer to decode

[Survived] ObjectLiteral
src/services/quiz-import.js:24:28
  * }
  */
 export async function importQuizFromUrl(encodedData) {
-  telemetry.track('event', { name: 'quiz_import_started' });
+  telemetry.track('event', {});
 
   // Use deserializer to decode

[Killed] BlockStatement
src/services/quiz-import.js:29:24
   // Use deserializer to decode
   const result = deserializeQuiz(encodedData);
 
-  if (!result.success) {
-    telemetry.track('event', { name: 'quiz_import_failed', error: result.error });
-    return { success: false, error: result.error };
-  }
+  if (!result.success) {}
 
   const quiz = result.quiz;
killedBy: quiz-import importQuizFromUrl fails for invalid encoded data
statusReason: Cannot set properties of undefined (setting 'isImported')

[Killed] ConditionalExpression
src/services/quiz-import.js:29:7
   // Use deserializer to decode
   const result = deserializeQuiz(encodedData);
 
-  if (!result.success) {
+  if (true) {
     telemetry.track('event', { name: 'quiz_import_failed', error: result.error });
     return { success: false, error: result.error };
killedBy: quiz-import importQuizFromUrl successfully imports valid encoded data
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/services/quiz-import.js:30:21
   const result = deserializeQuiz(encodedData);
 
   if (!result.success) {
-    telemetry.track('event', { name: 'quiz_import_failed', error: result.error });
+    telemetry.track("", { name: 'quiz_import_failed', error: result.error });
     return { success: false, error: result.error };
   }

[Survived] StringLiteral
src/services/quiz-import.js:30:38
   const result = deserializeQuiz(encodedData);
 
   if (!result.success) {
-    telemetry.track('event', { name: 'quiz_import_failed', error: result.error });
+    telemetry.track('event', { name: "", error: result.error });
     return { success: false, error: result.error };
   }

[Killed] BooleanLiteral
src/services/quiz-import.js:31:23
 
   if (!result.success) {
     telemetry.track('event', { name: 'quiz_import_failed', error: result.error });
-    return { success: false, error: result.error };
+    return { success: true, error: result.error };
   }
 
killedBy: quiz-import importQuizFromUrl fails for invalid encoded data
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/services/quiz-import.js:31:12
 
   if (!result.success) {
     telemetry.track('event', { name: 'quiz_import_failed', error: result.error });
-    return { success: false, error: result.error };
+    return {};
   }
 
killedBy: quiz-import importQuizFromUrl fails for invalid encoded data
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/services/quiz-import.js:37:21
   const quiz = result.quiz;
 
   // Add import metadata
-  quiz.isImported = true;
+  quiz.isImported = false;
   quiz.importedAt = Date.now();
   quiz.originalCreator = quiz.creator || 'Anonymous';
killedBy: quiz-import importQuizFromUrl adds import metadata to quiz
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/quiz-import.js:39:26
   // Add import metadata
   quiz.isImported = true;
   quiz.importedAt = Date.now();
-  quiz.originalCreator = quiz.creator || 'Anonymous';
+  quiz.originalCreator = true;
   quiz.mode = quiz.mode || 'learning';
 
killedBy: quiz-import importQuizFromUrl adds import metadata to quiz
statusReason: expected true to be 'João' // Object.is equality

[Killed] ConditionalExpression
src/services/quiz-import.js:39:26
   // Add import metadata
   quiz.isImported = true;
   quiz.importedAt = Date.now();
-  quiz.originalCreator = quiz.creator || 'Anonymous';
+  quiz.originalCreator = false;
   quiz.mode = quiz.mode || 'learning';
 
killedBy: quiz-import importQuizFromUrl adds import metadata to quiz
statusReason: expected false to be 'João' // Object.is equality

[Killed] ConditionalExpression
src/services/quiz-import.js:40:15
   quiz.isImported = true;
   quiz.importedAt = Date.now();
   quiz.originalCreator = quiz.creator || 'Anonymous';
-  quiz.mode = quiz.mode || 'learning';
+  quiz.mode = true;
 
   // Remove creator from quiz object (it's now in originalCreator)
killedBy: quiz-import importQuizFromUrl defaults mode to learning when not provided
statusReason: expected true to be 'learning' // Object.is equality

[Killed] LogicalOperator
src/services/quiz-import.js:40:15
   quiz.isImported = true;
   quiz.importedAt = Date.now();
   quiz.originalCreator = quiz.creator || 'Anonymous';
-  quiz.mode = quiz.mode || 'learning';
+  quiz.mode = quiz.mode && 'learning';
 
   // Remove creator from quiz object (it's now in originalCreator)
killedBy: quiz-import importQuizFromUrl defaults mode to learning when not provided
statusReason: expected undefined to be 'learning' // Object.is equality

[Killed] ObjectLiteral
src/services/quiz-import.js:51:10
     topic: quiz.topic,
   });
 
-  return { success: true, quiz };
+  return {};
 }
 
killedBy: quiz-import importQuizFromUrl successfully imports valid encoded data
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/services/quiz-import.js:61:46
  * @param {Object} quiz - The validated quiz object from importQuizFromUrl
  * @returns {Promise<{success: boolean, id?: number, error?: string}>}
  */
-export async function saveImportedQuiz(quiz) {
-  try {
-    // Prepare session data for IndexedDB
-    const session = {
-      ...quiz,
-      timestamp: Date.now(),
-      userAnswers: [],
-      score: 0,
-      totalQuestions: quiz.questions.length,
-    };
-
-    // Save to IndexedDB (returns auto-generated ID)
-    const id = await saveSession(session);
-
-    telemetry.track('event', { name: 'quiz_import_saved', id, topic: quiz.topic });
-
-    return { success: true, id };
-  } catch (err) {
-    telemetry.track('event', { name: 'quiz_import_save_failed', error: err.message });
-    return { success: false, error: err.message };
-  }
-}
+export async function saveImportedQuiz(quiz) {}
 
killedBy: quiz-import saveImportedQuiz saves quiz and returns id
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] BlockStatement
src/services/quiz-import.js:62:7
  * @returns {Promise<{success: boolean, id?: number, error?: string}>}
  */
 export async function saveImportedQuiz(quiz) {
-  try {
-    // Prepare session data for IndexedDB
-    const session = {
-      ...quiz,
-      timestamp: Date.now(),
-      userAnswers: [],
-      score: 0,
-      totalQuestions: quiz.questions.length,
-    };
-
-    // Save to IndexedDB (returns auto-generated ID)
-    const id = await saveSession(session);
-
-    telemetry.track('event', { name: 'quiz_import_saved', id, topic: quiz.topic });
-
-    return { success: true, id };
-  } catch (err) {
+  try {} catch (err) {
     telemetry.track('event', { name: 'quiz_import_save_failed', error: err.message });
     return { success: false, error: err.message };
killedBy: quiz-import saveImportedQuiz saves quiz and returns id
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] ObjectLiteral
src/services/quiz-import.js:64:21
 export async function saveImportedQuiz(quiz) {
   try {
     // Prepare session data for IndexedDB
-    const session = {
-      ...quiz,
-      timestamp: Date.now(),
-      userAnswers: [],
-      score: 0,
-      totalQuestions: quiz.questions.length,
-    };
+    const session = {};
 
     // Save to IndexedDB (returns auto-generated ID)
killedBy: quiz-import saveImportedQuiz adds session metadata before saving
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ArrayDeclaration
src/services/quiz-import.js:67:20
     const session = {
       ...quiz,
       timestamp: Date.now(),
-      userAnswers: [],
+      userAnswers: ["Stryker was here"],
       score: 0,
       totalQuestions: quiz.questions.length,
killedBy: quiz-import saveImportedQuiz adds session metadata before saving
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/services/quiz-import.js:77:23
 
     telemetry.track('event', { name: 'quiz_import_saved', id, topic: quiz.topic });
 
-    return { success: true, id };
+    return { success: false, id };
   } catch (err) {
     telemetry.track('event', { name: 'quiz_import_save_failed', error: err.message });
killedBy: quiz-import saveImportedQuiz saves quiz and returns id
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/services/quiz-import.js:77:12
 
     telemetry.track('event', { name: 'quiz_import_saved', id, topic: quiz.topic });
 
-    return { success: true, id };
+    return {};
   } catch (err) {
     telemetry.track('event', { name: 'quiz_import_save_failed', error: err.message });
killedBy: quiz-import saveImportedQuiz saves quiz and returns id
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/services/quiz-import.js:78:17
     telemetry.track('event', { name: 'quiz_import_saved', id, topic: quiz.topic });
 
     return { success: true, id };
-  } catch (err) {
-    telemetry.track('event', { name: 'quiz_import_save_failed', error: err.message });
-    return { success: false, error: err.message };
-  }
+  } catch (err) {}
 }
 
killedBy: quiz-import saveImportedQuiz handles save errors gracefully
statusReason: Cannot read properties of undefined (reading 'success')

[Survived] StringLiteral
src/services/quiz-import.js:79:21
 
     return { success: true, id };
   } catch (err) {
-    telemetry.track('event', { name: 'quiz_import_save_failed', error: err.message });
+    telemetry.track("", { name: 'quiz_import_save_failed', error: err.message });
     return { success: false, error: err.message };
   }

[Killed] BooleanLiteral
src/services/quiz-import.js:80:23
     return { success: true, id };
   } catch (err) {
     telemetry.track('event', { name: 'quiz_import_save_failed', error: err.message });
-    return { success: false, error: err.message };
+    return { success: true, error: err.message };
   }
 }
killedBy: quiz-import saveImportedQuiz handles save errors gracefully
statusReason: expected true to be false // Object.is equality
