[Survived] StringLiteral
src/services/quiz-share.js:20:38
    * @returns {{success: boolean, url?: string, error?: string, length?: number}}
    */
   export function generateShareUrl(quiz, creatorName = null) {
-    telemetry.track('event', { name: 'quiz_share_initiated', topic: quiz.topic });
+    telemetry.track('event', { name: "", topic: quiz.topic });
 
     // Add creator if provided

[Survived] ObjectLiteral
src/services/quiz-share.js:20:30
    * @returns {{success: boolean, url?: string, error?: string, length?: number}}
    */
   export function generateShareUrl(quiz, creatorName = null) {
-    telemetry.track('event', { name: 'quiz_share_initiated', topic: quiz.topic });
+    telemetry.track('event', {});
 
     // Add creator if provided

[Killed] BlockStatement
src/services/quiz-share.js:29:26
 
     const result = serializeQuiz(quizToShare);
 
-    if (!result.success) {
-      telemetry.track('event', {
-        name: 'quiz_share_failed_too_large',
-        length: result.length,
-        questionCount: quiz.questions?.length
-      });
-      return result;
-    }
+    if (!result.success) {}
 
     const url = `${SHARE_BASE_URL}${result.data}`;
killedBy: quiz-share generateShareUrl fails for quiz that is too large
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
src/services/quiz-share.js:30:23
     const result = serializeQuiz(quizToShare);
 
     if (!result.success) {
-      telemetry.track('event', {
+      telemetry.track("", {
         name: 'quiz_share_failed_too_large',
         length: result.length,

[Survived] OptionalChaining
src/services/quiz-share.js:33:24
       telemetry.track('event', {
         name: 'quiz_share_failed_too_large',
         length: result.length,
-        questionCount: quiz.questions?.length
+        questionCount: quiz.questions.length
       });
       return result;

[Killed] BlockStatement
src/services/quiz-share.js:53:43
    * @param {string} url - The URL to copy
    * @returns {Promise<boolean>} Success status
    */
-  export async function copyShareUrl(url) {
-    try {
-      await navigator.clipboard.writeText(url);
-      telemetry.track('event', { name: 'quiz_share_copy_success' });
-      return true;
-    } catch (err) {
-      // Fallback for older browsers or restricted contexts
-      const success = fallbackCopyToClipboard(url);
-      if (success) {
-        telemetry.track('event', { name: 'quiz_share_copy_success' });
-      } else {
-        telemetry.track('event', { name: 'quiz_share_copy_failed', error: err.message });
-      }
-      return success;
-    }
-  }
+  export async function copyShareUrl(url) {}
 
   /**
killedBy: quiz-share copyShareUrl copies URL using Clipboard API
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/services/quiz-share.js:54:9
    * @returns {Promise<boolean>} Success status
    */
   export async function copyShareUrl(url) {
-    try {
-      await navigator.clipboard.writeText(url);
-      telemetry.track('event', { name: 'quiz_share_copy_success' });
-      return true;
-    } catch (err) {
+    try {} catch (err) {
       // Fallback for older browsers or restricted contexts
       const success = fallbackCopyToClipboard(url);
killedBy: quiz-share copyShareUrl copies URL using Clipboard API
statusReason: expected undefined to be true // Object.is equality

[Survived] StringLiteral
src/services/quiz-share.js:56:40
   export async function copyShareUrl(url) {
     try {
       await navigator.clipboard.writeText(url);
-      telemetry.track('event', { name: 'quiz_share_copy_success' });
+      telemetry.track('event', { name: "" });
       return true;
     } catch (err) {

[Killed] BooleanLiteral
src/services/quiz-share.js:57:14
     try {
       await navigator.clipboard.writeText(url);
       telemetry.track('event', { name: 'quiz_share_copy_success' });
-      return true;
+      return false;
     } catch (err) {
       // Fallback for older browsers or restricted contexts
killedBy: quiz-share copyShareUrl copies URL using Clipboard API
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/services/quiz-share.js:58:19
       await navigator.clipboard.writeText(url);
       telemetry.track('event', { name: 'quiz_share_copy_success' });
       return true;
-    } catch (err) {
-      // Fallback for older browsers or restricted contexts
-      const success = fallbackCopyToClipboard(url);
-      if (success) {
-        telemetry.track('event', { name: 'quiz_share_copy_success' });
-      } else {
-        telemetry.track('event', { name: 'quiz_share_copy_failed', error: err.message });
-      }
-      return success;
-    }
+    } catch (err) {}
   }
 
killedBy: quiz-share copyShareUrl uses fallback when Clipboard API fails
statusReason: expected undefined to be true // Object.is equality

[Survived] ConditionalExpression
src/services/quiz-share.js:61:11
     } catch (err) {
       // Fallback for older browsers or restricted contexts
       const success = fallbackCopyToClipboard(url);
-      if (success) {
+      if (true) {
         telemetry.track('event', { name: 'quiz_share_copy_success' });
       } else {

[Survived] BlockStatement
src/services/quiz-share.js:61:20
     } catch (err) {
       // Fallback for older browsers or restricted contexts
       const success = fallbackCopyToClipboard(url);
-      if (success) {
-        telemetry.track('event', { name: 'quiz_share_copy_success' });
-      } else {
+      if (success) {} else {
         telemetry.track('event', { name: 'quiz_share_copy_failed', error: err.message });
       }

[Survived] StringLiteral
src/services/quiz-share.js:62:42
       // Fallback for older browsers or restricted contexts
       const success = fallbackCopyToClipboard(url);
       if (success) {
-        telemetry.track('event', { name: 'quiz_share_copy_success' });
+        telemetry.track('event', { name: "" });
       } else {
         telemetry.track('event', { name: 'quiz_share_copy_failed', error: err.message });

[Killed] BlockStatement
src/services/quiz-share.js:63:14
       const success = fallbackCopyToClipboard(url);
       if (success) {
         telemetry.track('event', { name: 'quiz_share_copy_success' });
-      } else {
-        telemetry.track('event', { name: 'quiz_share_copy_failed', error: err.message });
-      }
+      } else {}
       return success;
     }
killedBy: quiz-share copyShareUrl edge cases tracks failure telemetry when both methods fail
statusReason: expected "vi.fn()" to be called at least once

[Survived] StringLiteral
src/services/quiz-share.js:64:42
       if (success) {
         telemetry.track('event', { name: 'quiz_share_copy_success' });
       } else {
-        telemetry.track('event', { name: 'quiz_share_copy_failed', error: err.message });
+        telemetry.track('event', { name: "", error: err.message });
       }
       return success;

[Killed] BlockStatement
src/services/quiz-share.js:75:42
    * @param {string} text - Text to copy
    * @returns {boolean} Success status
    */
-  function fallbackCopyToClipboard(text) {
-    const textarea = document.createElement('textarea');
-    textarea.value = text;
-    textarea.style.position = 'fixed';
-    textarea.style.opacity = '0';
-    document.body.appendChild(textarea);
-    textarea.select();
-
-    try {
-      const success = document.execCommand('copy');
-      document.body.removeChild(textarea);
-      return success;
-    } catch {
-      document.body.removeChild(textarea);
-      return false;
-    }
-  }
+  function fallbackCopyToClipboard(text) {}
 
   /**
killedBy: quiz-share copyShareUrl uses fallback when Clipboard API fails
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/services/quiz-share.js:83:9
     document.body.appendChild(textarea);
     textarea.select();
 
-    try {
-      const success = document.execCommand('copy');
-      document.body.removeChild(textarea);
-      return success;
-    } catch {
+    try {} catch {
       document.body.removeChild(textarea);
       return false;
killedBy: quiz-share copyShareUrl uses fallback when Clipboard API fails
statusReason: expected undefined to be true // Object.is equality

[Survived] StringLiteral
src/services/quiz-share.js:84:44
     textarea.select();
 
     try {
-      const success = document.execCommand('copy');
+      const success = document.execCommand("");
       document.body.removeChild(textarea);
       return success;

[Killed] BlockStatement
src/services/quiz-share.js:87:13
       const success = document.execCommand('copy');
       document.body.removeChild(textarea);
       return success;
-    } catch {
-      document.body.removeChild(textarea);
-      return false;
-    }
+    } catch {}
   }
 
killedBy: quiz-share copyShareUrl handles execCommand throwing an exception
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/services/quiz-share.js:89:14
       return success;
     } catch {
       document.body.removeChild(textarea);
-      return false;
+      return true;
     }
   }
killedBy: quiz-share copyShareUrl handles execCommand throwing an exception
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/services/quiz-share.js:102:14
    */
   export async function nativeShare(quiz, url) {
     const shareData = {
-      title: `Play "${quiz.topic}" on Saberloop!`,
+      title: ``,
       text: `I challenge you to this ${quiz.questions.length}-question quiz!`,
       url: url,
killedBy: quiz-share nativeShare calls navigator.share with correct data
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/services/quiz-share.js:108:9
     };
 
     // Check if Web Share API is supported
-    if (!navigator.share) {
+    if (true) {
       telemetry.track('event', { name: 'quiz_share_native_unsupported' });
       return { success: false, error: 'Native share not supported' };
killedBy: quiz-share nativeShare calls navigator.share with correct data
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/quiz-share.js:108:9
     };
 
     // Check if Web Share API is supported
-    if (!navigator.share) {
+    if (false) {
       telemetry.track('event', { name: 'quiz_share_native_unsupported' });
       return { success: false, error: 'Native share not supported' };
killedBy: quiz-share nativeShare returns unsupported when Web Share API not available
statusReason: expected 'navigator.share is not a function' to contain 'not supported'

[Survived] StringLiteral
src/services/quiz-share.js:109:40
 
     // Check if Web Share API is supported
     if (!navigator.share) {
-      telemetry.track('event', { name: 'quiz_share_native_unsupported' });
+      telemetry.track('event', { name: "" });
       return { success: false, error: 'Native share not supported' };
     }

[Killed] BooleanLiteral
src/services/quiz-share.js:110:25
     // Check if Web Share API is supported
     if (!navigator.share) {
       telemetry.track('event', { name: 'quiz_share_native_unsupported' });
-      return { success: false, error: 'Native share not supported' };
+      return { success: true, error: 'Native share not supported' };
     }
 
killedBy: quiz-share nativeShare returns unsupported when Web Share API not available
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/services/quiz-share.js:110:14
     // Check if Web Share API is supported
     if (!navigator.share) {
       telemetry.track('event', { name: 'quiz_share_native_unsupported' });
-      return { success: false, error: 'Native share not supported' };
+      return {};
     }
 
killedBy: quiz-share nativeShare returns unsupported when Web Share API not available
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/services/quiz-share.js:114:31
     }
 
     // Check if we can share this data
-    if (navigator.canShare && !navigator.canShare(shareData)) {
+    if (navigator.canShare && navigator.canShare(shareData)) {
       telemetry.track('event', { name: 'quiz_share_native_unsupported' });
       return { success: false, error: 'Cannot share this content' };
killedBy: quiz-share nativeShare calls navigator.share with correct data
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/quiz-share.js:114:9
     }
 
     // Check if we can share this data
-    if (navigator.canShare && !navigator.canShare(shareData)) {
+    if (false) {
       telemetry.track('event', { name: 'quiz_share_native_unsupported' });
       return { success: false, error: 'Cannot share this content' };
killedBy: quiz-share nativeShare returns error when canShare returns false
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
src/services/quiz-share.js:115:40
 
     // Check if we can share this data
     if (navigator.canShare && !navigator.canShare(shareData)) {
-      telemetry.track('event', { name: 'quiz_share_native_unsupported' });
+      telemetry.track('event', { name: "" });
       return { success: false, error: 'Cannot share this content' };
     }

[Killed] BooleanLiteral
src/services/quiz-share.js:116:25
     // Check if we can share this data
     if (navigator.canShare && !navigator.canShare(shareData)) {
       telemetry.track('event', { name: 'quiz_share_native_unsupported' });
-      return { success: false, error: 'Cannot share this content' };
+      return { success: true, error: 'Cannot share this content' };
     }
 
killedBy: quiz-share nativeShare returns error when canShare returns false
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/quiz-share.js:119:9
       return { success: false, error: 'Cannot share this content' };
     }
 
-    try {
-      await navigator.share(shareData);
-      telemetry.track('event', { name: 'quiz_share_native_success' });
-      return { success: true };
-    } catch (err) {
+    try {} catch (err) {
       // AbortError means user cancelled - not an error
       if (err.name === 'AbortError') {
killedBy: quiz-share nativeShare calls navigator.share with correct data
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Number of calls: 0

[Killed] BooleanLiteral
src/services/quiz-share.js:122:25
     try {
       await navigator.share(shareData);
       telemetry.track('event', { name: 'quiz_share_native_success' });
-      return { success: true };
+      return { success: false };
     } catch (err) {
       // AbortError means user cancelled - not an error
killedBy: quiz-share nativeShare works when canShare is not defined but share is
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/services/quiz-share.js:122:14
     try {
       await navigator.share(shareData);
       telemetry.track('event', { name: 'quiz_share_native_success' });
-      return { success: true };
+      return {};
     } catch (err) {
       // AbortError means user cancelled - not an error
killedBy: quiz-share nativeShare works when canShare is not defined but share is
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/services/quiz-share.js:123:19
       await navigator.share(shareData);
       telemetry.track('event', { name: 'quiz_share_native_success' });
       return { success: true };
-    } catch (err) {
-      // AbortError means user cancelled - not an error
-      if (err.name === 'AbortError') {
-        return { success: false, error: 'cancelled' };
-      }
-      telemetry.track('event', { name: 'quiz_share_native_failed', error: err.message });
-      return { success: false, error: err.message };
-    }
+    } catch (err) {}
   }
 
killedBy: quiz-share nativeShare handles user cancellation gracefully
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] ConditionalExpression
src/services/quiz-share.js:125:11
       return { success: true };
     } catch (err) {
       // AbortError means user cancelled - not an error
-      if (err.name === 'AbortError') {
+      if (false) {
         return { success: false, error: 'cancelled' };
       }
killedBy: quiz-share nativeShare handles user cancellation gracefully
statusReason: expected 'User cancelled' to be 'cancelled' // Object.is equality

[Killed] EqualityOperator
src/services/quiz-share.js:125:11
       return { success: true };
     } catch (err) {
       // AbortError means user cancelled - not an error
-      if (err.name === 'AbortError') {
+      if (err.name !== 'AbortError') {
         return { success: false, error: 'cancelled' };
       }
killedBy: quiz-share nativeShare handles user cancellation gracefully
statusReason: expected 'User cancelled' to be 'cancelled' // Object.is equality

[Killed] BlockStatement
src/services/quiz-share.js:137:44
    * Checks if native sharing is available.
    * @returns {boolean}
    */
-  export function isNativeShareSupported() {
-    return typeof navigator.share === 'function';
-  }
+  export function isNativeShareSupported() {}
 
   /**
killedBy: quiz-share isNativeShareSupported returns true when share is available
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/services/quiz-share.js:138:12
    * @returns {boolean}
    */
   export function isNativeShareSupported() {
-    return typeof navigator.share === 'function';
+    return true;
   }
 
killedBy: quiz-share isNativeShareSupported returns false when share is not available
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/services/quiz-share.js:138:12
    * @returns {boolean}
    */
   export function isNativeShareSupported() {
-    return typeof navigator.share === 'function';
+    return typeof navigator.share !== 'function';
   }
 
killedBy: quiz-share isNativeShareSupported returns true when share is available
statusReason: expected false to be true // Object.is equality
