[Killed] BlockStatement
src/services/theme-manager.js:13:36
    * Gets the current app mode.
    * @returns {'learning' | 'party'} The current mode
    */
-  export function getCurrentMode() {
-    return getSetting('appMode') || 'learning';
-  }
+  export function getCurrentMode() {}
 
   /**
killedBy: Theme Manager Service getCurrentMode should return "learning" as default when no setting exists
statusReason: expected undefined to be 'learning' // Object.is equality

[Killed] ConditionalExpression
src/services/theme-manager.js:14:12
    * @returns {'learning' | 'party'} The current mode
    */
   export function getCurrentMode() {
-    return getSetting('appMode') || 'learning';
+    return true;
   }
 
killedBy: Theme Manager Service getCurrentMode should return "learning" as default when no setting exists
statusReason: expected true to be 'learning' // Object.is equality

[Killed] LogicalOperator
src/services/theme-manager.js:14:12
    * @returns {'learning' | 'party'} The current mode
    */
   export function getCurrentMode() {
-    return getSetting('appMode') || 'learning';
+    return getSetting('appMode') && 'learning';
   }
 
killedBy: Theme Manager Service getCurrentMode should return "learning" as default when no setting exists
statusReason: expected undefined to be 'learning' // Object.is equality

[Killed] BlockStatement
src/services/theme-manager.js:21:33
    * Sets the app mode and applies the theme.
    * @param {'learning' | 'party'} mode - The mode to set
    */
-  export function setMode(mode) {
-    const previousMode = getCurrentMode();
-    saveSetting('appMode', mode);
-    applyTheme(mode);
-
-    if (previousMode !== mode) {
-      telemetry.track('event', {
-        name: 'mode_switched',
-        from: previousMode,
-        to: mode
-      });
-
-      // Dispatch event so views can respond to mode changes
-      window.dispatchEvent(new CustomEvent('modechange', {
-        detail: { mode, previousMode }
-      }));
-    }
-  }
+  export function setMode(mode) {}
 
   /**
killedBy: Theme Manager Service setMode should save mode to settings
statusReason: expected "vi.fn()" to be called with arguments: [ 'appMode', 'party' ]

Number of calls: 0

[Killed] BlockStatement
src/services/theme-manager.js:26:32
     saveSetting('appMode', mode);
     applyTheme(mode);
 
-    if (previousMode !== mode) {
-      telemetry.track('event', {
-        name: 'mode_switched',
-        from: previousMode,
-        to: mode
-      });
-
-      // Dispatch event so views can respond to mode changes
-      window.dispatchEvent(new CustomEvent('modechange', {
-        detail: { mode, previousMode }
-      }));
-    }
+    if (previousMode !== mode) {}
   }
 
killedBy: Theme Manager Service setMode should track telemetry when mode changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'event', …(1) ]

Number of calls: 0

[Killed] EqualityOperator
src/services/theme-manager.js:26:9
     saveSetting('appMode', mode);
     applyTheme(mode);
 
-    if (previousMode !== mode) {
+    if (previousMode === mode) {
       telemetry.track('event', {
         name: 'mode_switched',
killedBy: Theme Manager Service setMode should track telemetry when mode changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'event', …(1) ]

Number of calls: 0

[Killed] StringLiteral
src/services/theme-manager.js:28:15
 
     if (previousMode !== mode) {
       telemetry.track('event', {
-        name: 'mode_switched',
+        name: "",
         from: previousMode,
         to: mode
killedBy: Theme Manager Service setMode should track telemetry when mode changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'event', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "event",

[Survived] StringLiteral
src/services/theme-manager.js:34:44
       });
 
       // Dispatch event so views can respond to mode changes
-      window.dispatchEvent(new CustomEvent('modechange', {
+      window.dispatchEvent(new CustomEvent("", {
         detail: { mode, previousMode }
       }));

[Survived] ObjectLiteral
src/services/theme-manager.js:35:17
 
       // Dispatch event so views can respond to mode changes
       window.dispatchEvent(new CustomEvent('modechange', {
-        detail: { mode, previousMode }
+        detail: {}
       }));
     }

[Killed] BlockStatement
src/services/theme-manager.js:44:36
    * Applies the visual theme for the given mode.
    * @param {'learning' | 'party'} mode - The mode to apply
    */
-  export function applyTheme(mode) {
-    const root = document.documentElement;
-
-    if (mode === 'party') {
-      root.classList.add('party-mode', 'dark');
-    } else {
-      root.classList.remove('party-mode', 'dark');
-    }
-  }
+  export function applyTheme(mode) {}
 
   /**
killedBy: Theme Manager Service setMode should apply theme after saving
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/services/theme-manager.js:47:27
   export function applyTheme(mode) {
     const root = document.documentElement;
 
-    if (mode === 'party') {
-      root.classList.add('party-mode', 'dark');
-    } else {
+    if (mode === 'party') {} else {
       root.classList.remove('party-mode', 'dark');
     }
killedBy: Theme Manager Service setMode should apply theme after saving
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/theme-manager.js:47:9
   export function applyTheme(mode) {
     const root = document.documentElement;
 
-    if (mode === 'party') {
+    if (true) {
       root.classList.add('party-mode', 'dark');
     } else {
killedBy: Theme Manager Service applyTheme should remove party-mode and dark classes for learning mode
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/theme-manager.js:49:12
 
     if (mode === 'party') {
       root.classList.add('party-mode', 'dark');
-    } else {
-      root.classList.remove('party-mode', 'dark');
-    }
+    } else {}
   }
 
killedBy: Theme Manager Service applyTheme should remove party-mode and dark classes for learning mode
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/theme-manager.js:58:32
    * Toggles between learning and party modes.
    * @returns {'learning' | 'party'} The new mode
    */
-  export function toggleMode() {
-    const current = getCurrentMode();
-    const newMode = current === 'learning' ? 'party' : 'learning';
-    setMode(newMode);
-    return newMode;
-  }
+  export function toggleMode() {}
 
   /**
killedBy: Theme Manager Service toggleMode should switch from learning to party
statusReason: expected undefined to be 'party' // Object.is equality

[Killed] ConditionalExpression
src/services/theme-manager.js:60:21
    */
   export function toggleMode() {
     const current = getCurrentMode();
-    const newMode = current === 'learning' ? 'party' : 'learning';
+    const newMode = false ? 'party' : 'learning';
     setMode(newMode);
     return newMode;
killedBy: Theme Manager Service toggleMode should switch from learning to party
statusReason: expected 'learning' to be 'party' // Object.is equality

[Killed] ConditionalExpression
src/services/theme-manager.js:60:21
    */
   export function toggleMode() {
     const current = getCurrentMode();
-    const newMode = current === 'learning' ? 'party' : 'learning';
+    const newMode = true ? 'party' : 'learning';
     setMode(newMode);
     return newMode;
killedBy: Theme Manager Service toggleMode should switch from party to learning
statusReason: expected 'party' to be 'learning' // Object.is equality

[Killed] BlockStatement
src/services/theme-manager.js:69:31
    * Initializes the theme based on saved preference.
    * Call this on app startup.
    */
-  export function initTheme() {
-    const mode = getCurrentMode();
-    applyTheme(mode);
-  }
+  export function initTheme() {}
killedBy: Theme Manager Service initTheme should apply party theme when mode is party
statusReason: expected false to be true // Object.is equality
