[Killed] ConditionalExpression
src/services/cost-service.js:43:23
     return 0;
   }
 
-  const promptPrice = parseFloat(pricing.prompt) || 0;
+  const promptPrice = true;
   const completionPrice = parseFloat(pricing.completion) || 0;
 
killedBy: Cost Service calculateEstimatedCost should calculate cost based on token counts and pricing
statusReason: expected 100.0000105 to be close to 0.0000175, received difference is 99.999993, but expected 5e-8
