[Killed] ConditionalExpression
src/services/p2p-service.js:126:9
    * @returns {Promise<void>}
    */
   async createConnection(peerId) {
-    if (this.peers.has(peerId)) {
+    if (true) {
       log.warn('Connection already exists', { peerId });
       return;
killedBy: P2PService createConnection should create a new peer connection
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/services/p2p-service.js:178:9
 
     // Only accept offer if we're in a state that can receive it
     const signalingState = connection.signalingState;
-    if (signalingState !== 'stable' && signalingState !== 'have-local-offer') {
+    if (signalingState !== 'stable' || signalingState !== 'have-local-offer') {
       log.warn('Ignoring offer - wrong signaling state', { peerId, signalingState });
       return;
killedBy: P2PService handling signaling messages should handle offer and send answer
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-2', ObjectContaining{…} ]

Number of calls: 0

[Killed] EqualityOperator
src/services/p2p-service.js:178:9
 
     // Only accept offer if we're in a state that can receive it
     const signalingState = connection.signalingState;
-    if (signalingState !== 'stable' && signalingState !== 'have-local-offer') {
+    if (signalingState === 'stable' && signalingState !== 'have-local-offer') {
       log.warn('Ignoring offer - wrong signaling state', { peerId, signalingState });
       return;
killedBy: P2PService handling signaling messages should handle offer and send answer
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-2', ObjectContaining{…} ]

Number of calls: 0

[Survived] ConditionalExpression
src/services/p2p-service.js:242:9
    */
   async _handleIceCandidate(peerId, payload) {
     const peerConnection = this.peers.get(peerId);
-    if (!peerConnection) {
+    if (false) {
       log.warn('No connection for ICE candidate', { peerId });
       return;

[Survived] ObjectLiteral
src/services/p2p-service.js:247:43
       return;
     }
 
-    const candidate = new RTCIceCandidate({
-      candidate: payload.candidate,
-      sdpMid: payload.sdpMid,
-      sdpMLineIndex: payload.sdpMLineIndex,
-    });
+    const candidate = new RTCIceCandidate({});
 
     // Queue candidate if remote description not yet set

[Survived] ConditionalExpression
src/services/p2p-service.js:516:9
     const peerConnection = this.peers.get(peerId);
     if (!peerConnection) return;
 
-    if (peerConnection.dataChannel) {
+    if (false) {
       peerConnection.dataChannel.close();
     }

[Killed] BlockStatement
src/services/p2p-service.js:563:40
   broadcast(message) {
     let sentCount = 0;
 
-    for (const [peerId] of this.peers) {
-      if (this.send(peerId, message)) {
-        sentCount++;
-      }
-    }
+    for (const [peerId] of this.peers) {}
 
     log.debug('Broadcast message', { sentTo: sentCount, total: this.peers.size });
killedBy: P2PService broadcast should send to all connected peers
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/services/p2p-service.js:627:46
    */
   getConnectedPeers() {
     const connected = [];
-    for (const [peerId, peer] of this.peers) {
-      if (peer.state === 'connected') {
-        connected.push(peerId);
-      }
-    }
+    for (const [peerId, peer] of this.peers) {}
     return connected;
   }
killedBy: P2PService getConnectedPeers should return only connected peers
statusReason: expected [] to deeply equal [ 'peer-1' ]

[Killed] BlockStatement
src/services/p2p-service.js:656:13
   /**
    * Clean up all resources.
    */
-  destroy() {
-    this.isDestroyed = true;
-    this.disconnectAll();
-    this.signalingClient.stopPolling();
-    this.onMessageCallbacks = [];
-    this.onPeerConnectedCallbacks = [];
-    this.onPeerDisconnectedCallbacks = [];
-
-    log.info('P2PService destroyed');
-  }
+  destroy() {}
 }
 
killedBy: P2PService destroy should clean up all resources
statusReason: expected false to be true // Object.is equality
