[Killed] AssignmentOperator
src/services/party-session.js:92:5
   // Speed bonus: faster answers get more bonus points
   if (responseTimeMs < SCORING.speedBonusWindow) {
     const speedRatio = 1 - (responseTimeMs / SCORING.speedBonusWindow);
-    points += Math.round(SCORING.maxSpeedBonus * speedRatio);
+    points -= Math.round(SCORING.maxSpeedBonus * speedRatio);
   }
 
killedBy: calculatePoints returns max points for instant answers
statusReason: expected 5 to be 15 // Object.is equality

[Killed] UnaryOperator
src/services/party-session.js:107:26
  * @returns {number} Current question index (0-based), or -1 if not started
  */
 export function getCurrentQuestionIndex(startTime, secondsPerQuestion, totalQuestions) {
-  if (!startTime) return -1;
+  if (!startTime) return +1;
 
   const elapsed = Date.now() - startTime;
killedBy: getCurrentQuestionIndex returns -1 when startTime is 0 or falsy
statusReason: expected 1 to be -1 // Object.is equality

[Killed] BlockStatement
src/services/party-session.js:123:65
  * @param {number} secondsPerQuestion - Time per question in seconds
  * @returns {number} Milliseconds remaining, or 0 if not started
  */
-export function getTimeRemaining(startTime, secondsPerQuestion) {
-  if (!startTime) return 0;
-
-  const elapsed = Date.now() - startTime;
-  const questionTime = secondsPerQuestion * 1000;
-  const timeInQuestion = elapsed % questionTime;
-
-  return questionTime - timeInQuestion;
-}
+export function getTimeRemaining(startTime, secondsPerQuestion) {}
 
 /**
killedBy: getTimeRemaining returns 0 when startTime is 0 or falsy
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/services/party-session.js:124:7
  * @returns {number} Milliseconds remaining, or 0 if not started
  */
 export function getTimeRemaining(startTime, secondsPerQuestion) {
-  if (!startTime) return 0;
+  if (true) return 0;
 
   const elapsed = Date.now() - startTime;
killedBy: getTimeRemaining returns full time at question start
statusReason: expected +0 to be 30000 // Object.is equality

[Survived] ConditionalExpression
src/services/party-session.js:246:13
         break;
 
       case MESSAGE_TYPES.ANSWER:
-        if (this.isHost) {
+        if (true) {
           this._handleAnswer(peerId, payload);
         }

[Killed] BooleanLiteral
src/services/party-session.js:281:9
    * @param {number} [secondsPerQuestion=30] - Time per question
    */
   createSession(quiz, roomCode, hostName, secondsPerQuestion = 30) {
-    if (!this.isHost) {
+    if (this.isHost) {
       throw new Error('Only host can create session');
     }
killedBy: PartySession createSession (host) creates a session with quiz data
statusReason: Only host can create session

[Killed] BlockStatement
src/services/party-session.js:370:48
       throw new Error('Only host can start quiz');
     }
 
-    if (this.state !== SESSION_STATES.WAITING) {
-      throw new Error('Quiz already started');
-    }
+    if (this.state !== SESSION_STATES.WAITING) {}
 
     this.startTime = Date.now();
killedBy: PartySession startQuiz (host) throws error if quiz already started
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/services/party-session.js:380:28
 
     // Update all participants to "thinking" status
     for (const participant of this.participants.values()) {
-      participant.status = 'thinking';
+      participant.status = "";
     }
 
killedBy: PartySession startQuiz (host) sets all participants to thinking status
statusReason: expected '' to be 'thinking' // Object.is equality

[Survived] StringLiteral
src/services/party-session.js:417:16
 
     const participant = this.participants.get(peerId);
     if (!participant) {
-      log.warn('Answer from unknown participant', { peerId });
+      log.warn("", { peerId });
       return;
     }

[Survived] StringLiteral
src/services/party-session.js:455:14
       correct: isCorrect,
     });
 
-    log.info('Answer received', {
+    log.info("", {
       peerId,
       questionIndex,

[Killed] EqualityOperator
src/services/party-session.js:477:9
     if (!participant) return;
 
     // Ignore if already answered
-    if (participant.answers[questionIndex] !== undefined) return;
+    if (participant.answers[questionIndex] === undefined) return;
 
     const questionStartTime = this.startTime + (questionIndex * this.secondsPerQuestion * 1000);
killedBy: PartySession submitHostAnswer records host answer and calculates score
statusReason: expected undefined to be +0 // Object.is equality

[Survived] ArithmeticOperator
src/services/party-session.js:479:49
     // Ignore if already answered
     if (participant.answers[questionIndex] !== undefined) return;
 
-    const questionStartTime = this.startTime + (questionIndex * this.secondsPerQuestion * 1000);
+    const questionStartTime = this.startTime + (questionIndex / this.secondsPerQuestion * 1000);
     const responseTime = Date.now() - questionStartTime;
 

[Survived] ArithmeticOperator
src/services/party-session.js:479:49
     // Ignore if already answered
     if (participant.answers[questionIndex] !== undefined) return;
 
-    const questionStartTime = this.startTime + (questionIndex * this.secondsPerQuestion * 1000);
+    const questionStartTime = this.startTime + (questionIndex * this.secondsPerQuestion / 1000);
     const responseTime = Date.now() - questionStartTime;
 

[Survived] ConditionalExpression
src/services/party-session.js:517:15
 
         // Reset participant status for new question
         for (const participant of this.participants.values()) {
-          if (participant.answers[newQuestion] === undefined) {
+          if (true) {
             participant.status = 'thinking';
           }

[Killed] BlockStatement
src/services/party-session.js:526:60
         this._notifyParticipantsChange();
 
         // Check if quiz is finished
-        if (newQuestion >= this.quiz.questions.length - 1) {
-          // Wait for the last question to complete
-          setTimeout(() => {
-            this._endQuiz();
-          }, this.secondsPerQuestion * 1000);
-        }
+        if (newQuestion >= this.quiz.questions.length - 1) {}
       }
     }, 100); // Check every 100ms
killedBy: PartySession callbacks calls onQuizEnd callback when quiz finishes
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array> ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-session.js:528:28
         // Check if quiz is finished
         if (newQuestion >= this.quiz.questions.length - 1) {
           // Wait for the last question to complete
-          setTimeout(() => {
-            this._endQuiz();
-          }, this.secondsPerQuestion * 1000);
+          setTimeout(() => {}, this.secondsPerQuestion * 1000);
         }
       }
killedBy: PartySession callbacks calls onQuizEnd callback when quiz finishes
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array> ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-session.js:594:37
       payload: { scores },
     });
 
-    if (this.onScoreUpdateCallback) {
-      this.onScoreUpdateCallback(scores);
-    }
+    if (this.onScoreUpdateCallback) {}
   }
 
killedBy: PartySession callbacks calls onScoreUpdate callback
statusReason: expected "vi.fn()" to be called with arguments: [ ArrayContaining{…} ]

Number of calls: 0

[Killed] LogicalOperator
src/services/party-session.js:606:28
    */
   _broadcastParticipants() {
     // Send updated session info to all peers
-    for (const [peerId] of this.p2p.peers || new Map()) {
+    for (const [peerId] of this.p2p.peers && new Map()) {
       this._sendSessionInfo(peerId);
     }
killedBy: PartySession edge cases _broadcastParticipants edge cases handles null peers
statusReason: Map is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/services/party-session.js:615:9
    * End the session.
    */
   endSession() {
-    if (this.questionTimer) {
+    if (false) {
       clearInterval(this.questionTimer);
       this.questionTimer = null;
killedBy: PartySession endSession clears question timer
statusReason: expected { refed: true, …(4), …(1) } to be null

[Survived] StringLiteral
src/services/party-session.js:624:14
     this.p2p.destroy();
     this._notifyStateChange();
 
-    log.info('Session ended');
+    log.info("");
   }
 

[Survived] ObjectLiteral
src/services/party-session.js:645:33
     this.roomCode = roomCode;
     this.participantName = name;
 
-    log.info('Joining session', { roomCode, name });
+    log.info('Joining session', {});
   }
 

[Killed] BooleanLiteral
src/services/party-session.js:671:9
     }
 
     // Add self if not in list
-    if (!this.participants.has(this.participantId)) {
+    if (this.participants.has(this.participantId)) {
       this.participants.set(this.participantId, {
         id: this.participantId,
killedBy: PartySession message handling SESSION_INFO (guest receives) updates guest with session info
statusReason: expected 1 to be 2 // Object.is equality

[NoCoverage] BlockStatement
src/services/party-session.js:725:49
         this.quiz.questions.length
       );
 
-      if (newQuestion !== this.currentQuestion) {
-        this.currentQuestion = newQuestion;
-        this._notifyQuestionChange();
-      }
+      if (newQuestion !== this.currentQuestion) {}
     }, 100);
   }

[Killed] ObjectLiteral
src/services/party-session.js:745:24
     }
 
     // Send answer to host
-    this.p2p.broadcast({
-      type: MESSAGE_TYPES.ANSWER,
-      payload: {
-        questionIndex,
-        answerIndex,
-        timestamp: Date.now(),
-      },
-    });
+    this.p2p.broadcast({});
 
     // Update local participant status
killedBy: PartySession submitAnswer (guest) broadcasts answer to host
statusReason: expected "vi.fn()" to be called with arguments: [ { type: 'answer', …(1) } ]

Received: 

  1st vi.fn() call:

  [
-   {

[Killed] ConditionalExpression
src/services/party-session.js:756:9
 
     // Update local participant status
     const participant = this.participants.get(this.participantId);
-    if (participant) {
+    if (false) {
       participant.answers[questionIndex] = answerIndex;
       participant.status = 'answered';
killedBy: PartySession submitAnswer (guest) updates local participant status
statusReason: expected undefined to be 1 // Object.is equality

[Survived] ObjectLiteral
src/services/party-session.js:762:34
       this._notifyParticipantsChange();
     }
 
-    log.info('Answer submitted', { questionIndex, answerIndex });
+    log.info('Answer submitted', {});
   }
 

[Killed] BlockStatement
src/services/party-session.js:805:33
     this.state = SESSION_STATES.FINISHED;
     this._notifyStateChange();
 
-    if (this.onQuizEndCallback) {
-      this.onQuizEndCallback(payload.standings);
-    }
+    if (this.onQuizEndCallback) {}
 
     log.info('Quiz ended (guest)');
killedBy: PartySession message handling QUIZ_END (guest receives) sets state to finished and calls callback
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: 'host-1', …(2) } ] ]

Number of calls: 0

[Survived] StringLiteral
src/services/party-session.js:836:14
       reason: 'user_left',
     });
 
-    log.info('Left session');
+    log.info("");
   }
 

[Killed] BlockStatement
src/services/party-session.js:845:35
    * @private
    * @param {string} peerId - Peer who left
    */
-  _handleParticipantLeave(peerId) {
-    this.participants.delete(peerId);
-    this._notifyParticipantsChange();
-
-    if (this.isHost) {
-      this._broadcastParticipants();
-    }
-
-    // Track telemetry
-    telemetry.track('party_room_left', {
-      roomCode: this.roomCode,
-      reason: 'participant_left',
-    });
-
-    log.info('Participant left', { peerId });
-  }
+  _handleParticipantLeave(peerId) {}
 
   /**
killedBy: PartySession message handling LEAVE (host receives) removes participant
statusReason: expected 2 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/services/party-session.js:849:9
     this.participants.delete(peerId);
     this._notifyParticipantsChange();
 
-    if (this.isHost) {
+    if (true) {
       this._broadcastParticipants();
     }

[Survived] StringLiteral
src/services/party-session.js:859:14
       reason: 'participant_left',
     });
 
-    log.info('Participant left', { peerId });
+    log.info("", { peerId });
   }
 

[Killed] ConditionalExpression
src/services/party-session.js:870:9
    */
   _handlePeerDisconnected(peerId) {
     const participant = this.participants.get(peerId);
-    if (participant) {
+    if (false) {
       participant.status = 'disconnected';
       this._notifyParticipantsChange();
killedBy: PartySession peer connection events marks participant as disconnected on peer disconnect
statusReason: expected 'connected' to be 'disconnected' // Object.is equality

[Killed] BlockStatement
src/services/party-session.js:892:24
    *
    * @returns {Object|null} Current question or null
    */
-  getCurrentQuestion() {
-    if (!this.quiz || this.currentQuestion < 0) return null;
-    return this.quiz.questions[this.currentQuestion];
-  }
+  getCurrentQuestion() {}
 
   /**
killedBy: PartySession getCurrentQuestion returns null if no quiz
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/services/party-session.js:893:9
    * @returns {Object|null} Current question or null
    */
   getCurrentQuestion() {
-    if (!this.quiz || this.currentQuestion < 0) return null;
+    if (false) return null;
     return this.quiz.questions[this.currentQuestion];
   }
killedBy: PartySession getCurrentQuestion returns null if no quiz
statusReason: Cannot read properties of null (reading 'questions')

[Killed] ConditionalExpression
src/services/party-session.js:893:23
    * @returns {Object|null} Current question or null
    */
   getCurrentQuestion() {
-    if (!this.quiz || this.currentQuestion < 0) return null;
+    if (!this.quiz || false) return null;
     return this.quiz.questions[this.currentQuestion];
   }
killedBy: PartySession getCurrentQuestion returns null if currentQuestion is -1
statusReason: expected undefined to be null

[Killed] BlockStatement
src/services/party-session.js:911:21
    *
    * @returns {Participant[]} Participants array
    */
-  getParticipants() {
-    return Array.from(this.participants.values());
-  }
+  getParticipants() {}
 
   /**
killedBy: PartySession createSession (host) triggers participants change callback
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array> ]

Received: 

  1st vi.fn() call:

  [
-   Any<Array>,

[Killed] MethodExpression
src/services/party-session.js:921:12
    * @returns {Participant[]} Sorted participants
    */
   getStandings() {
-    return Array.from(this.participants.values())
-      .sort((a, b) => b.score - a.score);
+    return Array.from(this.participants.values());
   }
 
killedBy: PartySession getStandings returns participants sorted by score (highest first)
statusReason: expected 'Host' to be 'Guest 1' // Object.is equality

[Killed] ArrowFunction
src/services/party-session.js:922:13
    */
   getStandings() {
     return Array.from(this.participants.values())
-      .sort((a, b) => b.score - a.score);
+      .sort(() => undefined);
   }
 
killedBy: PartySession getStandings returns participants sorted by score (highest first)
statusReason: expected 'Host' to be 'Guest 1' // Object.is equality

[Killed] BlockStatement
src/services/party-session.js:930:13
    *
    * @returns {Participant|null}
    */
-  getSelf() {
-    return this.participants.get(this.participantId) || null;
-  }
+  getSelf() {}
 
   // ============================================
killedBy: PartySession getSelf returns own participant data
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/services/party-session.js:1000:44
    * @private
    */
   _notifyParticipantsChange() {
-    if (this.onParticipantsChangeCallback) {
-      this.onParticipantsChangeCallback(this.getParticipants());
-    }
+    if (this.onParticipantsChangeCallback) {}
   }
 
killedBy: PartySession createSession (host) triggers participants change callback
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Array> ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/party-session.js:1020:9
    * Clean up resources.
    */
   destroy() {
-    if (this.questionTimer) {
+    if (false) {
       clearInterval(this.questionTimer);
       this.questionTimer = null;
killedBy: PartySession destroy cleans up resources
statusReason: expected { refed: true, …(4), …(1) } to be null

[Survived] StringLiteral
src/services/party-session.js:1031:14
     this.onScoreUpdateCallback = null;
     this.onQuizEndCallback = null;
 
-    log.info('PartySession destroyed');
+    log.info("");
   }
 }
