[Killed] ObjectLiteral
src/services/quiz-serializer.js:11:24
   import LZString from 'lz-string';
 
   // Short keys for smaller JSON payload
-  const QUIZ_KEY_MAP = {
-    topic: 't',
-    gradeLevel: 'g',
-    creator: 'c',
-    mode: 'm',
-    questions: 'q',
-  };
+  const QUIZ_KEY_MAP = {};
 
   const QUESTION_KEY_MAP = {
killedBy: quiz-share generateShareUrl fails for quiz that is too large
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/services/quiz-serializer.js:68:9
     const quiz = {};
 
     // Map quiz-level fields
-    if (short.t) quiz.topic = short.t;
+    if (false) quiz.topic = short.t;
     if (short.g) quiz.gradeLevel = short.g;
     if (short.c) quiz.creator = short.c;
killedBy: quiz-serializer deserializeQuiz recovers original quiz data
statusReason: expected undefined to be 'Test Topic' // Object.is equality

[Killed] ConditionalExpression
src/services/quiz-serializer.js:110:11
   export function serializeQuiz(quiz) {
     try {
       // Validate input
-      if (!quiz || !quiz.questions || quiz.questions.length === 0) {
+      if (true) {
         return { success: false, error: 'Quiz must have at least one question' };
       }
killedBy: quiz-serializer serializeQuiz produces valid encoded string for a valid quiz
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/quiz-serializer.js:110:39
   export function serializeQuiz(quiz) {
     try {
       // Validate input
-      if (!quiz || !quiz.questions || quiz.questions.length === 0) {
+      if (!quiz || !quiz.questions || false) {
         return { success: false, error: 'Quiz must have at least one question' };
       }
killedBy: quiz-serializer serializeQuiz rejects quiz with no questions
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/services/quiz-serializer.js:111:27
     try {
       // Validate input
       if (!quiz || !quiz.questions || quiz.questions.length === 0) {
-        return { success: false, error: 'Quiz must have at least one question' };
+        return { success: true, error: 'Quiz must have at least one question' };
       }
 
killedBy: quiz-serializer serializeQuiz rejects empty quiz
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/services/quiz-serializer.js:111:41
     try {
       // Validate input
       if (!quiz || !quiz.questions || quiz.questions.length === 0) {
-        return { success: false, error: 'Quiz must have at least one question' };
+        return { success: false, error: "" };
       }
 
killedBy: quiz-serializer serializeQuiz rejects empty quiz
statusReason: expected '' to contain 'at least one question'

[Killed] EqualityOperator
src/services/quiz-serializer.js:125:11
         .replace(/\+/g, '_');
 
       // Check length
-      if (compressed.length > MAX_URL_LENGTH) {
+      if (compressed.length <= MAX_URL_LENGTH) {
         return {
           success: false,
killedBy: quiz-serializer serializeQuiz produces valid encoded string for a valid quiz
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/quiz-serializer.js:158:23
   export function deserializeQuiz(encoded) {
     try {
       // Validate input
-      if (!encoded || typeof encoded !== 'string') {
+      if (!encoded || typeof encoded === 'string') {
         return { success: false, error: 'Invalid encoded data' };
       }
killedBy: quiz-serializer serializeQuiz excludes explanations from payload
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] LogicalOperator
src/services/quiz-serializer.js:194:9
    * @returns {{canShare: boolean, estimatedLength: number, maxLength: number}}
    */
   export function canShareQuiz(quiz) {
-    if (!quiz || !quiz.questions) {
+    if (!quiz && !quiz.questions) {
       return { canShare: false, estimatedLength: 0, maxLength: MAX_URL_LENGTH };
     }
killedBy: quiz-serializer canShareQuiz returns false for null quiz
statusReason: Cannot read properties of null (reading 'questions')

[Killed] ObjectLiteral
src/services/quiz-serializer.js:195:14
    */
   export function canShareQuiz(quiz) {
     if (!quiz || !quiz.questions) {
-      return { canShare: false, estimatedLength: 0, maxLength: MAX_URL_LENGTH };
+      return {};
     }
 
killedBy: quiz-serializer canShareQuiz returns false for null quiz
statusReason: expected undefined to be false // Object.is equality
