[Survived] ObjectLiteral
src/services/signaling-client.js:103:37
       sdpMid: candidate.sdpMid,
       sdpMLineIndex: candidate.sdpMLineIndex,
     });
-    log.debug('Sent ICE candidate', { to: toPeerId });
+    log.debug('Sent ICE candidate', {});
   }
 

[Killed] ConditionalExpression
src/services/signaling-client.js:132:23
 
     if (!response.ok) {
       const error = await response.json().catch(() => ({}));
-      throw new Error(error.error?.message || `HTTP ${response.status}`);
+      throw new Error(false);
     }
 
killedBy: SignalingClient error handling should throw on send error
statusReason: expected [Function] to throw error including 'Bad request' but got 'false'

[Survived] ConditionalExpression
src/services/signaling-client.js:162:9
    * @param {Function} onMessage - Callback for received messages
    */
   startPolling(onMessage) {
-    if (this.isPolling) {
+    if (false) {
       log.warn('Already polling');
       return;
