[Killed] ConditionalExpression
src/services/party-connection-manager.js:255:13
       this._clearConnectionTimeout();
 
       this.connectionTimer = window.setTimeout(() => {
-        if (this.mode === CONNECTION_MODES.CONNECTING) {
+        if (false) {
           log.warn('Connection timeout');
           this._handleConnectionFailure(new Error('Connection timeout'));
killedBy: PartyConnectionManager connection timeout should trigger fallback after timeout
statusReason: expected 'connecting' to be 'http_fallback' // Object.is equality

[Survived] ConditionalExpression
src/services/party-connection-manager.js:255:13
       this._clearConnectionTimeout();
 
       this.connectionTimer = window.setTimeout(() => {
-        if (this.mode === CONNECTION_MODES.CONNECTING) {
+        if (true) {
           log.warn('Connection timeout');
           this._handleConnectionFailure(new Error('Connection timeout'));

[Killed] ConditionalExpression
src/services/party-connection-manager.js:379:11
      * @returns {string[]}
      */
     getPeers() {
-      if (!this.p2pService) return [];
+      if (true) return [];
       return this.p2pService.getConnectedPeers();
     }
killedBy: PartyConnectionManager getPeers with connected peers should return peers from p2pService
statusReason: expected [] to deeply equal [ 'peer-1', 'peer-2' ]
