[Survived] StringLiteral
src/services/quiz-import.js:24:19
  * }
  */
 export async function importQuizFromUrl(encodedData) {
-  telemetry.track('event', { name: 'quiz_import_started' });
+  telemetry.track("", { name: 'quiz_import_started' });
 
   // Use deserializer to decode
