[Survived] StringLiteral
src/services/quiz-share.js:62:25
       // Fallback for older browsers or restricted contexts
       const success = fallbackCopyToClipboard(url);
       if (success) {
-        telemetry.track('event', { name: 'quiz_share_copy_success' });
+        telemetry.track("", { name: 'quiz_share_copy_success' });
       } else {
         telemetry.track('event', { name: 'quiz_share_copy_failed', error: err.message });

[Killed] ConditionalExpression
src/services/quiz-share.js:114:9
     }
 
     // Check if we can share this data
-    if (navigator.canShare && !navigator.canShare(shareData)) {
+    if (true) {
       telemetry.track('event', { name: 'quiz_share_native_unsupported' });
       return { success: false, error: 'Cannot share this content' };
killedBy: quiz-share nativeShare calls navigator.share with correct data
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Number of calls: 0

[Survived] StringLiteral
src/services/quiz-share.js:115:23
 
     // Check if we can share this data
     if (navigator.canShare && !navigator.canShare(shareData)) {
-      telemetry.track('event', { name: 'quiz_share_native_unsupported' });
+      telemetry.track("", { name: 'quiz_share_native_unsupported' });
       return { success: false, error: 'Cannot share this content' };
     }

[Killed] BlockStatement
src/services/quiz-share.js:125:38
       return { success: true };
     } catch (err) {
       // AbortError means user cancelled - not an error
-      if (err.name === 'AbortError') {
-        return { success: false, error: 'cancelled' };
-      }
+      if (err.name === 'AbortError') {}
       telemetry.track('event', { name: 'quiz_share_native_failed', error: err.message });
       return { success: false, error: err.message };
killedBy: quiz-share nativeShare handles user cancellation gracefully
statusReason: expected 'User cancelled' to be 'cancelled' // Object.is equality

[Killed] ConditionalExpression
src/services/quiz-share.js:125:11
       return { success: true };
     } catch (err) {
       // AbortError means user cancelled - not an error
-      if (err.name === 'AbortError') {
+      if (true) {
         return { success: false, error: 'cancelled' };
       }
killedBy: quiz-share nativeShare reports actual errors
statusReason: expected 'cancelled' to be 'Network error' // Object.is equality

[Killed] BooleanLiteral
src/services/quiz-share.js:126:27
     } catch (err) {
       // AbortError means user cancelled - not an error
       if (err.name === 'AbortError') {
-        return { success: false, error: 'cancelled' };
+        return { success: true, error: 'cancelled' };
       }
       telemetry.track('event', { name: 'quiz_share_native_failed', error: err.message });
killedBy: quiz-share nativeShare handles user cancellation gracefully
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/services/quiz-share.js:129:25
         return { success: false, error: 'cancelled' };
       }
       telemetry.track('event', { name: 'quiz_share_native_failed', error: err.message });
-      return { success: false, error: err.message };
+      return { success: true, error: err.message };
     }
   }
killedBy: quiz-share nativeShare reports actual errors
statusReason: expected true to be false // Object.is equality
