[Killed] BlockStatement
src/utils/adManager.js:53:50
   if (adsenseScriptLoaded) return true;
 
   // Already available (e.g., set by tests or loaded elsewhere)
-  if (typeof window.adsbygoogle !== 'undefined') {
-    adsenseScriptLoaded = true;
-    return true;
-  }
+  if (typeof window.adsbygoogle !== 'undefined') {}
     
   // Loading in progress - return existing promise
killedBy: AdManager loadAd should return false when container is not found
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/utils/adManager.js:104:7
   }
 
   // Check if online
-  if (!isOnline()) {
+  if (true) {
     logger.debug('[AdManager] Cannot load ads: offline');
     return false;
killedBy: AdManager canLoadAds should return false when adsbygoogle is not loaded
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Cannot load ads: adsbygoogle not loaded",

[Killed] ConditionalExpression
src/utils/adManager.js:126:7
  */
 export async function loadAd(containerId, slotKey) {
   // Prevent duplicate loads
-  if (loadedAds.has(containerId)) {
+  if (true) {
     logger.debug(`[AdManager] Ad already loaded in ${containerId}`);
     return false;
killedBy: AdManager loadAd should return false when container is not found
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BooleanLiteral
src/utils/adManager.js:148:12
   const container = document.getElementById(containerId);
   if (!container) {
     logger.warn(`[AdManager] Container not found: ${containerId}`);
-    return false;
+    return true;
   }
 
killedBy: AdManager loadAd should return false when container is not found
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/adManager.js:160:7
     return false;
   }
 
-  try {
-    // Create the ad element
-    const adElement = document.createElement('ins');
-    adElement.className = 'adsbygoogle';
-    adElement.style.display = 'block';
-    adElement.setAttribute('data-ad-client', PUBLISHER_ID);
-    adElement.setAttribute('data-ad-slot', slotId);
-    adElement.setAttribute('data-ad-format', 'auto');
-    adElement.setAttribute('data-full-width-responsive', 'true');
-
-    // Clear container and add ad
-    container.innerHTML = '';
-    container.appendChild(adElement);
-
-    // Push to AdSense
-    window.adsbygoogle = window.adsbygoogle || [];
-    window.adsbygoogle.push({});
-
-    // Mark as loaded
-    loadedAds.add(containerId);
-    logger.info(`[AdManager] Ad loaded in ${containerId}`);
-
-    return true;
-  } catch (error) {
+  try {} catch (error) {
     logger.error('[AdManager] Error loading ad:', error);
     hideContainer(containerId);
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected undefined to be false // Object.is equality

[Killed] StringLiteral
src/utils/adManager.js:162:46
 
   try {
     // Create the ad element
-    const adElement = document.createElement('ins');
+    const adElement = document.createElement("");
     adElement.className = 'adsbygoogle';
     adElement.style.display = 'block';
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Ad already loaded in test-ad-container",

[Killed] ConditionalExpression
src/utils/adManager.js:175:26
     container.appendChild(adElement);
 
     // Push to AdSense
-    window.adsbygoogle = window.adsbygoogle || [];
+    window.adsbygoogle = true;
     window.adsbygoogle.push({});
 
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Ad already loaded in test-ad-container",

[Killed] ConditionalExpression
src/utils/adManager.js:175:26
     container.appendChild(adElement);
 
     // Push to AdSense
-    window.adsbygoogle = window.adsbygoogle || [];
+    window.adsbygoogle = false;
     window.adsbygoogle.push({});
 
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Ad already loaded in test-ad-container",

[Killed] BlockStatement
src/utils/adManager.js:208:18
  */
 export function showContainer(containerId) {
   const container = document.getElementById(containerId);
-  if (container) {
-    container.style.display = 'block';
-  }
+  if (container) {}
 }
 
killedBy: AdManager showContainer should show container
statusReason: expected 'none' to be 'block' // Object.is equality

[Killed] StringLiteral
src/utils/adManager.js:248:16
  */
 export function resetForNavigation() {
   loadedAds.clear();
-  logger.debug('[AdManager] Reset for navigation');
+  logger.debug("");
 }
 
killedBy: AdManager resetForNavigation should log debug message
statusReason: expected "vi.fn()" to be called with arguments: [ '[AdManager] Reset for navigation' ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Reset for navigation",

[Killed] BlockStatement
src/utils/adManager.js:263:26
 /**
  * Handle offline event - hide all ad containers
  */
-function handleOffline() {
-  logger.debug('[AdManager] Offline - hiding ads');
-  loadedAds.forEach(containerId => {
-    hideContainer(containerId);
-  });
-}
+function handleOffline() {}
 
 /**
killedBy: AdManager online/offline handlers should register handlers that hide containers on offline event
statusReason: expected "vi.fn()" to be called with arguments: [ '[AdManager] Offline - hiding ads' ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Offline - hiding ads",

[Killed] BlockStatement
src/utils/adManager.js:265:36
  */
 function handleOffline() {
   logger.debug('[AdManager] Offline - hiding ads');
-  loadedAds.forEach(containerId => {
-    hideContainer(containerId);
-  });
+  loadedAds.forEach(containerId => {});
 }
 
killedBy: AdManager online/offline handlers should register handlers that hide containers on offline event
statusReason: expected '' to be 'none' // Object.is equality

[Killed] BlockStatement
src/utils/adManager.js:274:33
  * Initialize the AdManager
  * Call this once when the app starts
  */
-export function initAdManager() {
-  // Set up online/offline listeners
-  onOnline(handleOnline);
-  onOffline(handleOffline);
-
-  logger.info('[AdManager] Initialized', {
-    publisherId: PUBLISHER_ID,
-    featureEnabled: isFeatureEnabled('SHOW_ADS'),
-    online: isOnline()
-  });
-}
+export function initAdManager() {}
 
 /**
killedBy: AdManager initAdManager should register online/offline listeners
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] StringLiteral
src/utils/adManager.js:279:15
   onOnline(handleOnline);
   onOffline(handleOffline);
 
-  logger.info('[AdManager] Initialized', {
+  logger.info("", {
     publisherId: PUBLISHER_ID,
     featureEnabled: isFeatureEnabled('SHOW_ADS'),
killedBy: AdManager initAdManager should log initialization info with correct details
statusReason: expected "vi.fn()" to be called with arguments: [ '[AdManager] Initialized', { …(3) } ]

Received: 

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] BlockStatement
src/utils/adManager.js:299:44
  * @param {string} slotKey - Key from AD_SLOTS
  * @param {string} slotId - The slot ID from AdSense
  */
-export function setAdSlot(slotKey, slotId) {
-  if (Object.hasOwn(AD_SLOTS, slotKey)) {
-    AD_SLOTS[slotKey] = slotId;
-    logger.info(`[AdManager] Set slot ${slotKey} = ${slotId}`);
-  } else {
-    logger.warn(`[AdManager] Unknown slot key: ${slotKey}`);
-  }
-}
+export function setAdSlot(slotKey, slotId) {}
 
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Ad already loaded in test-ad-container",

[Killed] ConditionalExpression
src/utils/adManager.js:300:7
  * @param {string} slotId - The slot ID from AdSense
  */
 export function setAdSlot(slotKey, slotId) {
-  if (Object.hasOwn(AD_SLOTS, slotKey)) {
+  if (true) {
     AD_SLOTS[slotKey] = slotId;
     logger.info(`[AdManager] Set slot ${slotKey} = ${slotId}`);
killedBy: AdManager setAdSlot should warn for unknown slot key
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/adManager.js:300:7
  * @param {string} slotId - The slot ID from AdSense
  */
 export function setAdSlot(slotKey, slotId) {
-  if (Object.hasOwn(AD_SLOTS, slotKey)) {
+  if (false) {
     AD_SLOTS[slotKey] = slotId;
     logger.info(`[AdManager] Set slot ${slotKey} = ${slotId}`);
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Ad already loaded in test-ad-container",

[Killed] BlockStatement
src/utils/adManager.js:303:10
   if (Object.hasOwn(AD_SLOTS, slotKey)) {
     AD_SLOTS[slotKey] = slotId;
     logger.info(`[AdManager] Set slot ${slotKey} = ${slotId}`);
-  } else {
-    logger.warn(`[AdManager] Unknown slot key: ${slotKey}`);
-  }
+  } else {}
 }
 
killedBy: AdManager setAdSlot should warn for unknown slot key
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
