[Survived] EqualityOperator
src/utils/telemetry.js:17:12
 
 // Configuration from environment variables
 const CONFIG = {
-  enabled: import.meta.env.VITE_TELEMETRY_ENABLED === 'true',
+  enabled: import.meta.env.VITE_TELEMETRY_ENABLED !== 'true',
   endpoint: import.meta.env.VITE_TELEMETRY_ENDPOINT || '',
   token: import.meta.env.VITE_TELEMETRY_TOKEN || '',

[Survived] ConditionalExpression
src/utils/telemetry.js:17:12
 
 // Configuration from environment variables
 const CONFIG = {
-  enabled: import.meta.env.VITE_TELEMETRY_ENABLED === 'true',
+  enabled: true,
   endpoint: import.meta.env.VITE_TELEMETRY_ENDPOINT || '',
   token: import.meta.env.VITE_TELEMETRY_TOKEN || '',

[Survived] ConditionalExpression
src/utils/telemetry.js:18:13
 // Configuration from environment variables
 const CONFIG = {
   enabled: import.meta.env.VITE_TELEMETRY_ENABLED === 'true',
-  endpoint: import.meta.env.VITE_TELEMETRY_ENDPOINT || '',
+  endpoint: false,
   token: import.meta.env.VITE_TELEMETRY_TOKEN || '',
   batchSize: parseInt(import.meta.env.VITE_TELEMETRY_BATCH_SIZE, 10) || 10,

[Survived] ConditionalExpression
src/utils/telemetry.js:18:13
 // Configuration from environment variables
 const CONFIG = {
   enabled: import.meta.env.VITE_TELEMETRY_ENABLED === 'true',
-  endpoint: import.meta.env.VITE_TELEMETRY_ENDPOINT || '',
+  endpoint: true,
   token: import.meta.env.VITE_TELEMETRY_TOKEN || '',
   batchSize: parseInt(import.meta.env.VITE_TELEMETRY_BATCH_SIZE, 10) || 10,

[Survived] ConditionalExpression
src/utils/telemetry.js:19:10
 const CONFIG = {
   enabled: import.meta.env.VITE_TELEMETRY_ENABLED === 'true',
   endpoint: import.meta.env.VITE_TELEMETRY_ENDPOINT || '',
-  token: import.meta.env.VITE_TELEMETRY_TOKEN || '',
+  token: false,
   batchSize: parseInt(import.meta.env.VITE_TELEMETRY_BATCH_SIZE, 10) || 10,
   flushInterval: parseInt(import.meta.env.VITE_TELEMETRY_FLUSH_INTERVAL, 10) || 30000

[Survived] ConditionalExpression
src/utils/telemetry.js:19:10
 const CONFIG = {
   enabled: import.meta.env.VITE_TELEMETRY_ENABLED === 'true',
   endpoint: import.meta.env.VITE_TELEMETRY_ENDPOINT || '',
-  token: import.meta.env.VITE_TELEMETRY_TOKEN || '',
+  token: true,
   batchSize: parseInt(import.meta.env.VITE_TELEMETRY_BATCH_SIZE, 10) || 10,
   flushInterval: parseInt(import.meta.env.VITE_TELEMETRY_FLUSH_INTERVAL, 10) || 30000

[Survived] ConditionalExpression
src/utils/telemetry.js:20:14
   enabled: import.meta.env.VITE_TELEMETRY_ENABLED === 'true',
   endpoint: import.meta.env.VITE_TELEMETRY_ENDPOINT || '',
   token: import.meta.env.VITE_TELEMETRY_TOKEN || '',
-  batchSize: parseInt(import.meta.env.VITE_TELEMETRY_BATCH_SIZE, 10) || 10,
+  batchSize: false,
   flushInterval: parseInt(import.meta.env.VITE_TELEMETRY_FLUSH_INTERVAL, 10) || 30000
 };

[Survived] ConditionalExpression
src/utils/telemetry.js:20:14
   enabled: import.meta.env.VITE_TELEMETRY_ENABLED === 'true',
   endpoint: import.meta.env.VITE_TELEMETRY_ENDPOINT || '',
   token: import.meta.env.VITE_TELEMETRY_TOKEN || '',
-  batchSize: parseInt(import.meta.env.VITE_TELEMETRY_BATCH_SIZE, 10) || 10,
+  batchSize: true,
   flushInterval: parseInt(import.meta.env.VITE_TELEMETRY_FLUSH_INTERVAL, 10) || 30000
 };

[Survived] ConditionalExpression
src/utils/telemetry.js:21:18
   endpoint: import.meta.env.VITE_TELEMETRY_ENDPOINT || '',
   token: import.meta.env.VITE_TELEMETRY_TOKEN || '',
   batchSize: parseInt(import.meta.env.VITE_TELEMETRY_BATCH_SIZE, 10) || 10,
-  flushInterval: parseInt(import.meta.env.VITE_TELEMETRY_FLUSH_INTERVAL, 10) || 30000
+  flushInterval: true
 };
 

[Survived] ConditionalExpression
src/utils/telemetry.js:21:18
   endpoint: import.meta.env.VITE_TELEMETRY_ENDPOINT || '',
   token: import.meta.env.VITE_TELEMETRY_TOKEN || '',
   batchSize: parseInt(import.meta.env.VITE_TELEMETRY_BATCH_SIZE, 10) || 10,
-  flushInterval: parseInt(import.meta.env.VITE_TELEMETRY_FLUSH_INTERVAL, 10) || 30000
+  flushInterval: false
 };
 

[Killed] BlockStatement
src/utils/telemetry.js:32:17
  * Singleton pattern - use the exported `telemetry` instance
  */
 class TelemetryClient {
-  constructor() {
-    this.queue = [];
-    this.flushTimer = null;
-    this.sessionId = this._generateSessionId();
-
-    // Load any events saved from previous offline session
-    this._loadOfflineQueue();
-
-    // Start flush timer if enabled
-    if (this._isEnabled()) {
-      this._startFlushTimer();
-    }
-
-    // Flush on page unload to capture final events
-    if (typeof window !== 'undefined') {
-      window.addEventListener('beforeunload', () => this.flush());
-      window.addEventListener('visibilitychange', () => {
-        if (document.visibilityState === 'hidden') {
-          this.flush();
-        }
-      });
-    }
-  }
+  constructor() {}
 
   /**
killedBy: PartySession createSession (host) creates a session with quiz data
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
src/utils/telemetry.js:41:9
     this._loadOfflineQueue();
 
     // Start flush timer if enabled
-    if (this._isEnabled()) {
+    if (true) {
       this._startFlushTimer();
     }
killedBy: TelemetryClient auto-flush timer should not start timer when disabled
statusReason: expected { refed: true, …(4), …(1) } to be null

[Killed] BlockStatement
src/utils/telemetry.js:41:28
     this._loadOfflineQueue();
 
     // Start flush timer if enabled
-    if (this._isEnabled()) {
-      this._startFlushTimer();
-    }
+    if (this._isEnabled()) {}
 
     // Flush on page unload to capture final events
killedBy: TelemetryClient auto-flush timer should flush after interval
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] ConditionalExpression
src/utils/telemetry.js:46:9
     }
 
     // Flush on page unload to capture final events
-    if (typeof window !== 'undefined') {
+    if (true) {
       window.addEventListener('beforeunload', () => this.flush());
       window.addEventListener('visibilitychange', () => {

[Survived] BlockStatement
src/utils/telemetry.js:46:40
     }
 
     // Flush on page unload to capture final events
-    if (typeof window !== 'undefined') {
-      window.addEventListener('beforeunload', () => this.flush());
-      window.addEventListener('visibilitychange', () => {
-        if (document.visibilityState === 'hidden') {
-          this.flush();
-        }
-      });
-    }
+    if (typeof window !== 'undefined') {}
   }
 

[Survived] ArrowFunction
src/utils/telemetry.js:47:47
 
     // Flush on page unload to capture final events
     if (typeof window !== 'undefined') {
-      window.addEventListener('beforeunload', () => this.flush());
+      window.addEventListener('beforeunload', () => undefined);
       window.addEventListener('visibilitychange', () => {
         if (document.visibilityState === 'hidden') {

[Survived] StringLiteral
src/utils/telemetry.js:47:31
 
     // Flush on page unload to capture final events
     if (typeof window !== 'undefined') {
-      window.addEventListener('beforeunload', () => this.flush());
+      window.addEventListener("", () => this.flush());
       window.addEventListener('visibilitychange', () => {
         if (document.visibilityState === 'hidden') {

[NoCoverage] BlockStatement
src/utils/telemetry.js:48:57
     // Flush on page unload to capture final events
     if (typeof window !== 'undefined') {
       window.addEventListener('beforeunload', () => this.flush());
-      window.addEventListener('visibilitychange', () => {
-        if (document.visibilityState === 'hidden') {
-          this.flush();
-        }
-      });
+      window.addEventListener('visibilitychange', () => {});
     }
   }

[NoCoverage] ConditionalExpression
src/utils/telemetry.js:49:13
     if (typeof window !== 'undefined') {
       window.addEventListener('beforeunload', () => this.flush());
       window.addEventListener('visibilitychange', () => {
-        if (document.visibilityState === 'hidden') {
+        if (false) {
           this.flush();
         }

[NoCoverage] ConditionalExpression
src/utils/telemetry.js:49:13
     if (typeof window !== 'undefined') {
       window.addEventListener('beforeunload', () => this.flush());
       window.addEventListener('visibilitychange', () => {
-        if (document.visibilityState === 'hidden') {
+        if (true) {
           this.flush();
         }

[Killed] BlockStatement
src/utils/telemetry.js:60:16
    * Check if telemetry is enabled (via environment variable)
    * @returns {boolean}
    */
-  _isEnabled() {
-    return CONFIG.enabled;
-  }
+  _isEnabled() {}
 
   /**
killedBy: TelemetryClient track() should add event to queue when enabled
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/utils/telemetry.js:68:15
    * Public method to check if telemetry is enabled
    * @returns {boolean}
    */
-  isEnabled() {
-    return this._isEnabled();
-  }
+  isEnabled() {}
 
   /**
killedBy: TelemetryClient isEnabled should return true when enabled
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/utils/telemetry.js:76:24
    * Generate a unique session ID for correlating events
    * @returns {string}
    */
-  _generateSessionId() {
-    return `${Date.now()}-${Math.random().toString(36).substring(2, 9)}`;
-  }
+  _generateSessionId() {}
 
   /**
killedBy: TelemetryClient session ID should generate unique session ID
statusReason: expected undefined to be defined

[Killed] MethodExpression
src/utils/telemetry.js:77:29
    * @returns {string}
    */
   _generateSessionId() {
-    return `${Date.now()}-${Math.random().toString(36).substring(2, 9)}`;
+    return `${Date.now()}-${Math.random().toString(36)}`;
   }
 
killedBy: TelemetryClient _generateSessionId should generate session ID with random suffix
statusReason: expected '0.r6x81q6ccmh' to match /^[a-z0-9]+$/

[Killed] StringLiteral
src/utils/telemetry.js:77:12
    * @returns {string}
    */
   _generateSessionId() {
-    return `${Date.now()}-${Math.random().toString(36).substring(2, 9)}`;
+    return ``;
   }
 
killedBy: TelemetryClient session ID should generate unique session ID
statusReason: expected '' not to be '' // Object.is equality

[Killed] BlockStatement
src/utils/telemetry.js:83:23
   /**
    * Load any queued events from localStorage (offline recovery)
    */
-  _loadOfflineQueue() {
-    try {
-      const saved = localStorage.getItem(STORAGE_KEY);
-      if (saved) {
-        const parsed = JSON.parse(saved);
-        if (Array.isArray(parsed)) {
-          this.queue = parsed;
-          localStorage.removeItem(STORAGE_KEY);
-        }
-      }
-    } catch {
-      // Ignore localStorage errors (private browsing, etc.)
-    }
-  }
+  _loadOfflineQueue() {}
 
   /**
killedBy: TelemetryClient offline queue should load saved queue on initialization
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/utils/telemetry.js:84:9
    * Load any queued events from localStorage (offline recovery)
    */
   _loadOfflineQueue() {
-    try {
-      const saved = localStorage.getItem(STORAGE_KEY);
-      if (saved) {
-        const parsed = JSON.parse(saved);
-        if (Array.isArray(parsed)) {
-          this.queue = parsed;
-          localStorage.removeItem(STORAGE_KEY);
-        }
-      }
-    } catch {
+    try {} catch {
       // Ignore localStorage errors (private browsing, etc.)
     }
killedBy: TelemetryClient offline queue should load saved queue on initialization
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/utils/telemetry.js:86:18
   _loadOfflineQueue() {
     try {
       const saved = localStorage.getItem(STORAGE_KEY);
-      if (saved) {
-        const parsed = JSON.parse(saved);
-        if (Array.isArray(parsed)) {
-          this.queue = parsed;
-          localStorage.removeItem(STORAGE_KEY);
-        }
-      }
+      if (saved) {}
     } catch {
       // Ignore localStorage errors (private browsing, etc.)
killedBy: TelemetryClient offline queue should load saved queue on initialization
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/utils/telemetry.js:88:36
       const saved = localStorage.getItem(STORAGE_KEY);
       if (saved) {
         const parsed = JSON.parse(saved);
-        if (Array.isArray(parsed)) {
-          this.queue = parsed;
-          localStorage.removeItem(STORAGE_KEY);
-        }
+        if (Array.isArray(parsed)) {}
       }
     } catch {
killedBy: TelemetryClient offline queue should load saved queue on initialization
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/utils/telemetry.js:88:13
       const saved = localStorage.getItem(STORAGE_KEY);
       if (saved) {
         const parsed = JSON.parse(saved);
-        if (Array.isArray(parsed)) {
+        if (false) {
           this.queue = parsed;
           localStorage.removeItem(STORAGE_KEY);
killedBy: TelemetryClient offline queue should load saved queue on initialization
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/utils/telemetry.js:101:23
   /**
    * Save queue to localStorage for offline recovery
    */
-  _saveOfflineQueue() {
-    try {
-      if (this.queue.length > 0) {
-        localStorage.setItem(STORAGE_KEY, JSON.stringify(this.queue));
-      }
-    } catch {
-      // Ignore localStorage errors
-    }
-  }
+  _saveOfflineQueue() {}
 
   /**
killedBy: TelemetryClient offline queue should save to localStorage on send failure
statusReason: expected "vi.fn()" to be called with arguments: [ 'saberloop_telemetry_queue', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/utils/telemetry.js:102:9
    * Save queue to localStorage for offline recovery
    */
   _saveOfflineQueue() {
-    try {
-      if (this.queue.length > 0) {
-        localStorage.setItem(STORAGE_KEY, JSON.stringify(this.queue));
-      }
-    } catch {
+    try {} catch {
       // Ignore localStorage errors
     }
killedBy: TelemetryClient offline queue should save to localStorage on send failure
statusReason: expected "vi.fn()" to be called with arguments: [ 'saberloop_telemetry_queue', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/utils/telemetry.js:103:34
    */
   _saveOfflineQueue() {
     try {
-      if (this.queue.length > 0) {
-        localStorage.setItem(STORAGE_KEY, JSON.stringify(this.queue));
-      }
+      if (this.queue.length > 0) {}
     } catch {
       // Ignore localStorage errors
killedBy: TelemetryClient offline queue should save to localStorage on send failure
statusReason: expected "vi.fn()" to be called with arguments: [ 'saberloop_telemetry_queue', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/telemetry.js:103:11
    */
   _saveOfflineQueue() {
     try {
-      if (this.queue.length > 0) {
+      if (false) {
         localStorage.setItem(STORAGE_KEY, JSON.stringify(this.queue));
       }
killedBy: TelemetryClient offline queue should save to localStorage on send failure
statusReason: expected "vi.fn()" to be called with arguments: [ 'saberloop_telemetry_queue', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/utils/telemetry.js:114:22
   /**
    * Start the automatic flush timer
    */
-  _startFlushTimer() {
-    if (this.flushTimer) {
-      clearInterval(this.flushTimer);
-    }
-    this.flushTimer = setInterval(() => this.flush(), CONFIG.flushInterval);
-  }
+  _startFlushTimer() {}
 
   /**
killedBy: TelemetryClient auto-flush timer should flush after interval
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] ConditionalExpression
src/utils/telemetry.js:115:9
    * Start the automatic flush timer
    */
   _startFlushTimer() {
-    if (this.flushTimer) {
+    if (true) {
       clearInterval(this.flushTimer);
     }

[Survived] ConditionalExpression
src/utils/telemetry.js:115:9
    * Start the automatic flush timer
    */
   _startFlushTimer() {
-    if (this.flushTimer) {
+    if (false) {
       clearInterval(this.flushTimer);
     }

[Killed] ArrowFunction
src/utils/telemetry.js:118:35
     if (this.flushTimer) {
       clearInterval(this.flushTimer);
     }
-    this.flushTimer = setInterval(() => this.flush(), CONFIG.flushInterval);
+    this.flushTimer = setInterval(() => undefined, CONFIG.flushInterval);
   }
 
killedBy: TelemetryClient auto-flush timer should flush after interval
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/utils/telemetry.js:124:21
   /**
    * Stop the flush timer
    */
-  _stopFlushTimer() {
-    if (this.flushTimer) {
-      clearInterval(this.flushTimer);
-      this.flushTimer = null;
-    }
-  }
+  _stopFlushTimer() {}
 
   /**
killedBy: TelemetryClient _startFlushTimer edge cases should not clear interval if flushTimer is null
statusReason: expected { refed: true, …(4), …(1) } to be null

[Killed] BlockStatement
src/utils/telemetry.js:125:26
    * Stop the flush timer
    */
   _stopFlushTimer() {
-    if (this.flushTimer) {
-      clearInterval(this.flushTimer);
-      this.flushTimer = null;
-    }
+    if (this.flushTimer) {}
   }
 
killedBy: TelemetryClient _startFlushTimer edge cases should not clear interval if flushTimer is null
statusReason: expected { refed: true, …(4), …(1) } to be null

[Killed] ConditionalExpression
src/utils/telemetry.js:125:9
    * Stop the flush timer
    */
   _stopFlushTimer() {
-    if (this.flushTimer) {
+    if (false) {
       clearInterval(this.flushTimer);
       this.flushTimer = null;
killedBy: TelemetryClient _startFlushTimer edge cases should not clear interval if flushTimer is null
statusReason: expected { refed: true, …(4), …(1) } to be null

[Killed] BlockStatement
src/utils/telemetry.js:136:26
    * @param {string} type - Event type: 'log', 'error', 'metric', 'event'
    * @param {Object} data - Event data
    */
-  track(type, data = {}) {
-    if (!this._isEnabled()) {
-      return;
-    }
-
-    const event = {
-      type,
-      data,
-      timestamp: new Date().toISOString(),
-      sessionId: this.sessionId,
-      url: typeof window !== 'undefined' ? window.location.href : '',
-      userAgent: typeof navigator !== 'undefined' ? navigator.userAgent : ''
-    };
-
-    this.queue.push(event);
-
-    // Flush if batch size reached
-    if (this.queue.length >= CONFIG.batchSize) {
-      this.flush();
-    }
-  }
+  track(type, data = {}) {}
 
   /**
killedBy: TelemetryClient track() should add event to queue when enabled
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/utils/telemetry.js:137:9
    * @param {Object} data - Event data
    */
   track(type, data = {}) {
-    if (!this._isEnabled()) {
+    if (false) {
       return;
     }
killedBy: TelemetryClient track() should not add event when env var is disabled
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/utils/telemetry.js:137:29
    * @param {Object} data - Event data
    */
   track(type, data = {}) {
-    if (!this._isEnabled()) {
-      return;
-    }
+    if (!this._isEnabled()) {}
 
     const event = {
killedBy: TelemetryClient track() should not add event when env var is disabled
statusReason: expected 1 to be +0 // Object.is equality

[Survived] ConditionalExpression
src/utils/telemetry.js:146:12
       data,
       timestamp: new Date().toISOString(),
       sessionId: this.sessionId,
-      url: typeof window !== 'undefined' ? window.location.href : '',
+      url: false ? window.location.href : '',
       userAgent: typeof navigator !== 'undefined' ? navigator.userAgent : ''
     };

[Survived] ConditionalExpression
src/utils/telemetry.js:146:12
       data,
       timestamp: new Date().toISOString(),
       sessionId: this.sessionId,
-      url: typeof window !== 'undefined' ? window.location.href : '',
+      url: true ? window.location.href : '',
       userAgent: typeof navigator !== 'undefined' ? navigator.userAgent : ''
     };

[Survived] ConditionalExpression
src/utils/telemetry.js:147:18
       timestamp: new Date().toISOString(),
       sessionId: this.sessionId,
       url: typeof window !== 'undefined' ? window.location.href : '',
-      userAgent: typeof navigator !== 'undefined' ? navigator.userAgent : ''
+      userAgent: false ? navigator.userAgent : ''
     };
 

[Survived] EqualityOperator
src/utils/telemetry.js:147:18
       timestamp: new Date().toISOString(),
       sessionId: this.sessionId,
       url: typeof window !== 'undefined' ? window.location.href : '',
-      userAgent: typeof navigator !== 'undefined' ? navigator.userAgent : ''
+      userAgent: typeof navigator === 'undefined' ? navigator.userAgent : ''
     };
 

[Killed] EqualityOperator
src/utils/telemetry.js:153:9
     this.queue.push(event);
 
     // Flush if batch size reached
-    if (this.queue.length >= CONFIG.batchSize) {
+    if (this.queue.length > CONFIG.batchSize) {
       this.flush();
     }
killedBy: TelemetryClient track() should auto-flush when batch size is reached
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/utils/telemetry.js:153:9
     this.queue.push(event);
 
     // Flush if batch size reached
-    if (this.queue.length >= CONFIG.batchSize) {
+    if (false) {
       this.flush();
     }
killedBy: TelemetryClient track() should auto-flush when batch size is reached
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/utils/telemetry.js:163:9
    * @returns {Promise<boolean>} - Success status
    */
   async flush() {
-    if (!this._isEnabled() || this.queue.length === 0) {
+    if (true) {
       return true;
     }
killedBy: TelemetryClient track() should auto-flush when batch size is reached
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/utils/telemetry.js:163:9
    * @returns {Promise<boolean>} - Success status
    */
   async flush() {
-    if (!this._isEnabled() || this.queue.length === 0) {
+    if (false) {
       return true;
     }
killedBy: TelemetryClient flush() should not send if queue is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "https://test.example.com/telemetry",

[Killed] BooleanLiteral
src/utils/telemetry.js:164:14
    */
   async flush() {
     if (!this._isEnabled() || this.queue.length === 0) {
-      return true;
+      return false;
     }
 
killedBy: TelemetryClient flush edge cases should return true immediately if disabled
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/telemetry.js:168:9
     }
 
     // Don't flush if no endpoint configured
-    if (!CONFIG.endpoint) {
+    if (false) {
       console.warn('[Telemetry] No endpoint configured');
       return false;
killedBy: TelemetryClient flush edge cases should return false when no endpoint configured
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/telemetry.js:168:9
     }
 
     // Don't flush if no endpoint configured
-    if (!CONFIG.endpoint) {
+    if (CONFIG.endpoint) {
       console.warn('[Telemetry] No endpoint configured');
       return false;
killedBy: TelemetryClient track() should auto-flush when batch size is reached
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/utils/telemetry.js:170:14
     // Don't flush if no endpoint configured
     if (!CONFIG.endpoint) {
       console.warn('[Telemetry] No endpoint configured');
-      return false;
+      return true;
     }
 
killedBy: TelemetryClient flush edge cases should return false when no endpoint configured
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
src/utils/telemetry.js:174:26
     }
 
     // Take current queue and clear it (so new events go to fresh queue)
-    const eventsToSend = [...this.queue];
+    const eventsToSend = [];
     this.queue = [];
 
killedBy: TelemetryClient offline queue should save to localStorage on send failure
statusReason: expected "vi.fn()" to be called with arguments: [ 'saberloop_telemetry_queue', …(1) ]

Number of calls: 0

[Killed] ArrayDeclaration
src/utils/telemetry.js:175:18
 
     // Take current queue and clear it (so new events go to fresh queue)
     const eventsToSend = [...this.queue];
-    this.queue = [];
+    this.queue = ["Stryker was here"];
 
     try {
killedBy: TelemetryClient flush() should clear queue after successful flush
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/utils/telemetry.js:177:9
     const eventsToSend = [...this.queue];
     this.queue = [];
 
-    try {
-      const response = await fetch(CONFIG.endpoint, {
-        method: 'POST',
-        headers: {
-          'Content-Type': 'application/json',
-          'X-Telemetry-Token': CONFIG.token
-        },
-        body: JSON.stringify({
-          events: eventsToSend,
-          sentAt: new Date().toISOString()
-        })
-      });
-
-      if (!response.ok) {
-        throw new Error(`HTTP ${response.status}`);
-      }
-
-      // Success - events are sent
-      return true;
-    } catch (error) {
+    try {} catch (error) {
       // Failed - put events back in queue and save to localStorage
       this.queue = [...eventsToSend, ...this.queue];
killedBy: TelemetryClient track() should auto-flush when batch size is reached
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/utils/telemetry.js:195:14
       }
 
       // Success - events are sent
-      return true;
+      return false;
     } catch (error) {
       // Failed - put events back in queue and save to localStorage
killedBy: TelemetryClient flush() should return true on success
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/telemetry.js:196:21
 
       // Success - events are sent
       return true;
-    } catch (error) {
-      // Failed - put events back in queue and save to localStorage
-      this.queue = [...eventsToSend, ...this.queue];
-      this._saveOfflineQueue();
-      console.warn('[Telemetry] Failed to send, saved to offline queue:', error.message);
-      return false;
-    }
+    } catch (error) {}
   }
 
killedBy: TelemetryClient flush() should return false on failure
statusReason: expected undefined to be false // Object.is equality

[Killed] ArrayDeclaration
src/utils/telemetry.js:198:20
       return true;
     } catch (error) {
       // Failed - put events back in queue and save to localStorage
-      this.queue = [...eventsToSend, ...this.queue];
+      this.queue = [];
       this._saveOfflineQueue();
       console.warn('[Telemetry] Failed to send, saved to offline queue:', error.message);
killedBy: TelemetryClient offline queue should save to localStorage on send failure
statusReason: expected "vi.fn()" to be called with arguments: [ 'saberloop_telemetry_queue', …(1) ]

Number of calls: 0

[Killed] BooleanLiteral
src/utils/telemetry.js:201:14
       this.queue = [...eventsToSend, ...this.queue];
       this._saveOfflineQueue();
       console.warn('[Telemetry] Failed to send, saved to offline queue:', error.message);
-      return false;
+      return true;
     }
   }
killedBy: TelemetryClient flush() should return false on failure
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/telemetry.js:209:18
    * Get current queue size (useful for debugging/testing)
    * @returns {number}
    */
-  getQueueSize() {
-    return this.queue.length;
-  }
+  getQueueSize() {}
 
   /**
killedBy: TelemetryClient track() should add event to queue when enabled
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/utils/telemetry.js:216:16
   /**
    * Clear the queue (useful for testing)
    */
-  clearQueue() {
-    this.queue = [];
-    try {
-      localStorage.removeItem(STORAGE_KEY);
-    } catch {
-      // Ignore
-    }
-  }
+  clearQueue() {}
 }
 
killedBy: TelemetryClient clearQueue() should clear in-memory queue
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/utils/telemetry.js:218:9
    */
   clearQueue() {
     this.queue = [];
-    try {
-      localStorage.removeItem(STORAGE_KEY);
-    } catch {
+    try {} catch {
       // Ignore
     }
killedBy: TelemetryClient clearQueue() should clear localStorage queue
statusReason: expected "vi.fn()" to be called with arguments: [ 'saberloop_telemetry_queue' ]

Number of calls: 0
