[Killed] BlockStatement
src/utils/errorHandler.js:9:49
    */
   export function initErrorHandling() {
     // Catch uncaught JavaScript errors
-    window.addEventListener('error', (event) => {
-      const errorData = {
-        message: event.message,
-        filename: event.filename,
-        line: event.lineno,
-        column: event.colno
-      };
-
-      logger.error('Uncaught error', errorData);
-
-      // Direct telemetry call for critical errors (backup if logger fails)
-      telemetry.track('error', {
-        type: 'uncaught',
-        ...errorData
-      });
-
-      showErrorNotification('An unexpected error occurred.');
-      return false;
-    });
+    window.addEventListener('error', (event) => {});
 
     // Catch unhandled promise rejections
killedBy: Error Handler initErrorHandling should log and track uncaught errors
statusReason: expected "vi.fn()" to be called with arguments: [ 'Uncaught error', { …(4) } ]

Number of calls: 0

[Killed] ObjectLiteral
src/utils/errorHandler.js:10:25
   export function initErrorHandling() {
     // Catch uncaught JavaScript errors
     window.addEventListener('error', (event) => {
-      const errorData = {
-        message: event.message,
-        filename: event.filename,
-        line: event.lineno,
-        column: event.colno
-      };
+      const errorData = {};
 
       logger.error('Uncaught error', errorData);
killedBy: Error Handler initErrorHandling should log and track uncaught errors
statusReason: expected "vi.fn()" to be called with arguments: [ 'Uncaught error', { …(4) } ]

Received: 

  1st vi.fn() call:

  [
    "Uncaught error",

[Killed] BooleanLiteral
src/utils/errorHandler.js:26:14
       });
 
       showErrorNotification('An unexpected error occurred.');
-      return false;
+      return true;
     });
 
killedBy: Error Handler initErrorHandling should return false from error handler
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/errorHandler.js:30:62
     });
 
     // Catch unhandled promise rejections
-    window.addEventListener('unhandledrejection', (event) => {
-      const reason = event.reason?.message || String(event.reason);
-
-      logger.error('Unhandled promise rejection', { reason });
-
-      // Direct telemetry call for critical errors (backup if logger fails)
-      telemetry.track('error', {
-        type: 'unhandledrejection',
-        reason
-      });
-
-      showErrorNotification('Something went wrong. Please try again.');
-      event.preventDefault();
-    });
+    window.addEventListener('unhandledrejection', (event) => {});
 
     logger.info('Error handling initialized');
killedBy: Error Handler initErrorHandling should handle unhandled promise rejections with Error object
statusReason: expected "vi.fn()" to be called with arguments: [ 'Unhandled promise rejection', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/errorHandler.js:31:22
 
     // Catch unhandled promise rejections
     window.addEventListener('unhandledrejection', (event) => {
-      const reason = event.reason?.message || String(event.reason);
+      const reason = true;
 
       logger.error('Unhandled promise rejection', { reason });
killedBy: Error Handler initErrorHandling should handle unhandled promise rejections with Error object
statusReason: expected "vi.fn()" to be called with arguments: [ 'Unhandled promise rejection', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "Unhandled promise rejection",

[Killed] ConditionalExpression
src/utils/errorHandler.js:31:22
 
     // Catch unhandled promise rejections
     window.addEventListener('unhandledrejection', (event) => {
-      const reason = event.reason?.message || String(event.reason);
+      const reason = false;
 
       logger.error('Unhandled promise rejection', { reason });
killedBy: Error Handler initErrorHandling should handle unhandled promise rejections with Error object
statusReason: expected "vi.fn()" to be called with arguments: [ 'Unhandled promise rejection', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "Unhandled promise rejection",

[Killed] ObjectLiteral
src/utils/errorHandler.js:33:51
     window.addEventListener('unhandledrejection', (event) => {
       const reason = event.reason?.message || String(event.reason);
 
-      logger.error('Unhandled promise rejection', { reason });
+      logger.error('Unhandled promise rejection', {});
 
       // Direct telemetry call for critical errors (backup if logger fails)
killedBy: Error Handler initErrorHandling should handle unhandled promise rejections with Error object
statusReason: expected "vi.fn()" to be called with arguments: [ 'Unhandled promise rejection', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "Unhandled promise rejection",

[Killed] StringLiteral
src/utils/errorHandler.js:33:20
     window.addEventListener('unhandledrejection', (event) => {
       const reason = event.reason?.message || String(event.reason);
 
-      logger.error('Unhandled promise rejection', { reason });
+      logger.error("", { reason });
 
       // Direct telemetry call for critical errors (backup if logger fails)
killedBy: Error Handler initErrorHandling should handle unhandled promise rejections with Error object
statusReason: expected "vi.fn()" to be called with arguments: [ 'Unhandled promise rejection', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Unhandled promise rejection",

[Killed] StringLiteral
src/utils/errorHandler.js:36:23
       logger.error('Unhandled promise rejection', { reason });
 
       // Direct telemetry call for critical errors (backup if logger fails)
-      telemetry.track('error', {
+      telemetry.track("", {
         type: 'unhandledrejection',
         reason
killedBy: Error Handler initErrorHandling should handle unhandled promise rejections with Error object
statusReason: expected "vi.fn()" to be called with arguments: [ 'error', { …(2) } ]

Received: 

  1st vi.fn() call:

  [
-   "error",

[Killed] StringLiteral
src/utils/errorHandler.js:41:29
         reason
       });
 
-      showErrorNotification('Something went wrong. Please try again.');
+      showErrorNotification("");
       event.preventDefault();
     });
killedBy: Error Handler initErrorHandling should create error notification on unhandled rejection
statusReason: expected '\n      \n        error\n        \n  …' to contain 'Something went wrong'

[Killed] ConditionalExpression
src/utils/errorHandler.js:54:9
   function showErrorNotification(message) {
     // Remove existing notification if any
     const existing = document.getElementById('error-notification');
-    if (existing) existing.remove();
+    if (true) existing.remove();
 
     const notification = document.createElement('div');
killedBy: Error Handler initErrorHandling should log and track uncaught errors
statusReason: Cannot read properties of null (reading 'remove')

[Killed] ConditionalExpression
src/utils/errorHandler.js:54:9
   function showErrorNotification(message) {
     // Remove existing notification if any
     const existing = document.getElementById('error-notification');
-    if (existing) existing.remove();
+    if (false) existing.remove();
 
     const notification = document.createElement('div');
killedBy: Error Handler showErrorNotification (via initErrorHandling) should remove existing notification before showing new one
statusReason: expected 2 to be 1 // Object.is equality

[Killed] StringLiteral
src/utils/errorHandler.js:56:49
     const existing = document.getElementById('error-notification');
     if (existing) existing.remove();
 
-    const notification = document.createElement('div');
+    const notification = document.createElement("");
     notification.id = 'error-notification';
     notification.className = `
killedBy: Error Handler initErrorHandling should log and track uncaught errors
statusReason: "" did not match the Name production

[Killed] StringLiteral
src/utils/errorHandler.js:57:23
     if (existing) existing.remove();
 
     const notification = document.createElement('div');
-    notification.id = 'error-notification';
+    notification.id = "";
     notification.className = `
       fixed top-4 left-4 right-4 bg-red-500 text-white p-4 rounded-xl
killedBy: Error Handler initErrorHandling should create error notification on uncaught error
statusReason: expected null to be truthy

[Survived] StringLiteral
src/utils/errorHandler.js:58:30
 
     const notification = document.createElement('div');
     notification.id = 'error-notification';
-    notification.className = `
-      fixed top-4 left-4 right-4 bg-red-500 text-white p-4 rounded-xl
-      shadow-lg z-50 flex items-center justify-between
-    `;
+    notification.className = ``;
     notification.innerHTML = `
       <div class="flex items-center gap-2">

[Killed] BlockStatement
src/utils/errorHandler.js:74:22
     document.body.appendChild(notification);
 
     // Auto-dismiss after 5 seconds
-    setTimeout(() => {
-      if (notification.parentElement) {
-        notification.remove();
-      }
-    }, 5000);
+    setTimeout(() => {}, 5000);
   }
 
killedBy: Error Handler showErrorNotification (via initErrorHandling) should auto-dismiss notification after 5 seconds
statusReason: expected <div id="error-notification" …(1)>…(2)</div> to be falsy

[Killed] ConditionalExpression
src/utils/errorHandler.js:75:11
 
     // Auto-dismiss after 5 seconds
     setTimeout(() => {
-      if (notification.parentElement) {
+      if (false) {
         notification.remove();
       }
killedBy: Error Handler showErrorNotification (via initErrorHandling) should auto-dismiss notification after 5 seconds
statusReason: expected <div id="error-notification" …(1)>…(2)</div> to be falsy

[Killed] BlockStatement
src/utils/errorHandler.js:75:39
 
     // Auto-dismiss after 5 seconds
     setTimeout(() => {
-      if (notification.parentElement) {
-        notification.remove();
-      }
+      if (notification.parentElement) {}
     }, 5000);
   }
killedBy: Error Handler showErrorNotification (via initErrorHandling) should auto-dismiss notification after 5 seconds
statusReason: expected <div id="error-notification" …(1)>…(2)</div> to be falsy

[Killed] LogicalOperator
src/utils/errorHandler.js:94:9
     });
 
     // Return user-friendly messages based on error type
-    if (error.message.includes('network') || error.message.includes('fetch') ||
+    if (error.message.includes('network') && error.message.includes('fetch') ||
   error.message.includes('Failed to fetch')) {
       return 'Network error. Please check your connection.';
killedBy: Error Handler handleApiError should return network error message for network errors
statusReason: expected 'An error occurred. Please try again.' to contain 'Network error'

[Killed] ConditionalExpression
src/utils/errorHandler.js:94:9
     });
 
     // Return user-friendly messages based on error type
-    if (error.message.includes('network') || error.message.includes('fetch') ||
-  error.message.includes('Failed to fetch')) {
+    if (false) {
       return 'Network error. Please check your connection.';
     }
killedBy: Error Handler handleApiError should return network error message for fetch errors
statusReason: expected 'An error occurred. Please try again.' to contain 'Network error'

[Killed] BlockStatement
src/utils/errorHandler.js:95:46
 
     // Return user-friendly messages based on error type
     if (error.message.includes('network') || error.message.includes('fetch') ||
-  error.message.includes('Failed to fetch')) {
-      return 'Network error. Please check your connection.';
-    }
+  error.message.includes('Failed to fetch')) {}
 
     if (error.message.includes('API key') || error.message.includes('401')) {
killedBy: Error Handler handleApiError should return network error message for fetch errors
statusReason: expected 'An error occurred. Please try again.' to contain 'Network error'

[Killed] ConditionalExpression
src/utils/errorHandler.js:99:9
       return 'Network error. Please check your connection.';
     }
 
-    if (error.message.includes('API key') || error.message.includes('401')) {
+    if (false) {
       return 'API key error. Please check your settings.';
     }
killedBy: Error Handler handleApiError should return API key message for 401 errors
statusReason: expected 'An error occurred. Please try again.' to contain 'API key'

[Killed] BlockStatement
src/utils/errorHandler.js:99:77
       return 'Network error. Please check your connection.';
     }
 
-    if (error.message.includes('API key') || error.message.includes('401')) {
-      return 'API key error. Please check your settings.';
-    }
+    if (error.message.includes('API key') || error.message.includes('401')) {}
 
     if (error.message.includes('Rate limit') || error.message.includes('429')) {
killedBy: Error Handler handleApiError should return API key message for 401 errors
statusReason: expected 'An error occurred. Please try again.' to contain 'API key'

[Killed] StringLiteral
src/utils/errorHandler.js:100:14
     }
 
     if (error.message.includes('API key') || error.message.includes('401')) {
-      return 'API key error. Please check your settings.';
+      return "";
     }
 
killedBy: Error Handler handleApiError should return API key message for 401 errors
statusReason: expected '' to contain 'API key'

[Killed] ConditionalExpression
src/utils/errorHandler.js:103:9
       return 'API key error. Please check your settings.';
     }
 
-    if (error.message.includes('Rate limit') || error.message.includes('429')) {
+    if (true) {
       return 'Rate limit reached. Please try again later.';
     }
killedBy: Error Handler handleApiError should return timeout message for timeout errors
statusReason: expected 'Rate limit reached. Please try again …' to contain 'timed out'

[Killed] BlockStatement
src/utils/errorHandler.js:103:80
       return 'API key error. Please check your settings.';
     }
 
-    if (error.message.includes('Rate limit') || error.message.includes('429')) {
-      return 'Rate limit reached. Please try again later.';
-    }
+    if (error.message.includes('Rate limit') || error.message.includes('429')) {}
 
     if (error.message.includes('timeout') || error.message.includes('Timeout')) {
killedBy: Error Handler handleApiError should return rate limit message for 429 errors
statusReason: expected 'An error occurred. Please try again.' to contain 'Rate limit'

[Killed] StringLiteral
src/utils/errorHandler.js:104:14
     }
 
     if (error.message.includes('Rate limit') || error.message.includes('429')) {
-      return 'Rate limit reached. Please try again later.';
+      return "";
     }
 
killedBy: Error Handler handleApiError should return rate limit message for 429 errors
statusReason: expected '' to contain 'Rate limit'

[Killed] LogicalOperator
src/utils/errorHandler.js:107:9
       return 'Rate limit reached. Please try again later.';
     }
 
-    if (error.message.includes('timeout') || error.message.includes('Timeout')) {
+    if (error.message.includes('timeout') && error.message.includes('Timeout')) {
       return 'Request timed out. Please try again.';
     }
killedBy: Error Handler handleApiError should return timeout message for timeout errors
statusReason: expected 'An error occurred. Please try again.' to contain 'timed out'

[Killed] ConditionalExpression
src/utils/errorHandler.js:107:9
       return 'Rate limit reached. Please try again later.';
     }
 
-    if (error.message.includes('timeout') || error.message.includes('Timeout')) {
+    if (false) {
       return 'Request timed out. Please try again.';
     }
killedBy: Error Handler handleApiError should return timeout message for timeout errors
statusReason: expected 'An error occurred. Please try again.' to contain 'timed out'
