[Killed] UnaryOperator
src/utils/formatters.js:47:23
   // Use Intl.RelativeTimeFormat for recent dates
   if (diffDays < 7) {
     const rtf = new Intl.RelativeTimeFormat(locale, { numeric: 'auto' });
-    return rtf.format(-diffDays, 'day');
+    return rtf.format(+diffDays, 'day');
   }
 
killedBy: Formatters formatRelativeDate should use Intl.RelativeTimeFormat for 2-6 days ago
statusReason: expected 'in 3 days' to contain 'ago'
