[Killed] BlockStatement
src/utils/network.js:12:30
    * Check if browser is currently online
    * @returns {boolean} True if online, false if offline
    */
-  export function isOnline() {
-    return navigator.onLine;
-  }
+  export function isOnline() {}
 
   /**
killedBy: Network Utilities isOnline function should return true when navigator is online
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/utils/network.js:20:38
    * Listen for when browser goes online
    * @param {EventListener} callback - Function to call when online
    */
-  export function onOnline(callback) {
-    window.addEventListener('online', callback);
-  }
+  export function onOnline(callback) {}
 
   /**
killedBy: Network Utilities Event listener functions onOnline should register listener that fires when going online
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/utils/network.js:28:39
    * Listen for when browser goes offline
    * @param {EventListener} callback - Function to call when offline
    */
-  export function onOffline(callback) {
-    window.addEventListener('offline', callback);
-  }
+  export function onOffline(callback) {}
 
   /**
killedBy: Network Utilities Event listener functions onOffline should register listener that fires when going offline
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/utils/network.js:36:44
    * Update the network status indicator dot
    * Call this whenever network status changes
    */
-  export function updateNetworkIndicator() {
-    const indicator = document.getElementById('networkStatusDot');
-
-    if (!indicator) return; // Indicator not on this view
-
-    if (isOnline()) {
-      // Online: green dot
-      indicator.className = 'absolute -top-0.5 -right-0.5 w-3 h-3 bg-green-500 rounded-full border-2 border-background-light dark:border-background-dark';
-    } else {
-      // Offline: orange dot
-      indicator.className = 'absolute -top-0.5 -right-0.5 w-3 h-3 bg-orange-500 rounded-full border-2 border-background-light  dark:border-background-dark';
-    }
-  }
+  export function updateNetworkIndicator() {}
 
   /**
killedBy: Network Utilities updateNetworkIndicator function should set green class when online
statusReason: expected '' to contain 'bg-green-500'

[Killed] ConditionalExpression
src/utils/network.js:39:9
   export function updateNetworkIndicator() {
     const indicator = document.getElementById('networkStatusDot');
 
-    if (!indicator) return; // Indicator not on this view
+    if (false) return; // Indicator not on this view
 
     if (isOnline()) {
killedBy: Network Utilities updateNetworkIndicator function should not crash when indicator element is missing
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot set properties of n…' was thrown

[Killed] BooleanLiteral
src/utils/network.js:39:9
   export function updateNetworkIndicator() {
     const indicator = document.getElementById('networkStatusDot');
 
-    if (!indicator) return; // Indicator not on this view
+    if (indicator) return; // Indicator not on this view
 
     if (isOnline()) {
killedBy: Network Utilities updateNetworkIndicator function should set green class when online
statusReason: expected '' to contain 'bg-green-500'

[Killed] ConditionalExpression
src/utils/network.js:41:9
 
     if (!indicator) return; // Indicator not on this view
 
-    if (isOnline()) {
+    if (false) {
       // Online: green dot
       indicator.className = 'absolute -top-0.5 -right-0.5 w-3 h-3 bg-green-500 rounded-full border-2 border-background-light dark:border-background-dark';
killedBy: Network Utilities updateNetworkIndicator function should set green class when online
statusReason: expected 'absolute -top-0.5 -right-0.5 w-3 h-3 …' to contain 'bg-green-500'

[Killed] ConditionalExpression
src/utils/network.js:41:9
 
     if (!indicator) return; // Indicator not on this view
 
-    if (isOnline()) {
+    if (true) {
       // Online: green dot
       indicator.className = 'absolute -top-0.5 -right-0.5 w-3 h-3 bg-green-500 rounded-full border-2 border-background-light dark:border-background-dark';
killedBy: Network Utilities updateNetworkIndicator function should set orange class when offline
statusReason: expected 'absolute -top-0.5 -right-0.5 w-3 h-3 …' to contain 'bg-orange-500'

[Killed] BlockStatement
src/utils/network.js:44:12
     if (isOnline()) {
       // Online: green dot
       indicator.className = 'absolute -top-0.5 -right-0.5 w-3 h-3 bg-green-500 rounded-full border-2 border-background-light dark:border-background-dark';
-    } else {
-      // Offline: orange dot
-      indicator.className = 'absolute -top-0.5 -right-0.5 w-3 h-3 bg-orange-500 rounded-full border-2 border-background-light  dark:border-background-dark';
-    }
+    } else {}
   }
 
killedBy: Network Utilities updateNetworkIndicator function should set orange class when offline
statusReason: expected '' to contain 'bg-orange-500'

[Killed] StringLiteral
src/utils/network.js:46:29
       indicator.className = 'absolute -top-0.5 -right-0.5 w-3 h-3 bg-green-500 rounded-full border-2 border-background-light dark:border-background-dark';
     } else {
       // Offline: orange dot
-      indicator.className = 'absolute -top-0.5 -right-0.5 w-3 h-3 bg-orange-500 rounded-full border-2 border-background-light  dark:border-background-dark';
+      indicator.className = "";
     }
   }
killedBy: Network Utilities updateNetworkIndicator function should set orange class when offline
statusReason: expected '' to contain 'bg-orange-500'

[Killed] BlockStatement
src/utils/network.js:54:37
    * Update the offline UI elements (banner and button)
    * Call this whenever network status changes
    */
-  export function updateOfflineUI() {
-    const banner = document.getElementById('offlineBanner');
-    const button = /** @type {HTMLButtonElement} */ (document.getElementById('startQuizBtn'));
-
-    if (isOnline()) {
-      // Online: hide banner, enable button
-      if (banner) banner.classList.add('hidden');
-      if (button) button.disabled = false;
-    } else {
-      // Offline: show banner, disable button
-      if (banner) banner.classList.remove('hidden');
-      if (button) button.disabled = true;
-    }
-  }  
+  export function updateOfflineUI() {}  
 
   /**
killedBy: Network Utilities updateOfflineUI function should hide banner and enable button when online
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/network.js:58:21
     const banner = document.getElementById('offlineBanner');
     const button = /** @type {HTMLButtonElement} */ (document.getElementById('startQuizBtn'));
 
-    if (isOnline()) {
-      // Online: hide banner, enable button
-      if (banner) banner.classList.add('hidden');
-      if (button) button.disabled = false;
-    } else {
+    if (isOnline()) {} else {
       // Offline: show banner, disable button
       if (banner) banner.classList.remove('hidden');
killedBy: Network Utilities updateOfflineUI function should hide banner and enable button when online
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/network.js:60:11
 
     if (isOnline()) {
       // Online: hide banner, enable button
-      if (banner) banner.classList.add('hidden');
+      if (true) banner.classList.add('hidden');
       if (button) button.disabled = false;
     } else {
killedBy: Network Utilities updateOfflineUI function should handle both elements missing gracefully
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/utils/network.js:60:11
 
     if (isOnline()) {
       // Online: hide banner, enable button
-      if (banner) banner.classList.add('hidden');
+      if (false) banner.classList.add('hidden');
       if (button) button.disabled = false;
     } else {
killedBy: Network Utilities updateOfflineUI function should hide banner and enable button when online
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/network.js:61:11
     if (isOnline()) {
       // Online: hide banner, enable button
       if (banner) banner.classList.add('hidden');
-      if (button) button.disabled = false;
+      if (true) button.disabled = false;
     } else {
       // Offline: show banner, disable button
killedBy: Network Utilities updateOfflineUI function should handle both elements missing gracefully
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot set properties of n…' was thrown

[Killed] BooleanLiteral
src/utils/network.js:61:37
     if (isOnline()) {
       // Online: hide banner, enable button
       if (banner) banner.classList.add('hidden');
-      if (button) button.disabled = false;
+      if (button) button.disabled = true;
     } else {
       // Offline: show banner, disable button
killedBy: Network Utilities updateOfflineUI function should hide banner and enable button when online
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/network.js:62:12
       // Online: hide banner, enable button
       if (banner) banner.classList.add('hidden');
       if (button) button.disabled = false;
-    } else {
-      // Offline: show banner, disable button
-      if (banner) banner.classList.remove('hidden');
-      if (button) button.disabled = true;
-    }
+    } else {}
   }  
 
killedBy: Network Utilities updateOfflineUI function should show banner and disable button when offline
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/network.js:64:11
       if (button) button.disabled = false;
     } else {
       // Offline: show banner, disable button
-      if (banner) banner.classList.remove('hidden');
+      if (false) banner.classList.remove('hidden');
       if (button) button.disabled = true;
     }
killedBy: Network Utilities updateOfflineUI function should show banner and disable button when offline
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/network.js:64:11
       if (button) button.disabled = false;
     } else {
       // Offline: show banner, disable button
-      if (banner) banner.classList.remove('hidden');
+      if (true) banner.classList.remove('hidden');
       if (button) button.disabled = true;
     }
killedBy: Network Utilities updateOfflineUI function should handle missing banner element gracefully
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BooleanLiteral
src/utils/network.js:65:37
     } else {
       // Offline: show banner, disable button
       if (banner) banner.classList.remove('hidden');
-      if (button) button.disabled = true;
+      if (button) button.disabled = false;
     }
   }  
killedBy: Network Utilities updateOfflineUI function should show banner and disable button when offline
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/network.js:65:11
     } else {
       // Offline: show banner, disable button
       if (banner) banner.classList.remove('hidden');
-      if (button) button.disabled = true;
+      if (true) button.disabled = true;
     }
   }  
killedBy: Network Utilities updateOfflineUI function should handle missing button element gracefully
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot set properties of n…' was thrown

[Killed] BlockStatement
src/utils/network.js:73:43
    * Initialize network status monitoring
    * Call this once when app starts
    */
-  export function initNetworkMonitoring() {
-    
-    // Update UI on initial load
-    updateNetworkIndicator();
-    updateOfflineUI();
-
-    // Listen for network changes
-    onOnline(() => {
-      updateNetworkIndicator();
-      updateOfflineUI();
-    });
-    onOffline(() => {
-      updateNetworkIndicator();
-      updateOfflineUI();
-    });
-
-    logger.info('Network monitoring initialized');
-  }
+  export function initNetworkMonitoring() {}
killedBy: Network Utilities initNetworkMonitoring should update network indicator on initialization
statusReason: expected '' to contain 'bg-green-500'

[Killed] BlockStatement
src/utils/network.js:80:20
     updateOfflineUI();
 
     // Listen for network changes
-    onOnline(() => {
-      updateNetworkIndicator();
-      updateOfflineUI();
-    });
+    onOnline(() => {});
     onOffline(() => {
       updateNetworkIndicator();
killedBy: Network Utilities initNetworkMonitoring should update UI when going online
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/network.js:84:21
       updateNetworkIndicator();
       updateOfflineUI();
     });
-    onOffline(() => {
-      updateNetworkIndicator();
-      updateOfflineUI();
-    });
+    onOffline(() => {});
 
     logger.info('Network monitoring initialized');
killedBy: Network Utilities initNetworkMonitoring should update UI when going offline
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/utils/network.js:89:17
       updateOfflineUI();
     });
 
-    logger.info('Network monitoring initialized');
+    logger.info("");
   }
killedBy: Network Utilities initNetworkMonitoring should log initialization message
statusReason: expected "vi.fn()" to be called with arguments: [ 'Network monitoring initialized' ]

Received: 

  1st vi.fn() call:

  [
-   "Network monitoring initialized",
