[Killed] EqualityOperator
src/utils/retry.js:41:25
   const config = { ...DEFAULT_OPTIONS, ...options };
   let lastError;
 
-  for (let attempt = 1; attempt <= config.maxRetries; attempt++) {
+  for (let attempt = 1; attempt < config.maxRetries; attempt++) {
     try {
       return await fn();
killedBy: OpenRouter Client callOpenRouter should throw error on 429 (rate limit) after retries
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times

[Killed] ConditionalExpression
src/utils/retry.js:41:25
   const config = { ...DEFAULT_OPTIONS, ...options };
   let lastError;
 
-  for (let attempt = 1; attempt <= config.maxRetries; attempt++) {
+  for (let attempt = 1; false; attempt++) {
     try {
       return await fn();
killedBy: OpenRouter Client callOpenRouter should call fetch with correct URL
statusReason: Cannot read properties of undefined (reading 'response')

[Killed] BlockStatement
src/utils/retry.js:42:9
   let lastError;
 
   for (let attempt = 1; attempt <= config.maxRetries; attempt++) {
-    try {
-      return await fn();
-    } catch (error) {
+    try {} catch (error) {
       lastError = error;
 
killedBy: OpenRouter Client callOpenRouter should call fetch with correct URL
statusReason: Cannot read properties of undefined (reading 'response')

[Killed] LogicalOperator
src/utils/retry.js:51:11
       const shouldRetry = config.shouldRetry(error);
 
       // Don't retry if it's the last attempt or error is not retryable
-      if (attempt >= config.maxRetries || !shouldRetry) {
+      if (attempt >= config.maxRetries && !shouldRetry) {
         throw error;
       }
killedBy: OpenRouter Client callOpenRouter should throw error on 401 (invalid API key)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/utils/retry.js:51:11
       const shouldRetry = config.shouldRetry(error);
 
       // Don't retry if it's the last attempt or error is not retryable
-      if (attempt >= config.maxRetries || !shouldRetry) {
+      if (attempt > config.maxRetries || !shouldRetry) {
         throw error;
       }
killedBy: retry utility withRetry gives up after max retries
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
src/utils/retry.js:56:21
       }
 
       // Calculate delay with exponential backoff
-      const delay = Math.min(
-        config.initialDelay * Math.pow(config.backoffMultiplier, attempt - 1),
-        config.maxDelay
-      );
+      const delay = Math.max(config.initialDelay * Math.pow(config.backoffMultiplier, attempt - 1), config.maxDelay);
 
       // Log retry attempt
killedBy: OpenRouter Client callOpenRouter should throw error on 429 (rate limit) after retries
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArithmeticOperator
src/utils/retry.js:57:9
 
       // Calculate delay with exponential backoff
       const delay = Math.min(
-        config.initialDelay * Math.pow(config.backoffMultiplier, attempt - 1),
+        config.initialDelay / Math.pow(config.backoffMultiplier, attempt - 1),
         config.maxDelay
       );
killedBy: retry utility withRetry uses exponential backoff delays
statusReason: expected "vi.fn()" to be called 2 times, but got 4 times

[Killed] ArithmeticOperator
src/utils/retry.js:57:66
 
       // Calculate delay with exponential backoff
       const delay = Math.min(
-        config.initialDelay * Math.pow(config.backoffMultiplier, attempt - 1),
+        config.initialDelay * Math.pow(config.backoffMultiplier, attempt + 1),
         config.maxDelay
       );
killedBy: OpenRouter Client callOpenRouter should throw error on 429 (rate limit) after retries
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ObjectLiteral
src/utils/retry.js:62:44
       );
 
       // Log retry attempt
-      logger.debug('Retrying after error', {
-        attempt,
-        maxRetries: config.maxRetries,
-        delay,
-        error: error.message
-      });
+      logger.debug('Retrying after error', {});
 
       // Call onRetry callback if provided

[Killed] BlockStatement
src/utils/retry.js:70:27
       });
 
       // Call onRetry callback if provided
-      if (config.onRetry) {
-        config.onRetry({ attempt, error, delay });
-      }
+      if (config.onRetry) {}
 
       // Wait before retrying
killedBy: retry utility withRetry calls onRetry callback with attempt info
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ConditionalExpression
src/utils/retry.js:70:11
       });
 
       // Call onRetry callback if provided
-      if (config.onRetry) {
+      if (true) {
         config.onRetry({ attempt, error, delay });
       }
killedBy: OpenRouter Client getCreditsBalance should return null on network error after retries
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
src/utils/retry.js:89:7
  */
 export function isRetryableError(error) {
   // Network errors (TypeError: Failed to fetch)
-  if (error instanceof TypeError && error.message.includes('fetch')) {
+  if (true) {
     return true;
   }
killedBy: OpenRouter Client getCreditsBalance should return null on API failure
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ConditionalExpression
src/utils/retry.js:89:7
  */
 export function isRetryableError(error) {
   // Network errors (TypeError: Failed to fetch)
-  if (error instanceof TypeError && error.message.includes('fetch')) {
+  if (false) {
     return true;
   }

[Killed] BooleanLiteral
src/utils/retry.js:90:12
 export function isRetryableError(error) {
   // Network errors (TypeError: Failed to fetch)
   if (error instanceof TypeError && error.message.includes('fetch')) {
-    return true;
+    return false;
   }
 
killedBy: retry utility isRetryableError returns true for network errors
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/utils/retry.js:94:7
   }
 
   // Generic network errors
-  if (error.message && error.message.toLowerCase().includes('network')) {
+  if (error.message || error.message.toLowerCase().includes('network')) {
     return true;
   }
killedBy: retry utility withRetry does not retry non-retryable errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/utils/retry.js:94:7
   }
 
   // Generic network errors
-  if (error.message && error.message.toLowerCase().includes('network')) {
+  if (true) {
     return true;
   }
killedBy: OpenRouter Client getCreditsBalance should return null on API failure
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/utils/retry.js:95:12
 
   // Generic network errors
   if (error.message && error.message.toLowerCase().includes('network')) {
-    return true;
+    return false;
   }
 
killedBy: OpenRouter Client getCreditsBalance should return null on network error after retries
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
src/utils/retry.js:100:7
 
   // Check HTTP status codes
   const status = error.status;
-  if (status) {
+  if (false) {
     // 5xx server errors are retryable
     if (status >= 500 && status < 600) {
killedBy: OpenRouter Client getCreditsBalance should return null on API failure
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/utils/retry.js:100:15
 
   // Check HTTP status codes
   const status = error.status;
-  if (status) {
-    // 5xx server errors are retryable
-    if (status >= 500 && status < 600) {
-      return true;
-    }
-
-    // 429 rate limit is retryable (with backoff)
-    if (status === 429) {
-      return true;
-    }
-
-    // 4xx client errors are NOT retryable (except 429)
-    if (status >= 400 && status < 500) {
-      return false;
-    }
-  }
+  if (status) {}
 
   // Default: retry on unknown errors
killedBy: retry utility withRetry does not retry non-retryable errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/utils/retry.js:102:9
   const status = error.status;
   if (status) {
     // 5xx server errors are retryable
-    if (status >= 500 && status < 600) {
+    if (status < 500 && status < 600) {
       return true;
     }
killedBy: OpenRouter Client getCreditsBalance should return null on API failure
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/utils/retry.js:102:9
   const status = error.status;
   if (status) {
     // 5xx server errors are retryable
-    if (status >= 500 && status < 600) {
+    if (true) {
       return true;
     }
killedBy: OpenRouter Client getCreditsBalance should return null on API failure
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/utils/retry.js:103:14
   if (status) {
     // 5xx server errors are retryable
     if (status >= 500 && status < 600) {
-      return true;
+      return false;
     }
 
killedBy: retry utility isRetryableError returns true for 5xx server errors
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utils/retry.js:107:9
     }
 
     // 429 rate limit is retryable (with backoff)
-    if (status === 429) {
+    if (status !== 429) {
       return true;
     }
killedBy: OpenRouter Client callOpenRouter should throw error on 429 (rate limit) after retries
statusReason: expected "vi.fn()" to be called 3 times, but got 1 times

[Killed] ConditionalExpression
src/utils/retry.js:107:9
     }
 
     // 429 rate limit is retryable (with backoff)
-    if (status === 429) {
+    if (false) {
       return true;
     }
killedBy: OpenRouter Client callOpenRouter should throw error on 429 (rate limit) after retries
statusReason: expected "vi.fn()" to be called 3 times, but got 1 times

[Killed] BooleanLiteral
src/utils/retry.js:108:14
 
     // 429 rate limit is retryable (with backoff)
     if (status === 429) {
-      return true;
+      return false;
     }
 
killedBy: OpenRouter Client callOpenRouter should throw error on 429 (rate limit) after retries
statusReason: expected "vi.fn()" to be called 3 times, but got 1 times

[Killed] EqualityOperator
src/utils/retry.js:112:9
     }
 
     // 4xx client errors are NOT retryable (except 429)
-    if (status >= 400 && status < 500) {
+    if (status < 400 && status < 500) {
       return false;
     }
killedBy: OpenRouter Client getCreditsBalance should return null on API failure
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/utils/retry.js:112:40
     }
 
     // 4xx client errors are NOT retryable (except 429)
-    if (status >= 400 && status < 500) {
-      return false;
-    }
+    if (status >= 400 && status < 500) {}
   }
 
killedBy: retry utility withRetry does not retry non-retryable errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/utils/retry.js:113:14
 
     // 4xx client errors are NOT retryable (except 429)
     if (status >= 400 && status < 500) {
-      return false;
+      return true;
     }
   }
killedBy: retry utility withRetry does not retry non-retryable errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/utils/retry.js:118:10
   }
 
   // Default: retry on unknown errors
-  return true;
+  return false;
 }
 
killedBy: retry utility withRetry uses exponential backoff delays
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] BlockStatement
src/utils/retry.js:126:20
  * @param {number} ms - Duration in milliseconds
  * @returns {Promise<void>}
  */
-function sleep(ms) {
-  return new Promise(resolve => setTimeout(resolve, ms));
-}
+function sleep(ms) {}
 
killedBy: retry utility withRetry uses exponential backoff delays
statusReason: expected "vi.fn()" to be called 1 times, but got 4 times

[Killed] ArrowFunction
src/utils/retry.js:127:22
  * @returns {Promise<void>}
  */
 function sleep(ms) {
-  return new Promise(resolve => setTimeout(resolve, ms));
+  return new Promise(() => undefined);
 }
 
killedBy: retry utility withRetry retries on failure and eventually succeeds
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
