[Killed] StringLiteral
src/utils/share-image.js:40:16
   gradientStart: '#1a1a2e',
   gradientEnd: '#16213e',
   accent: '#e94560',
-  textPrimary: '#ffffff',
+  textPrimary: "",
   textSecondary: '#a0a0a0',
   badge: '#0f3460'
killedBy: Share Image Generator drawing functions coverage should set correct fillStyle for accent color
statusReason: expected [ …(7) ] to include '#ffffff'

[Killed] StringLiteral
src/utils/share-image.js:41:18
   gradientEnd: '#16213e',
   accent: '#e94560',
   textPrimary: '#ffffff',
-  textSecondary: '#a0a0a0',
+  textSecondary: "",
   badge: '#0f3460'
 };
killedBy: Share Image Generator drawing functions coverage should set correct fillStyle for accent color
statusReason: expected [ …(7) ] to include '#a0a0a0'

[Killed] BlockStatement
src/utils/share-image.js:50:37
  * @param {CanvasRenderingContext2D} ctx - Canvas context
  * @param {Rect} rect - Rectangle dimensions
  */
-function drawRoundedRect(ctx, rect) {
-  const { x, y, width, height, radius } = rect;
-  ctx.beginPath();
-  ctx.moveTo(x + radius, y);
-  ctx.lineTo(x + width - radius, y);
-  ctx.quadraticCurveTo(x + width, y, x + width, y + radius);
-  ctx.lineTo(x + width, y + height - radius);
-  ctx.quadraticCurveTo(x + width, y + height, x + width - radius, y + height);
-  ctx.lineTo(x + radius, y + height);
-  ctx.quadraticCurveTo(x, y + height, x, y + height - radius);
-  ctx.lineTo(x, y + radius);
-  ctx.quadraticCurveTo(x, y, x + radius, y);
-  ctx.closePath();
-}
+function drawRoundedRect(ctx, rect) {}
 
 /**
killedBy: Share Image Generator drawing functions coverage should draw rounded rect for badge
statusReason: expected "vi.fn()" to be called at least once

[Survived] ArithmeticOperator
src/utils/share-image.js:53:14
 function drawRoundedRect(ctx, rect) {
   const { x, y, width, height, radius } = rect;
   ctx.beginPath();
-  ctx.moveTo(x + radius, y);
+  ctx.moveTo(x - radius, y);
   ctx.lineTo(x + width - radius, y);
   ctx.quadraticCurveTo(x + width, y, x + width, y + radius);

[Survived] ArithmeticOperator
src/utils/share-image.js:54:14
   const { x, y, width, height, radius } = rect;
   ctx.beginPath();
   ctx.moveTo(x + radius, y);
-  ctx.lineTo(x + width - radius, y);
+  ctx.lineTo(x + width + radius, y);
   ctx.quadraticCurveTo(x + width, y, x + width, y + radius);
   ctx.lineTo(x + width, y + height - radius);

[Survived] ArithmeticOperator
src/utils/share-image.js:54:14
   const { x, y, width, height, radius } = rect;
   ctx.beginPath();
   ctx.moveTo(x + radius, y);
-  ctx.lineTo(x + width - radius, y);
+  ctx.lineTo(x - width - radius, y);
   ctx.quadraticCurveTo(x + width, y, x + width, y + radius);
   ctx.lineTo(x + width, y + height - radius);

[Survived] ArithmeticOperator
src/utils/share-image.js:55:38
   ctx.beginPath();
   ctx.moveTo(x + radius, y);
   ctx.lineTo(x + width - radius, y);
-  ctx.quadraticCurveTo(x + width, y, x + width, y + radius);
+  ctx.quadraticCurveTo(x + width, y, x - width, y + radius);
   ctx.lineTo(x + width, y + height - radius);
   ctx.quadraticCurveTo(x + width, y + height, x + width - radius, y + height);

[Survived] ArithmeticOperator
src/utils/share-image.js:55:24
   ctx.beginPath();
   ctx.moveTo(x + radius, y);
   ctx.lineTo(x + width - radius, y);
-  ctx.quadraticCurveTo(x + width, y, x + width, y + radius);
+  ctx.quadraticCurveTo(x - width, y, x + width, y + radius);
   ctx.lineTo(x + width, y + height - radius);
   ctx.quadraticCurveTo(x + width, y + height, x + width - radius, y + height);

[Survived] ArithmeticOperator
src/utils/share-image.js:56:25
   ctx.moveTo(x + radius, y);
   ctx.lineTo(x + width - radius, y);
   ctx.quadraticCurveTo(x + width, y, x + width, y + radius);
-  ctx.lineTo(x + width, y + height - radius);
+  ctx.lineTo(x + width, y - height - radius);
   ctx.quadraticCurveTo(x + width, y + height, x + width - radius, y + height);
   ctx.lineTo(x + radius, y + height);

[Survived] ArithmeticOperator
src/utils/share-image.js:56:25
   ctx.moveTo(x + radius, y);
   ctx.lineTo(x + width - radius, y);
   ctx.quadraticCurveTo(x + width, y, x + width, y + radius);
-  ctx.lineTo(x + width, y + height - radius);
+  ctx.lineTo(x + width, y + height + radius);
   ctx.quadraticCurveTo(x + width, y + height, x + width - radius, y + height);
   ctx.lineTo(x + radius, y + height);

[Survived] ArithmeticOperator
src/utils/share-image.js:57:35
   ctx.lineTo(x + width - radius, y);
   ctx.quadraticCurveTo(x + width, y, x + width, y + radius);
   ctx.lineTo(x + width, y + height - radius);
-  ctx.quadraticCurveTo(x + width, y + height, x + width - radius, y + height);
+  ctx.quadraticCurveTo(x + width, y - height, x + width - radius, y + height);
   ctx.lineTo(x + radius, y + height);
   ctx.quadraticCurveTo(x, y + height, x, y + height - radius);

[Survived] ArithmeticOperator
src/utils/share-image.js:57:24
   ctx.lineTo(x + width - radius, y);
   ctx.quadraticCurveTo(x + width, y, x + width, y + radius);
   ctx.lineTo(x + width, y + height - radius);
-  ctx.quadraticCurveTo(x + width, y + height, x + width - radius, y + height);
+  ctx.quadraticCurveTo(x - width, y + height, x + width - radius, y + height);
   ctx.lineTo(x + radius, y + height);
   ctx.quadraticCurveTo(x, y + height, x, y + height - radius);

[Survived] ArithmeticOperator
src/utils/share-image.js:58:14
   ctx.quadraticCurveTo(x + width, y, x + width, y + radius);
   ctx.lineTo(x + width, y + height - radius);
   ctx.quadraticCurveTo(x + width, y + height, x + width - radius, y + height);
-  ctx.lineTo(x + radius, y + height);
+  ctx.lineTo(x - radius, y + height);
   ctx.quadraticCurveTo(x, y + height, x, y + height - radius);
   ctx.lineTo(x, y + radius);

[Survived] ArithmeticOperator
src/utils/share-image.js:58:26
   ctx.quadraticCurveTo(x + width, y, x + width, y + radius);
   ctx.lineTo(x + width, y + height - radius);
   ctx.quadraticCurveTo(x + width, y + height, x + width - radius, y + height);
-  ctx.lineTo(x + radius, y + height);
+  ctx.lineTo(x + radius, y - height);
   ctx.quadraticCurveTo(x, y + height, x, y + height - radius);
   ctx.lineTo(x, y + radius);

[Survived] ArithmeticOperator
src/utils/share-image.js:59:27
   ctx.lineTo(x + width, y + height - radius);
   ctx.quadraticCurveTo(x + width, y + height, x + width - radius, y + height);
   ctx.lineTo(x + radius, y + height);
-  ctx.quadraticCurveTo(x, y + height, x, y + height - radius);
+  ctx.quadraticCurveTo(x, y - height, x, y + height - radius);
   ctx.lineTo(x, y + radius);
   ctx.quadraticCurveTo(x, y, x + radius, y);

[Survived] ArithmeticOperator
src/utils/share-image.js:59:42
   ctx.lineTo(x + width, y + height - radius);
   ctx.quadraticCurveTo(x + width, y + height, x + width - radius, y + height);
   ctx.lineTo(x + radius, y + height);
-  ctx.quadraticCurveTo(x, y + height, x, y + height - radius);
+  ctx.quadraticCurveTo(x, y + height, x, y + height + radius);
   ctx.lineTo(x, y + radius);
   ctx.quadraticCurveTo(x, y, x + radius, y);

[Survived] ArithmeticOperator
src/utils/share-image.js:60:17
   ctx.quadraticCurveTo(x + width, y + height, x + width - radius, y + height);
   ctx.lineTo(x + radius, y + height);
   ctx.quadraticCurveTo(x, y + height, x, y + height - radius);
-  ctx.lineTo(x, y + radius);
+  ctx.lineTo(x, y - radius);
   ctx.quadraticCurveTo(x, y, x + radius, y);
   ctx.closePath();

[Survived] ArithmeticOperator
src/utils/share-image.js:61:30
   ctx.lineTo(x + radius, y + height);
   ctx.quadraticCurveTo(x, y + height, x, y + height - radius);
   ctx.lineTo(x, y + radius);
-  ctx.quadraticCurveTo(x, y, x + radius, y);
+  ctx.quadraticCurveTo(x, y, x - radius, y);
   ctx.closePath();
 }

[Killed] BlockStatement
src/utils/share-image.js:71:45
  * @param {number} width - Canvas width
  * @param {number} height - Canvas height
  */
-function drawBackground(ctx, width, height) {
-  const gradient = ctx.createLinearGradient(0, 0, width, height);
-  gradient.addColorStop(0, COLORS.gradientStart);
-  gradient.addColorStop(1, COLORS.gradientEnd);
-  ctx.fillStyle = gradient;
-  ctx.fillRect(0, 0, width, height);
-}
+function drawBackground(ctx, width, height) {}
 
 /**
killedBy: Share Image Generator generateShareImage should create background gradient
statusReason: expected "vi.fn()" to be called with arguments: [ +0, +0, 600, 400 ]

Number of calls: 0

[Killed] BlockStatement
src/utils/share-image.js:85:41
  * @param {number} centerX - Center X position
  * @param {number} y - Y position
  */
-function drawLogoBadge(ctx, centerX, y) {
-  const badgeWidth = 180;
-  const badgeHeight = 36;
-  const x = centerX - badgeWidth / 2;
-
-  // Badge background
-  ctx.fillStyle = COLORS.badge;
-  const badgeRect = { x, y, width: badgeWidth, height: badgeHeight, radius: 18 };
-  drawRoundedRect(ctx, badgeRect);
-  ctx.fill();
-
-  // Badge text
-  ctx.fillStyle = COLORS.textPrimary;
-  ctx.font = 'bold 18px system-ui, -apple-system, sans-serif';
-  ctx.textAlign = 'center';
-  ctx.textBaseline = 'middle';
-  ctx.fillText('SABERLOOP', centerX, y + badgeHeight / 2);
-}
+function drawLogoBadge(ctx, centerX, y) {}
 
 /**
killedBy: Share Image Generator generateShareImage should draw SABERLOOP badge
statusReason: expected "vi.fn()" to be called with arguments: [ 'SABERLOOP', Any<Number>, …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "SABERLOOP",

[Survived] ArithmeticOperator
src/utils/share-image.js:88:13
 function drawLogoBadge(ctx, centerX, y) {
   const badgeWidth = 180;
   const badgeHeight = 36;
-  const x = centerX - badgeWidth / 2;
+  const x = centerX + badgeWidth / 2;
 
   // Badge background

[Survived] ArithmeticOperator
src/utils/share-image.js:88:23
 function drawLogoBadge(ctx, centerX, y) {
   const badgeWidth = 180;
   const badgeHeight = 36;
-  const x = centerX - badgeWidth / 2;
+  const x = centerX - badgeWidth * 2;
 
   // Badge background

[Survived] StringLiteral
src/utils/share-image.js:98:14
 
   // Badge text
   ctx.fillStyle = COLORS.textPrimary;
-  ctx.font = 'bold 18px system-ui, -apple-system, sans-serif';
+  ctx.font = "";
   ctx.textAlign = 'center';
   ctx.textBaseline = 'middle';

[Survived] StringLiteral
src/utils/share-image.js:99:19
   // Badge text
   ctx.fillStyle = COLORS.textPrimary;
   ctx.font = 'bold 18px system-ui, -apple-system, sans-serif';
-  ctx.textAlign = 'center';
+  ctx.textAlign = "";
   ctx.textBaseline = 'middle';
   ctx.fillText('SABERLOOP', centerX, y + badgeHeight / 2);

[Killed] ArithmeticOperator
src/utils/share-image.js:101:42
   ctx.font = 'bold 18px system-ui, -apple-system, sans-serif';
   ctx.textAlign = 'center';
   ctx.textBaseline = 'middle';
-  ctx.fillText('SABERLOOP', centerX, y + badgeHeight / 2);
+  ctx.fillText('SABERLOOP', centerX, y + badgeHeight * 2);
 }
 
killedBy: Share Image Generator drawing functions coverage should draw all elements at specific Y positions
statusReason: expected 102 to be 48 // Object.is equality

[Killed] ArithmeticOperator
src/utils/share-image.js:101:38
   ctx.font = 'bold 18px system-ui, -apple-system, sans-serif';
   ctx.textAlign = 'center';
   ctx.textBaseline = 'middle';
-  ctx.fillText('SABERLOOP', centerX, y + badgeHeight / 2);
+  ctx.fillText('SABERLOOP', centerX, y - badgeHeight / 2);
 }
 
killedBy: Share Image Generator drawing functions coverage should draw all elements at specific Y positions
statusReason: expected 12 to be 48 // Object.is equality

[Killed] BlockStatement
src/utils/share-image.js:110:38
  * @param {number} centerX - Center X position
  * @param {number} y - Y position
  */
-function drawTrophy(ctx, centerX, y) {
-  ctx.font = '48px system-ui, -apple-system, sans-serif';
-  ctx.textAlign = 'center';
-  ctx.textBaseline = 'middle';
-  ctx.fillText('\u{1F3C6}', centerX, y);
-}
+function drawTrophy(ctx, centerX, y) {}
 
 /**
killedBy: Share Image Generator drawing functions coverage should draw trophy emoji
statusReason: expected undefined to be defined

[Survived] StringLiteral
src/utils/share-image.js:111:14
  * @param {number} y - Y position
  */
 function drawTrophy(ctx, centerX, y) {
-  ctx.font = '48px system-ui, -apple-system, sans-serif';
+  ctx.font = "";
   ctx.textAlign = 'center';
   ctx.textBaseline = 'middle';

[Survived] StringLiteral
src/utils/share-image.js:112:19
  */
 function drawTrophy(ctx, centerX, y) {
   ctx.font = '48px system-ui, -apple-system, sans-serif';
-  ctx.textAlign = 'center';
+  ctx.textAlign = "";
   ctx.textBaseline = 'middle';
   ctx.fillText('\u{1F3C6}', centerX, y);

[Killed] BlockStatement
src/utils/share-image.js:124:44
  * @param {number} centerX - Center X position
  * @param {number} y - Y position
  */
-function drawTopic(ctx, topic, centerX, y) {
-  // Truncate topic if too long
-  const maxLength = 25;
-  const displayTopic = topic.length > maxLength
-    ? topic.substring(0, maxLength - 3) + '...'
-    : topic;
-
-  ctx.fillStyle = COLORS.textPrimary;
-  ctx.font = 'bold 28px system-ui, -apple-system, sans-serif';
-  ctx.textAlign = 'center';
-  ctx.textBaseline = 'middle';
-  ctx.fillText(`${displayTopic} Quiz Master!`, centerX, y);
-}
+function drawTopic(ctx, topic, centerX, y) {}
 
 /**
killedBy: Share Image Generator generateShareImage should draw topic text
statusReason: expected "vi.fn()" to be called with arguments: [ 'History Quiz Master!', …(2) ]

Received: 

  1st vi.fn() call:

  [
-   "History Quiz Master!",

[Killed] ConditionalExpression
src/utils/share-image.js:127:24
 function drawTopic(ctx, topic, centerX, y) {
   // Truncate topic if too long
   const maxLength = 25;
-  const displayTopic = topic.length > maxLength
+  const displayTopic = true
     ? topic.substring(0, maxLength - 3) + '...'
     : topic;
killedBy: Share Image Generator generateShareImage should draw topic text
statusReason: expected "vi.fn()" to be called with arguments: [ 'History Quiz Master!', …(2) ]

Received: 

  1st vi.fn() call:

  [
-   "History Quiz Master!",

[Killed] ConditionalExpression
src/utils/share-image.js:127:24
 function drawTopic(ctx, topic, centerX, y) {
   // Truncate topic if too long
   const maxLength = 25;
-  const displayTopic = topic.length > maxLength
+  const displayTopic = false
     ? topic.substring(0, maxLength - 3) + '...'
     : topic;
killedBy: Share Image Generator generateShareImage should truncate long topic names
statusReason: expected undefined to be defined

[Killed] ArithmeticOperator
src/utils/share-image.js:128:26
   // Truncate topic if too long
   const maxLength = 25;
   const displayTopic = topic.length > maxLength
-    ? topic.substring(0, maxLength - 3) + '...'
+    ? topic.substring(0, maxLength + 3) + '...'
     : topic;
 
killedBy: Share Image Generator drawing functions coverage should truncate topic over 25 characters with ellipsis
statusReason: expected '12345678901234567890123456... Quiz Ma…' to contain '1234567890123456789012...'

[Killed] StringLiteral
src/utils/share-image.js:128:43
   // Truncate topic if too long
   const maxLength = 25;
   const displayTopic = topic.length > maxLength
-    ? topic.substring(0, maxLength - 3) + '...'
+    ? topic.substring(0, maxLength - 3) + ""
     : topic;
 
killedBy: Share Image Generator generateShareImage should truncate long topic names
statusReason: expected undefined to be defined

[Survived] StringLiteral
src/utils/share-image.js:133:19
 
   ctx.fillStyle = COLORS.textPrimary;
   ctx.font = 'bold 28px system-ui, -apple-system, sans-serif';
-  ctx.textAlign = 'center';
+  ctx.textAlign = "";
   ctx.textBaseline = 'middle';
   ctx.fillText(`${displayTopic} Quiz Master!`, centerX, y);

[Killed] StringLiteral
src/utils/share-image.js:135:16
   ctx.font = 'bold 28px system-ui, -apple-system, sans-serif';
   ctx.textAlign = 'center';
   ctx.textBaseline = 'middle';
-  ctx.fillText(`${displayTopic} Quiz Master!`, centerX, y);
+  ctx.fillText(``, centerX, y);
 }
 
killedBy: Share Image Generator generateShareImage should draw topic text
statusReason: expected "vi.fn()" to be called with arguments: [ 'History Quiz Master!', …(2) ]

Received: 

  1st vi.fn() call:

  [
-   "History Quiz Master!",

[Killed] BlockStatement
src/utils/share-image.js:145:48
  * @param {number} centerX - Center X position
  * @param {number} y - Y position
  */
-function drawScore(ctx, scoreData, centerX, y) {
-  const { score, total, percentage } = scoreData;
-  // Main score
-  ctx.fillStyle = COLORS.accent;
-  ctx.font = 'bold 64px system-ui, -apple-system, sans-serif';
-  ctx.textAlign = 'center';
-  ctx.textBaseline = 'middle';
-  ctx.fillText(`${score}/${total}`, centerX, y);
-
-  // Percentage below
-  ctx.fillStyle = COLORS.textSecondary;
-  ctx.font = '24px system-ui, -apple-system, sans-serif';
-  ctx.fillText(`${percentage}%`, centerX, y + 45);
-}
+function drawScore(ctx, scoreData, centerX, y) {}
 
 /**
killedBy: Share Image Generator generateShareImage should draw score
statusReason: expected "vi.fn()" to be called with arguments: [ '4/5', Any<Number>, Any<Number> ]

Received: 

  1st vi.fn() call:

  [
-   "4/5",

[Survived] StringLiteral
src/utils/share-image.js:151:22
   ctx.fillStyle = COLORS.accent;
   ctx.font = 'bold 64px system-ui, -apple-system, sans-serif';
   ctx.textAlign = 'center';
-  ctx.textBaseline = 'middle';
+  ctx.textBaseline = "";
   ctx.fillText(`${score}/${total}`, centerX, y);
 

[Killed] ArithmeticOperator
src/utils/share-image.js:157:43
   // Percentage below
   ctx.fillStyle = COLORS.textSecondary;
   ctx.font = '24px system-ui, -apple-system, sans-serif';
-  ctx.fillText(`${percentage}%`, centerX, y + 45);
+  ctx.fillText(`${percentage}%`, centerX, y - 45);
 }
 
killedBy: Share Image Generator drawing functions coverage should draw all elements at specific Y positions
statusReason: expected 215 to be 305 // Object.is equality

[Killed] StringLiteral
src/utils/share-image.js:157:16
   // Percentage below
   ctx.fillStyle = COLORS.textSecondary;
   ctx.font = '24px system-ui, -apple-system, sans-serif';
-  ctx.fillText(`${percentage}%`, centerX, y + 45);
+  ctx.fillText(``, centerX, y + 45);
 }
 
killedBy: Share Image Generator generateShareImage should draw score
statusReason: expected "vi.fn()" to be called with arguments: [ '80%', Any<Number>, Any<Number> ]

Received: 

  1st vi.fn() call:

  [
-   "80%",

[Killed] BlockStatement
src/utils/share-image.js:166:41
  * @param {number} centerX - Center X position
  * @param {number} y - Y position
  */
-function drawChallenge(ctx, centerX, y) {
-  ctx.fillStyle = COLORS.textSecondary;
-  ctx.font = '20px system-ui, -apple-system, sans-serif';
-  ctx.textAlign = 'center';
-  ctx.textBaseline = 'middle';
-  ctx.fillText('Can you beat my score?', centerX, y);
-}
+function drawChallenge(ctx, centerX, y) {}
 
 /**
killedBy: Share Image Generator generateShareImage should draw challenge text
statusReason: expected "vi.fn()" to be called with arguments: [ 'Can you beat my score?', …(2) ]

Received: 

  1st vi.fn() call:

  [
-   "Can you beat my score?",

[Survived] StringLiteral
src/utils/share-image.js:169:19
 function drawChallenge(ctx, centerX, y) {
   ctx.fillStyle = COLORS.textSecondary;
   ctx.font = '20px system-ui, -apple-system, sans-serif';
-  ctx.textAlign = 'center';
+  ctx.textAlign = "";
   ctx.textBaseline = 'middle';
   ctx.fillText('Can you beat my score?', centerX, y);

[Killed] StringLiteral
src/utils/share-image.js:171:16
   ctx.font = '20px system-ui, -apple-system, sans-serif';
   ctx.textAlign = 'center';
   ctx.textBaseline = 'middle';
-  ctx.fillText('Can you beat my score?', centerX, y);
+  ctx.fillText("", centerX, y);
 }
 
killedBy: Share Image Generator generateShareImage should draw challenge text
statusReason: expected "vi.fn()" to be called with arguments: [ 'Can you beat my score?', …(2) ]

Received: 

  1st vi.fn() call:

  [
-   "Can you beat my score?",

[Killed] ConditionalExpression
src/utils/share-image.js:189:7
   canvas.height = CANVAS_HEIGHT;
 
   const ctx = canvas.getContext('2d');
-  if (!ctx) {
+  if (true) {
     logger.error('Failed to get canvas 2D context');
     throw new Error('Canvas not supported');
killedBy: Share Image Generator generateShareImage should create canvas with correct dimensions
statusReason: Canvas not supported

[Killed] StringLiteral
src/utils/share-image.js:191:21
   const ctx = canvas.getContext('2d');
   if (!ctx) {
     logger.error('Failed to get canvas 2D context');
-    throw new Error('Canvas not supported');
+    throw new Error("");
   }
 
killedBy: Share Image Generator generateShareImage should throw error when canvas context not available
statusReason: expected [Function] to throw error including 'Canvas not supported' but got ''

[Killed] ArithmeticOperator
src/utils/share-image.js:194:19
     throw new Error('Canvas not supported');
   }
 
-  const centerX = CANVAS_WIDTH / 2;
+  const centerX = CANVAS_WIDTH * 2;
 
   // Draw all elements
killedBy: Share Image Generator drawing functions coverage should draw elements at centerX=300
statusReason: expected 1200 to be 300 // Object.is equality

[Killed] BlockStatement
src/utils/share-image.js:207:43
 
   logger.debug('Share image generated', { topic, score, total });
 
-  return new Promise((resolve, reject) => {
-    canvas.toBlob((blob) => {
-      if (blob) {
-        resolve(blob);
-      } else {
-        reject(new Error('Failed to create image blob'));
-      }
-    }, 'image/png');
-  });
+  return new Promise((resolve, reject) => {});
 }
 
killedBy: Share Image Generator generateShareImage should create canvas with correct dimensions
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/utils/share-image.js:208:29
   logger.debug('Share image generated', { topic, score, total });
 
   return new Promise((resolve, reject) => {
-    canvas.toBlob((blob) => {
-      if (blob) {
-        resolve(blob);
-      } else {
-        reject(new Error('Failed to create image blob'));
-      }
-    }, 'image/png');
+    canvas.toBlob((blob) => {}, 'image/png');
   });
 }
killedBy: Share Image Generator generateShareImage should create canvas with correct dimensions
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/utils/share-image.js:209:11
 
   return new Promise((resolve, reject) => {
     canvas.toBlob((blob) => {
-      if (blob) {
+      if (true) {
         resolve(blob);
       } else {
killedBy: Share Image Generator generateShareImage should reject when toBlob returns null
statusReason: promise resolved "null" instead of rejecting

[Killed] ConditionalExpression
src/utils/share-image.js:209:11
 
   return new Promise((resolve, reject) => {
     canvas.toBlob((blob) => {
-      if (blob) {
+      if (false) {
         resolve(blob);
       } else {
killedBy: Share Image Generator generateShareImage should create canvas with correct dimensions
statusReason: Failed to create image blob

[Killed] BlockStatement
src/utils/share-image.js:211:14
     canvas.toBlob((blob) => {
       if (blob) {
         resolve(blob);
-      } else {
-        reject(new Error('Failed to create image blob'));
-      }
+      } else {}
     }, 'image/png');
   });
killedBy: Share Image Generator generateShareImage should reject when toBlob returns null
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/utils/share-image.js:214:8
       } else {
         reject(new Error('Failed to create image blob'));
       }
-    }, 'image/png');
+    }, "");
   });
 }
killedBy: Share Image Generator generateShareImage should return PNG blob
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Function>, 'image/png' ]

Received: 

  1st vi.fn() call:

  [
-   Any<Function>,

[Killed] BlockStatement
src/utils/share-image.js:222:43
  * Get the dimensions used for share images
  * @returns {{width: number, height: number}} Image dimensions
  */
-export function getShareImageDimensions() {
-  return {
-    width: CANVAS_WIDTH,
-    height: CANVAS_HEIGHT
-  };
-}
+export function getShareImageDimensions() {}
 
killedBy: Share Image Generator getShareImageDimensions should return correct dimensions
statusReason: expected undefined to deeply equal { width: 600, height: 400 }
