[Killed] BlockStatement
src/utils/share.js:13:28
  * Check if the Web Share API is available
  * @returns {boolean} True if Web Share API is supported
  */
-export function canShare() {
-  return typeof navigator !== 'undefined' && typeof navigator.share === 'function';
-}
+export function canShare() {}
 
 /**
killedBy: Share Utilities canShare should return true when Web Share API is available
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/share.js:14:46
  * @returns {boolean} True if Web Share API is supported
  */
 export function canShare() {
-  return typeof navigator !== 'undefined' && typeof navigator.share === 'function';
+  return typeof navigator !== 'undefined' && true;
 }
 
killedBy: Share Utilities canShare should return false when share is not a function
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/share.js:14:10
  * @returns {boolean} True if Web Share API is supported
  */
 export function canShare() {
-  return typeof navigator !== 'undefined' && typeof navigator.share === 'function';
+  return true;
 }
 
killedBy: Share Utilities canShare should return false when navigator is undefined
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/share.js:21:33
  * Check if the Web Share API supports sharing files
  * @returns {boolean} True if file sharing is supported
  */
-export function canShareFiles() {
-  return canShare() && typeof navigator.canShare === 'function';
-}
+export function canShareFiles() {}
 
 /**
killedBy: Share Utilities canShareFiles should return true when canShare is available
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/utils/share.js:22:24
  * @returns {boolean} True if file sharing is supported
  */
 export function canShareFiles() {
-  return canShare() && typeof navigator.canShare === 'function';
+  return canShare() && typeof navigator.canShare !== 'function';
 }
 
killedBy: Share Utilities canShareFiles should return true when canShare is available
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/share.js:22:10
  * @returns {boolean} True if file sharing is supported
  */
 export function canShareFiles() {
-  return canShare() && typeof navigator.canShare === 'function';
+  return false;
 }
 
killedBy: Share Utilities canShareFiles should return true when canShare is available
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/share.js:33:58
  * @param {string} [options.url] - Share URL
  * @returns {Promise<boolean>} True if share was successful, false if cancelled/failed
  */
-export async function shareContent({ title, text, url }) {
-  if (!canShare()) {
-    logger.debug('Web Share API not available');
-    return false;
-  }
-
-  try {
-    await navigator.share({ title, text, url });
-    logger.debug('Content shared successfully');
-    telemetry.track('share_completed', { method: 'native' });
-    return true;
-  } catch (error) {
-    // User cancelled or share failed
-    if (error.name === 'AbortError') {
-      logger.debug('Share cancelled by user');
-      telemetry.track('share_cancelled', { method: 'native' });
-    } else {
-      logger.error('Share failed', { error: error.message });
-      telemetry.track('share_failed', { method: 'native', error: error.message });
-    }
-    return false;
-  }
-}
+export async function shareContent({ title, text, url }) {}
 
 /**
killedBy: Share Utilities shareContent should call navigator.share with correct options
statusReason: expected "vi.fn()" to be called with arguments: [ { title: 'Test Title', …(2) } ]

Number of calls: 0

[Killed] BooleanLiteral
src/utils/share.js:34:7
  * @returns {Promise<boolean>} True if share was successful, false if cancelled/failed
  */
 export async function shareContent({ title, text, url }) {
-  if (!canShare()) {
+  if (canShare()) {
     logger.debug('Web Share API not available');
     return false;
killedBy: Share Utilities shareContent should call navigator.share with correct options
statusReason: expected "vi.fn()" to be called with arguments: [ { title: 'Test Title', …(2) } ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/share.js:34:7
  * @returns {Promise<boolean>} True if share was successful, false if cancelled/failed
  */
 export async function shareContent({ title, text, url }) {
-  if (!canShare()) {
+  if (true) {
     logger.debug('Web Share API not available');
     return false;
killedBy: Share Utilities shareContent should call navigator.share with correct options
statusReason: expected "vi.fn()" to be called with arguments: [ { title: 'Test Title', …(2) } ]

Number of calls: 0

[Killed] BooleanLiteral
src/utils/share.js:36:12
 export async function shareContent({ title, text, url }) {
   if (!canShare()) {
     logger.debug('Web Share API not available');
-    return false;
+    return true;
   }
 
killedBy: Share Utilities shareContent should return false when Web Share API is not available
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/share.js:39:7
     return false;
   }
 
-  try {
-    await navigator.share({ title, text, url });
-    logger.debug('Content shared successfully');
-    telemetry.track('share_completed', { method: 'native' });
-    return true;
-  } catch (error) {
+  try {} catch (error) {
     // User cancelled or share failed
     if (error.name === 'AbortError') {
killedBy: Share Utilities shareContent should call navigator.share with correct options
statusReason: expected "vi.fn()" to be called with arguments: [ { title: 'Test Title', …(2) } ]

Number of calls: 0

[Survived] StringLiteral
src/utils/share.js:41:18
 
   try {
     await navigator.share({ title, text, url });
-    logger.debug('Content shared successfully');
+    logger.debug("");
     telemetry.track('share_completed', { method: 'native' });
     return true;

[Killed] BooleanLiteral
src/utils/share.js:43:12
     await navigator.share({ title, text, url });
     logger.debug('Content shared successfully');
     telemetry.track('share_completed', { method: 'native' });
-    return true;
+    return false;
   } catch (error) {
     // User cancelled or share failed
killedBy: Share Utilities shareContent should call navigator.share with correct options
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/share.js:44:19
     logger.debug('Content shared successfully');
     telemetry.track('share_completed', { method: 'native' });
     return true;
-  } catch (error) {
-    // User cancelled or share failed
-    if (error.name === 'AbortError') {
-      logger.debug('Share cancelled by user');
-      telemetry.track('share_cancelled', { method: 'native' });
-    } else {
-      logger.error('Share failed', { error: error.message });
-      telemetry.track('share_failed', { method: 'native', error: error.message });
-    }
-    return false;
-  }
+  } catch (error) {}
 }
 
killedBy: Share Utilities shareContent should return false when user cancels share
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/utils/share.js:46:38
     return true;
   } catch (error) {
     // User cancelled or share failed
-    if (error.name === 'AbortError') {
-      logger.debug('Share cancelled by user');
-      telemetry.track('share_cancelled', { method: 'native' });
-    } else {
+    if (error.name === 'AbortError') {} else {
       logger.error('Share failed', { error: error.message });
       telemetry.track('share_failed', { method: 'native', error: error.message });
killedBy: Share Utilities additional edge cases shareContent telemetry should track share_cancelled when user aborts
statusReason: expected "vi.fn()" to be called with arguments: [ 'share_cancelled', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/share.js:46:9
     return true;
   } catch (error) {
     // User cancelled or share failed
-    if (error.name === 'AbortError') {
+    if (false) {
       logger.debug('Share cancelled by user');
       telemetry.track('share_cancelled', { method: 'native' });
killedBy: Share Utilities additional edge cases shareContent telemetry should track share_cancelled when user aborts
statusReason: expected "vi.fn()" to be called with arguments: [ 'share_cancelled', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "share_cancelled",

[Killed] StringLiteral
src/utils/share.js:48:23
     // User cancelled or share failed
     if (error.name === 'AbortError') {
       logger.debug('Share cancelled by user');
-      telemetry.track('share_cancelled', { method: 'native' });
+      telemetry.track("", { method: 'native' });
     } else {
       logger.error('Share failed', { error: error.message });
killedBy: Share Utilities additional edge cases shareContent telemetry should track share_cancelled when user aborts
statusReason: expected "vi.fn()" to be called with arguments: [ 'share_cancelled', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "share_cancelled",

[Killed] BlockStatement
src/utils/share.js:49:12
     if (error.name === 'AbortError') {
       logger.debug('Share cancelled by user');
       telemetry.track('share_cancelled', { method: 'native' });
-    } else {
-      logger.error('Share failed', { error: error.message });
-      telemetry.track('share_failed', { method: 'native', error: error.message });
-    }
+    } else {}
     return false;
   }
killedBy: Share Utilities additional edge cases shareContent telemetry should track share_failed when share fails with error
statusReason: expected "vi.fn()" to be called with arguments: [ 'share_failed', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/share.js:68:7
  * @returns {Promise<boolean>} True if share was successful, false if cancelled/failed
  */
 export async function shareWithImage({ title, text, url, imageBlob, fileName = 'saberloop-score.png' }) {
-  if (!canShareFiles()) {
+  if (true) {
     logger.debug('File sharing not supported, falling back to text share');
     return shareContent({ title, text, url });
killedBy: Share Utilities shareWithImage should share with image when supported
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/utils/share.js:68:7
  * @returns {Promise<boolean>} True if share was successful, false if cancelled/failed
  */
 export async function shareWithImage({ title, text, url, imageBlob, fileName = 'saberloop-score.png' }) {
-  if (!canShareFiles()) {
+  if (canShareFiles()) {
     logger.debug('File sharing not supported, falling back to text share');
     return shareContent({ title, text, url });
killedBy: Share Utilities shareWithImage should share with image when supported
statusReason: expected "vi.fn()" to be called at least once

[Survived] ArrayDeclaration
src/utils/share.js:73:25
     return shareContent({ title, text, url });
   }
 
-  const file = new File([imageBlob], fileName, { type: imageBlob.type });
+  const file = new File([], fileName, { type: imageBlob.type });
   const shareData = { title, text, url, files: [file] };
 

[Killed] ConditionalExpression
src/utils/share.js:77:7
   const shareData = { title, text, url, files: [file] };
 
   // Check if this specific share is supported
-  if (!navigator.canShare(shareData)) {
+  if (true) {
     logger.debug('Cannot share this content with files, falling back to text');
     return shareContent({ title, text, url });
killedBy: Share Utilities shareWithImage should share with image when supported
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/utils/share.js:77:7
   const shareData = { title, text, url, files: [file] };
 
   // Check if this specific share is supported
-  if (!navigator.canShare(shareData)) {
+  if (navigator.canShare(shareData)) {
     logger.debug('Cannot share this content with files, falling back to text');
     return shareContent({ title, text, url });
killedBy: Share Utilities additional edge cases shareWithImage additional should use default filename when not provided
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ObjectLiteral
src/utils/share.js:85:40
   try {
     await navigator.share(shareData);
     logger.debug('Content with image shared successfully');
-    telemetry.track('share_completed', { method: 'native_with_image' });
+    telemetry.track('share_completed', {});
     return true;
   } catch (error) {
killedBy: Share Utilities additional edge cases shareWithImage additional should track share_completed with native_with_image method
statusReason: expected "vi.fn()" to be called with arguments: [ 'share_completed', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "share_completed",

[Killed] BooleanLiteral
src/utils/share.js:86:12
     await navigator.share(shareData);
     logger.debug('Content with image shared successfully');
     telemetry.track('share_completed', { method: 'native_with_image' });
-    return true;
+    return false;
   } catch (error) {
     if (error.name === 'AbortError') {
killedBy: Share Utilities shareWithImage should share with image when supported
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utils/share.js:88:9
     telemetry.track('share_completed', { method: 'native_with_image' });
     return true;
   } catch (error) {
-    if (error.name === 'AbortError') {
+    if (error.name !== 'AbortError') {
       logger.debug('Share cancelled by user');
       telemetry.track('share_cancelled', { method: 'native_with_image' });
killedBy: Share Utilities additional edge cases shareWithImage additional should track share_cancelled with native_with_image method on abort
statusReason: expected "vi.fn()" to be called with arguments: [ 'share_cancelled', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "share_cancelled",

[Killed] BlockStatement
src/utils/share.js:88:38
     telemetry.track('share_completed', { method: 'native_with_image' });
     return true;
   } catch (error) {
-    if (error.name === 'AbortError') {
-      logger.debug('Share cancelled by user');
-      telemetry.track('share_cancelled', { method: 'native_with_image' });
-    } else {
+    if (error.name === 'AbortError') {} else {
       logger.error('Share with image failed', { error: error.message });
       telemetry.track('share_failed', { method: 'native_with_image', error: error.message });
killedBy: Share Utilities additional edge cases shareWithImage additional should track share_cancelled with native_with_image method on abort
statusReason: expected "vi.fn()" to be called with arguments: [ 'share_cancelled', …(1) ]

Number of calls: 0

[Survived] StringLiteral
src/utils/share.js:89:20
     return true;
   } catch (error) {
     if (error.name === 'AbortError') {
-      logger.debug('Share cancelled by user');
+      logger.debug("");
       telemetry.track('share_cancelled', { method: 'native_with_image' });
     } else {

[Killed] ObjectLiteral
src/utils/share.js:90:42
   } catch (error) {
     if (error.name === 'AbortError') {
       logger.debug('Share cancelled by user');
-      telemetry.track('share_cancelled', { method: 'native_with_image' });
+      telemetry.track('share_cancelled', {});
     } else {
       logger.error('Share with image failed', { error: error.message });
killedBy: Share Utilities additional edge cases shareWithImage additional should track share_cancelled with native_with_image method on abort
statusReason: expected "vi.fn()" to be called with arguments: [ 'share_cancelled', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "share_cancelled",

[Killed] BlockStatement
src/utils/share.js:91:12
     if (error.name === 'AbortError') {
       logger.debug('Share cancelled by user');
       telemetry.track('share_cancelled', { method: 'native_with_image' });
-    } else {
-      logger.error('Share with image failed', { error: error.message });
-      telemetry.track('share_failed', { method: 'native_with_image', error: error.message });
-    }
+    } else {}
     return false;
   }
killedBy: Share Utilities additional edge cases shareWithImage additional should track share_failed with native_with_image method on error
statusReason: expected "vi.fn()" to be called with arguments: [ 'share_failed', { …(2) } ]

Number of calls: 0

[Killed] StringLiteral
src/utils/share.js:93:23
       telemetry.track('share_cancelled', { method: 'native_with_image' });
     } else {
       logger.error('Share with image failed', { error: error.message });
-      telemetry.track('share_failed', { method: 'native_with_image', error: error.message });
+      telemetry.track("", { method: 'native_with_image', error: error.message });
     }
     return false;
killedBy: Share Utilities additional edge cases shareWithImage additional should track share_failed with native_with_image method on error
statusReason: expected "vi.fn()" to be called with arguments: [ 'share_failed', { …(2) } ]

Received: 

  1st vi.fn() call:

  [
-   "share_failed",

[Killed] ObjectLiteral
src/utils/share.js:93:39
       telemetry.track('share_cancelled', { method: 'native_with_image' });
     } else {
       logger.error('Share with image failed', { error: error.message });
-      telemetry.track('share_failed', { method: 'native_with_image', error: error.message });
+      telemetry.track('share_failed', {});
     }
     return false;
killedBy: Share Utilities additional edge cases shareWithImage additional should track share_failed with native_with_image method on error
statusReason: expected "vi.fn()" to be called with arguments: [ 'share_failed', { …(2) } ]

Received: 

  1st vi.fn() call:

  [
-   "share_failed",

[Killed] BlockStatement
src/utils/share.js:104:45
  * @param {string} text - Text to copy
  * @returns {Promise<boolean>} True if copy was successful
  */
-export async function copyToClipboard(text) {
-  if (typeof navigator === 'undefined' || !navigator.clipboard) {
-    logger.debug('Clipboard API not available');
-    return false;
-  }
-
-  try {
-    await navigator.clipboard.writeText(text);
-    logger.debug('Text copied to clipboard');
-    telemetry.track('share_completed', { method: 'clipboard' });
-    return true;
-  } catch (error) {
-    logger.error('Clipboard copy failed', { error: error.message });
-    telemetry.track('share_failed', { method: 'clipboard', error: error.message });
-    return false;
-  }
-}
+export async function copyToClipboard(text) {}
 
 /**
killedBy: Share Utilities copyToClipboard should copy text to clipboard
statusReason: expected "vi.fn()" to be called with arguments: [ 'Test text' ]

Number of calls: 0

[Killed] BooleanLiteral
src/utils/share.js:105:43
  * @returns {Promise<boolean>} True if copy was successful
  */
 export async function copyToClipboard(text) {
-  if (typeof navigator === 'undefined' || !navigator.clipboard) {
+  if (typeof navigator === 'undefined' || navigator.clipboard) {
     logger.debug('Clipboard API not available');
     return false;
killedBy: Share Utilities copyToClipboard should copy text to clipboard
statusReason: expected "vi.fn()" to be called with arguments: [ 'Test text' ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/share.js:105:7
  * @returns {Promise<boolean>} True if copy was successful
  */
 export async function copyToClipboard(text) {
-  if (typeof navigator === 'undefined' || !navigator.clipboard) {
+  if (false || !navigator.clipboard) {
     logger.debug('Clipboard API not available');
     return false;
killedBy: Share Utilities additional edge cases copyToClipboard additional should return false when navigator is undefined
statusReason: Cannot read properties of undefined (reading 'clipboard')

[Survived] StringLiteral
src/utils/share.js:106:18
  */
 export async function copyToClipboard(text) {
   if (typeof navigator === 'undefined' || !navigator.clipboard) {
-    logger.debug('Clipboard API not available');
+    logger.debug("");
     return false;
   }

[Killed] BooleanLiteral
src/utils/share.js:107:12
 export async function copyToClipboard(text) {
   if (typeof navigator === 'undefined' || !navigator.clipboard) {
     logger.debug('Clipboard API not available');
-    return false;
+    return true;
   }
 
killedBy: Share Utilities copyToClipboard should return false when clipboard API is not available
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/share.js:110:7
     return false;
   }
 
-  try {
-    await navigator.clipboard.writeText(text);
-    logger.debug('Text copied to clipboard');
-    telemetry.track('share_completed', { method: 'clipboard' });
-    return true;
-  } catch (error) {
+  try {} catch (error) {
     logger.error('Clipboard copy failed', { error: error.message });
     telemetry.track('share_failed', { method: 'clipboard', error: error.message });
killedBy: Share Utilities copyToClipboard should copy text to clipboard
statusReason: expected "vi.fn()" to be called with arguments: [ 'Test text' ]

Number of calls: 0

[Killed] BlockStatement
src/utils/share.js:115:19
     logger.debug('Text copied to clipboard');
     telemetry.track('share_completed', { method: 'clipboard' });
     return true;
-  } catch (error) {
-    logger.error('Clipboard copy failed', { error: error.message });
-    telemetry.track('share_failed', { method: 'clipboard', error: error.message });
-    return false;
-  }
+  } catch (error) {}
 }
 
killedBy: Share Utilities copyToClipboard should return false when copy fails
statusReason: expected undefined to be false // Object.is equality

[Survived] ObjectLiteral
src/utils/share.js:116:43
     telemetry.track('share_completed', { method: 'clipboard' });
     return true;
   } catch (error) {
-    logger.error('Clipboard copy failed', { error: error.message });
+    logger.error('Clipboard copy failed', {});
     telemetry.track('share_failed', { method: 'clipboard', error: error.message });
     return false;

[Survived] StringLiteral
src/utils/share.js:116:18
     telemetry.track('share_completed', { method: 'clipboard' });
     return true;
   } catch (error) {
-    logger.error('Clipboard copy failed', { error: error.message });
+    logger.error("", { error: error.message });
     telemetry.track('share_failed', { method: 'clipboard', error: error.message });
     return false;

[Killed] ObjectLiteral
src/utils/share.js:117:37
     return true;
   } catch (error) {
     logger.error('Clipboard copy failed', { error: error.message });
-    telemetry.track('share_failed', { method: 'clipboard', error: error.message });
+    telemetry.track('share_failed', {});
     return false;
   }
killedBy: Share Utilities additional edge cases copyToClipboard additional should track share_failed on clipboard error
statusReason: expected "vi.fn()" to be called with arguments: [ 'share_failed', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "share_failed",

[Killed] BooleanLiteral
src/utils/share.js:118:12
   } catch (error) {
     logger.error('Clipboard copy failed', { error: error.message });
     telemetry.track('share_failed', { method: 'clipboard', error: error.message });
-    return false;
+    return true;
   }
 }
killedBy: Share Utilities copyToClipboard should return false when copy fails
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/share.js:127:41
  * @param {string} topic - Quiz topic
  * @returns {string} Full share URL
  */
-export function generateShareUrl(topic) {
-  const baseUrl = 'https://saberloop.com/app/';
-  const encodedTopic = encodeURIComponent(topic);
-  return `${baseUrl}?topic=${encodedTopic}`;
-}
+export function generateShareUrl(topic) {}
 
 /**
killedBy: Share Utilities generateShareUrl should generate correct share URL
statusReason: expected undefined to be 'https://saberloop.com/app/?topic=Worl…' // Object.is equality

[Killed] StringLiteral
src/utils/share.js:130:10
 export function generateShareUrl(topic) {
   const baseUrl = 'https://saberloop.com/app/';
   const encodedTopic = encodeURIComponent(topic);
-  return `${baseUrl}?topic=${encodedTopic}`;
+  return ``;
 }
 
killedBy: Share Utilities generateShareUrl should generate correct share URL
statusReason: expected '' to be 'https://saberloop.com/app/?topic=Worl…' // Object.is equality

[Killed] BlockStatement
src/utils/share.js:142:72
  * @param {number} options.percentage - Score percentage
  * @returns {string} Formatted share message
  */
-export function generateShareText({ topic, score, total, percentage }) {
-  return `🏆 ${topic} Quiz Master!
-I scored ${score}/${total} (${percentage}%) on Saberloop!
-Can you beat my score?`;
-}
+export function generateShareText({ topic, score, total, percentage }) {}
 
 /**
killedBy: Share Utilities generateShareText should generate correct share text
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/utils/share.js:153:43
  * @param {string} text - Tweet text
  * @param {string} url - URL to share
  */
-export function shareToTwitter(text, url) {
-  const tweetText = encodeURIComponent(text);
-  const tweetUrl = encodeURIComponent(url);
-  const intentUrl = `https://twitter.com/intent/tweet?text=${tweetText}&url=${tweetUrl}`;
-  window.open(intentUrl, '_blank', 'width=550,height=420');
-  telemetry.track('share_completed', { method: 'twitter' });
-}
+export function shareToTwitter(text, url) {}
 
 /**
killedBy: Share Utilities shareToTwitter should open Twitter intent URL
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…}, '_blank', …(1) ]

Number of calls: 0

[Killed] StringLiteral
src/utils/share.js:156:21
 export function shareToTwitter(text, url) {
   const tweetText = encodeURIComponent(text);
   const tweetUrl = encodeURIComponent(url);
-  const intentUrl = `https://twitter.com/intent/tweet?text=${tweetText}&url=${tweetUrl}`;
+  const intentUrl = ``;
   window.open(intentUrl, '_blank', 'width=550,height=420');
   telemetry.track('share_completed', { method: 'twitter' });
killedBy: Share Utilities shareToTwitter should open Twitter intent URL
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…}, '_blank', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   StringContaining "twitter.com/intent/tweet",

[Killed] BlockStatement
src/utils/share.js:166:45
  * @param {string} url - URL to share
  * @param {string} [quote] - Optional quote text
  */
-export function shareToFacebook(url, quote) {
-  const shareUrl = encodeURIComponent(url);
-  let intentUrl = `https://www.facebook.com/sharer/sharer.php?u=${shareUrl}`;
-  if (quote) {
-    intentUrl += `&quote=${encodeURIComponent(quote)}`;
-  }
-  window.open(intentUrl, '_blank', 'width=550,height=420');
-  telemetry.track('share_completed', { method: 'facebook' });
-}
+export function shareToFacebook(url, quote) {}
 
killedBy: Share Utilities shareToFacebook should open Facebook share URL
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…}, '_blank', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/utils/share.js:169:14
 export function shareToFacebook(url, quote) {
   const shareUrl = encodeURIComponent(url);
   let intentUrl = `https://www.facebook.com/sharer/sharer.php?u=${shareUrl}`;
-  if (quote) {
-    intentUrl += `&quote=${encodeURIComponent(quote)}`;
-  }
+  if (quote) {}
   window.open(intentUrl, '_blank', 'width=550,height=420');
   telemetry.track('share_completed', { method: 'facebook' });
killedBy: Share Utilities shareToFacebook should include quote when provided
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…}, '_blank', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   StringContaining "quote=Check%20this%20out",

[Killed] ConditionalExpression
src/utils/share.js:169:7
 export function shareToFacebook(url, quote) {
   const shareUrl = encodeURIComponent(url);
   let intentUrl = `https://www.facebook.com/sharer/sharer.php?u=${shareUrl}`;
-  if (quote) {
+  if (true) {
     intentUrl += `&quote=${encodeURIComponent(quote)}`;
   }
killedBy: Share Utilities shareToFacebook should not include quote when not provided
statusReason: expected 'https://www.facebook.com/sharer/share…' not to contain 'quote='

[Killed] ObjectLiteral
src/utils/share.js:173:38
     intentUrl += `&quote=${encodeURIComponent(quote)}`;
   }
   window.open(intentUrl, '_blank', 'width=550,height=420');
-  telemetry.track('share_completed', { method: 'facebook' });
+  telemetry.track('share_completed', {});
 }
 
killedBy: Share Utilities additional edge cases shareToFacebook additional should track share_completed for facebook
statusReason: expected "vi.fn()" to be called with arguments: [ 'share_completed', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "share_completed",
