[Killed] EqualityOperator
src/utils/shuffle.js:78:19
   const { options, correct, ...rest } = question;
 
   // Handle edge cases
-  if (!options || options.length === 0) {
+  if (!options || options.length !== 0) {
     return question;
   }
killedBy: shuffleQuestionOptions should return a new object (not mutate original)
statusReason: expected { question: 'What is 2 + 2?', …(3) } not to be { question: 'What is 2 + 2?', …(3) } // Object.is equality

[Killed] ConditionalExpression
src/utils/shuffle.js:116:7
  * @returns {Array<Object>} - New array with shuffled options in each question
  */
 export function shuffleAllQuestions(questions) {
-  if (!questions || !Array.isArray(questions)) {
+  if (true) {
     return questions;
   }
killedBy: shuffleAllQuestions should return a new array
statusReason: expected [ { question: 'Q1?', …(2) }, …(1) ] not to be [ { question: 'Q1?', …(2) }, …(1) ] // Object.is equality

[Killed] ConditionalExpression
src/utils/shuffle.js:132:7
  * @returns {{shuffledOptions: Array<string>, shuffleMap: Array<number>, newCorrectIndex: number}}
  */
 export function shuffleOptions(options, correctIndex) {
-  if (!options || options.length === 0) {
+  if (false) {
     return {
       shuffledOptions: options || [],
killedBy: shuffleOptions should handle empty options array
statusReason: expected -1 to be +0 // Object.is equality
