[Killed] BlockStatement
src/utils/json-extractor.js:13:26
  * @param {string} text - JSON string to clean
  * @returns {string} Cleaned JSON string
  */
-function cleanJSON(text) {
-  return text
-    .replace(/,(\s*[}\]])/g, '$1')  // Remove trailing commas before } or ]
-    .replace(/[\x00-\x1F]+/g, ' '); // Replace control chars with space (except in strings)
-}
+function cleanJSON(text) {}
 
 /**
killedBy: JSON Extractor extractJSON markdown code blocks should extract JSON from ```json code block
statusReason: Failed to extract valid JSON from response

[Killed] Regex
src/utils/json-extractor.js:15:14
  */
 function cleanJSON(text) {
   return text
-    .replace(/,(\s*[}\]])/g, '$1')  // Remove trailing commas before } or ]
+    .replace(/,(\S*[}\]])/g, '$1')  // Remove trailing commas before } or ]
     .replace(/[\x00-\x1F]+/g, ' '); // Replace control chars with space (except in strings)
 }
killedBy: JSON Extractor extractJSON JSON cleaning (trailing commas and control chars) should handle multiple trailing commas
statusReason: expected [ 1, 2 ] to deeply equal { outer: { inner: 'value' }, …(1) }

[Killed] StringLiteral
src/utils/json-extractor.js:15:30
  */
 function cleanJSON(text) {
   return text
-    .replace(/,(\s*[}\]])/g, '$1')  // Remove trailing commas before } or ]
+    .replace(/,(\s*[}\]])/g, "")  // Remove trailing commas before } or ]
     .replace(/[\x00-\x1F]+/g, ' '); // Replace control chars with space (except in strings)
 }
killedBy: JSON Extractor extractJSON JSON cleaning (trailing commas and control chars) should handle trailing comma in object
statusReason: Failed to extract valid JSON from response

[Killed] Regex
src/utils/json-extractor.js:16:14
 function cleanJSON(text) {
   return text
     .replace(/,(\s*[}\]])/g, '$1')  // Remove trailing commas before } or ]
-    .replace(/[\x00-\x1F]+/g, ' '); // Replace control chars with space (except in strings)
+    .replace(/[^\x00-\x1F]+/g, ' '); // Replace control chars with space (except in strings)
 }
 
killedBy: JSON Extractor extractJSON markdown code blocks should extract JSON from ```json code block
statusReason: Failed to extract valid JSON from response

[Survived] StringLiteral
src/utils/json-extractor.js:16:31
 function cleanJSON(text) {
   return text
     .replace(/,(\s*[}\]])/g, '$1')  // Remove trailing commas before } or ]
-    .replace(/[\x00-\x1F]+/g, ' '); // Replace control chars with space (except in strings)
+    .replace(/[\x00-\x1F]+/g, ""); // Replace control chars with space (except in strings)
 }
 

[Killed] ConditionalExpression
src/utils/json-extractor.js:29:7
  * @throws {Error} If JSON cannot be extracted
  */
 export function extractJSON(text) {
-  if (!text || typeof text !== 'string') {
+  if (false) {
     throw new Error('Input must be a non-empty string');
   }
killedBy: JSON Extractor extractJSON error handling should throw on null input
statusReason: expected [Function] to throw error including 'Input must be a non-empty string' but got 'Cannot read properties of null (readi…'

[Killed] BlockStatement
src/utils/json-extractor.js:29:42
  * @throws {Error} If JSON cannot be extracted
  */
 export function extractJSON(text) {
-  if (!text || typeof text !== 'string') {
-    throw new Error('Input must be a non-empty string');
-  }
+  if (!text || typeof text !== 'string') {}
 
   let cleaned = text.trim();
killedBy: JSON Extractor extractJSON error handling should throw on null input
statusReason: expected [Function] to throw error including 'Input must be a non-empty string' but got 'Cannot read properties of null (readi…'

[Killed] StringLiteral
src/utils/json-extractor.js:30:21
  */
 export function extractJSON(text) {
   if (!text || typeof text !== 'string') {
-    throw new Error('Input must be a non-empty string');
+    throw new Error("");
   }
 
killedBy: JSON Extractor extractJSON error handling should throw on null input
statusReason: expected [Function] to throw error including 'Input must be a non-empty string' but got ''

[Survived] MethodExpression
src/utils/json-extractor.js:33:17
     throw new Error('Input must be a non-empty string');
   }
 
-  let cleaned = text.trim();
+  let cleaned = text;
 
   if (!cleaned) {

[Killed] ConditionalExpression
src/utils/json-extractor.js:35:7
 
   let cleaned = text.trim();
 
-  if (!cleaned) {
+  if (true) {
     throw new Error('Input is empty or whitespace-only');
   }
killedBy: JSON Extractor extractJSON clean JSON input should parse clean JSON object directly
statusReason: Input is empty or whitespace-only

[Killed] BooleanLiteral
src/utils/json-extractor.js:35:7
 
   let cleaned = text.trim();
 
-  if (!cleaned) {
+  if (cleaned) {
     throw new Error('Input is empty or whitespace-only');
   }
killedBy: JSON Extractor extractJSON clean JSON input should parse clean JSON object directly
statusReason: Input is empty or whitespace-only

[Killed] EqualityOperator
src/utils/json-extractor.js:40:7
   }
 
   // Step 1: Remove BOM if present
-  if (cleaned.charCodeAt(0) === 0xFEFF) {
+  if (cleaned.charCodeAt(0) !== 0xFEFF) {
     cleaned = cleaned.slice(1);
   }
killedBy: generateQuestions prompt should include guidance for distinct answer options
statusReason: Missing or invalid questions array

[Killed] ConditionalExpression
src/utils/json-extractor.js:40:7
   }
 
   // Step 1: Remove BOM if present
-  if (cleaned.charCodeAt(0) === 0xFEFF) {
+  if (true) {
     cleaned = cleaned.slice(1);
   }
killedBy: JSON Extractor extractJSON clean JSON input should parse clean JSON object directly
statusReason: Failed to extract valid JSON from response

[NoCoverage] MethodExpression
src/utils/json-extractor.js:41:15
 
   // Step 1: Remove BOM if present
   if (cleaned.charCodeAt(0) === 0xFEFF) {
-    cleaned = cleaned.slice(1);
+    cleaned = cleaned;
   }
 

[Survived] Regex
src/utils/json-extractor.js:46:29
 
   // Step 2: Strip DeepSeek thinking tags (must happen before JSON extraction)
   // These models output <think>reasoning</think> before the actual response
-  cleaned = cleaned.replace(/<think>[\s\S]*?<\/think>/gi, '');
+  cleaned = cleaned.replace(/<think>[^\s\S]*?<\/think>/gi, '');
 
   // Step 3: Normalize smart quotes to straight quotes

[Survived] Regex
src/utils/json-extractor.js:46:29
 
   // Step 2: Strip DeepSeek thinking tags (must happen before JSON extraction)
   // These models output <think>reasoning</think> before the actual response
-  cleaned = cleaned.replace(/<think>[\s\S]*?<\/think>/gi, '');
+  cleaned = cleaned.replace(/<think>[\S\S]*?<\/think>/gi, '');
 
   // Step 3: Normalize smart quotes to straight quotes

[Survived] BlockStatement
src/utils/json-extractor.js:54:7
     .replace(/[\u2018\u2019]/g, "'"); // Smart single quotes ' '
 
   // Step 4: Try direct parse first (most common case)
-  try {
-    return JSON.parse(cleaned);
-  } catch (directParseError) {
+  try {} catch (directParseError) {
     // Continue to fallbacks
   }

[Killed] Regex
src/utils/json-extractor.js:61:40
   }
 
   // Step 5: Try extracting from markdown code block
-  const codeBlockMatch = cleaned.match(/```(?:json)?\s*([\s\S]*?)```/);
+  const codeBlockMatch = cleaned.match(/```(?:json)?\s*([^\s\S]*?)```/);
   if (codeBlockMatch) {
     const jsonFromBlock = cleanJSON(codeBlockMatch[1].trim());
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] Regex
src/utils/json-extractor.js:61:40
   }
 
   // Step 5: Try extracting from markdown code block
-  const codeBlockMatch = cleaned.match(/```(?:json)?\s*([\s\S]*?)```/);
+  const codeBlockMatch = cleaned.match(/```(?:json)?\s*([\s\S])```/);
   if (codeBlockMatch) {
     const jsonFromBlock = cleanJSON(codeBlockMatch[1].trim());
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] ConditionalExpression
src/utils/json-extractor.js:62:7
 
   // Step 5: Try extracting from markdown code block
   const codeBlockMatch = cleaned.match(/```(?:json)?\s*([\s\S]*?)```/);
-  if (codeBlockMatch) {
+  if (false) {
     const jsonFromBlock = cleanJSON(codeBlockMatch[1].trim());
     try {
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] BlockStatement
src/utils/json-extractor.js:62:23
 
   // Step 5: Try extracting from markdown code block
   const codeBlockMatch = cleaned.match(/```(?:json)?\s*([\s\S]*?)```/);
-  if (codeBlockMatch) {
-    const jsonFromBlock = cleanJSON(codeBlockMatch[1].trim());
-    try {
-      return JSON.parse(jsonFromBlock);
-    } catch (codeBlockError) {
-      // Continue to other fallbacks
-    }
-  }
+  if (codeBlockMatch) {}
 
   // Step 6: Try to find JSON object in text
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Survived] MethodExpression
src/utils/json-extractor.js:63:37
   // Step 5: Try extracting from markdown code block
   const codeBlockMatch = cleaned.match(/```(?:json)?\s*([\s\S]*?)```/);
   if (codeBlockMatch) {
-    const jsonFromBlock = cleanJSON(codeBlockMatch[1].trim());
+    const jsonFromBlock = cleanJSON(codeBlockMatch[1]);
     try {
       return JSON.parse(jsonFromBlock);

[Killed] BlockStatement
src/utils/json-extractor.js:64:9
   const codeBlockMatch = cleaned.match(/```(?:json)?\s*([\s\S]*?)```/);
   if (codeBlockMatch) {
     const jsonFromBlock = cleanJSON(codeBlockMatch[1].trim());
-    try {
-      return JSON.parse(jsonFromBlock);
-    } catch (codeBlockError) {
+    try {} catch (codeBlockError) {
       // Continue to other fallbacks
     }
killedBy: JSON Extractor extractJSON code block edge cases should prefer code block JSON over text JSON when both valid
statusReason: Failed to extract valid JSON from response

[Killed] Regex
src/utils/json-extractor.js:73:37
 
   // Step 6: Try to find JSON object in text
   // Match from first { to last } (greedy for nested objects)
-  const objectMatch = cleaned.match(/\{[\s\S]*\}/);
+  const objectMatch = cleaned.match(/\{[\s\S]\}/);
   if (objectMatch) {
     const cleanedObject = cleanJSON(objectMatch[0]);
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON object from text with prefix
statusReason: Failed to extract valid JSON from response

[Killed] Regex
src/utils/json-extractor.js:73:37
 
   // Step 6: Try to find JSON object in text
   // Match from first { to last } (greedy for nested objects)
-  const objectMatch = cleaned.match(/\{[\s\S]*\}/);
+  const objectMatch = cleaned.match(/\{[^\s\S]*\}/);
   if (objectMatch) {
     const cleanedObject = cleanJSON(objectMatch[0]);
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON object from text with prefix
statusReason: Failed to extract valid JSON from response

[Killed] ConditionalExpression
src/utils/json-extractor.js:74:7
   // Step 6: Try to find JSON object in text
   // Match from first { to last } (greedy for nested objects)
   const objectMatch = cleaned.match(/\{[\s\S]*\}/);
-  if (objectMatch) {
+  if (false) {
     const cleanedObject = cleanJSON(objectMatch[0]);
     try {
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON object from text with prefix
statusReason: Failed to extract valid JSON from response

[Killed] BlockStatement
src/utils/json-extractor.js:74:20
   // Step 6: Try to find JSON object in text
   // Match from first { to last } (greedy for nested objects)
   const objectMatch = cleaned.match(/\{[\s\S]*\}/);
-  if (objectMatch) {
-    const cleanedObject = cleanJSON(objectMatch[0]);
-    try {
-      return JSON.parse(cleanedObject);
-    } catch (objectError) {
-      // Continue to array fallback
-    }
-  }
+  if (objectMatch) {}
 
   // Step 7: Try to find JSON array in text
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON object from text with prefix
statusReason: Failed to extract valid JSON from response

[Killed] BlockStatement
src/utils/json-extractor.js:76:9
   const objectMatch = cleaned.match(/\{[\s\S]*\}/);
   if (objectMatch) {
     const cleanedObject = cleanJSON(objectMatch[0]);
-    try {
-      return JSON.parse(cleanedObject);
-    } catch (objectError) {
+    try {} catch (objectError) {
       // Continue to array fallback
     }
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON object from text with prefix
statusReason: Failed to extract valid JSON from response

[Killed] Regex
src/utils/json-extractor.js:85:36
 
   // Step 7: Try to find JSON array in text
   // Match from first [ to last ] (greedy for nested arrays)
-  const arrayMatch = cleaned.match(/\[[\s\S]*\]/);
+  const arrayMatch = cleaned.match(/\[[\S\S]*\]/);
   if (arrayMatch) {
     const cleanedArray = cleanJSON(arrayMatch[0]);
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON array from text
statusReason: Failed to extract valid JSON from response

[Killed] Regex
src/utils/json-extractor.js:85:36
 
   // Step 7: Try to find JSON array in text
   // Match from first [ to last ] (greedy for nested arrays)
-  const arrayMatch = cleaned.match(/\[[\s\S]*\]/);
+  const arrayMatch = cleaned.match(/\[[\s\S]\]/);
   if (arrayMatch) {
     const cleanedArray = cleanJSON(arrayMatch[0]);
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON array from text
statusReason: Failed to extract valid JSON from response

[Killed] ConditionalExpression
src/utils/json-extractor.js:86:7
   // Step 7: Try to find JSON array in text
   // Match from first [ to last ] (greedy for nested arrays)
   const arrayMatch = cleaned.match(/\[[\s\S]*\]/);
-  if (arrayMatch) {
+  if (false) {
     const cleanedArray = cleanJSON(arrayMatch[0]);
     try {
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON array from text
statusReason: Failed to extract valid JSON from response

[Killed] ConditionalExpression
src/utils/json-extractor.js:86:7
   // Step 7: Try to find JSON array in text
   // Match from first [ to last ] (greedy for nested arrays)
   const arrayMatch = cleaned.match(/\[[\s\S]*\]/);
-  if (arrayMatch) {
+  if (true) {
     const cleanedArray = cleanJSON(arrayMatch[0]);
     try {
killedBy: JSON Extractor extractJSON error handling should throw specific error for failed extraction
statusReason: expected [Function] to throw error including 'Failed to extract valid JSON from res…' but got 'Cannot read properties of null (readi…'

[Killed] BlockStatement
src/utils/json-extractor.js:88:9
   const arrayMatch = cleaned.match(/\[[\s\S]*\]/);
   if (arrayMatch) {
     const cleanedArray = cleanJSON(arrayMatch[0]);
-    try {
-      return JSON.parse(cleanedArray);
-    } catch (arrayError) {
+    try {} catch (arrayError) {
       // All fallbacks failed
     }
killedBy: JSON Extractor extractJSON JSON extraction from text should extract JSON array from text
statusReason: Failed to extract valid JSON from response

[Killed] MethodExpression
src/utils/json-extractor.js:97:14
 
   // All strategies failed - log the raw text for debugging
   logger.error('JSON extraction failed', {
-    rawText: text.substring(0, 500),
+    rawText: text,
     textLength: text.length
   });
killedBy: JSON Extractor extractJSON mutation testing coverage should truncate rawText to 500 chars in error log for long input
statusReason: expected 1000 to be 500 // Object.is equality
