[Survived] ObjectLiteral
src/services/party-connection-manager.js:17:28
   import { P2PService } from './p2p-service.js';
   import { PartySession } from './party-session.js';
 
-  const log = logger.child({ module: 'party-connection-manager' });
+  const log = logger.child({});
 
   /**

[Survived] StringLiteral
src/services/party-connection-manager.js:17:38
   import { P2PService } from './p2p-service.js';
   import { PartySession } from './party-session.js';
 
-  const log = logger.child({ module: 'party-connection-manager' });
+  const log = logger.child({ module: "" });
 
   /**

[Survived] StringLiteral
src/services/party-connection-manager.js:24:10
    */
   export const CONNECTION_MODES = {
     CONNECTING: 'connecting',
-    P2P: 'p2p',
+    P2P: "",
     HTTP_FALLBACK: 'http_fallback',
     DISCONNECTED: 'disconnected',

[Killed] MethodExpression
src/services/party-connection-manager.js:51:23
      */
     constructor(roomCode, participantId, isHost) {
       /** @type {string} */
-      this.roomCode = roomCode.toUpperCase();
+      this.roomCode = roomCode.toLowerCase();
 
       /** @type {string} */
killedBy: PartyConnectionManager constructor should initialize with correct properties
statusReason: expected 'abc123' to be 'ABC123' // Object.is equality

[Survived] ObjectLiteral
src/services/party-connection-manager.js:93:50
       /** @type {Function|null} */
       this.onErrorCallback = null;
 
-      log.info('PartyConnectionManager created', { roomCode: this.roomCode, isHost });
+      log.info('PartyConnectionManager created', {});
     }
 

[Killed] EqualityOperator
src/services/party-connection-manager.js:106:11
      * @returns {Promise<boolean>} Whether connection succeeded
      */
     async connect() {
-      if (this.mode === CONNECTION_MODES.P2P) {
+      if (this.mode !== CONNECTION_MODES.P2P) {
         log.warn('Already connected');
         return true;
killedBy: PartyConnectionManager connect should transition to CONNECTING mode
statusReason: expected 'disconnected' to be 'connecting' // Object.is equality

[Killed] ConditionalExpression
src/services/party-connection-manager.js:106:11
      * @returns {Promise<boolean>} Whether connection succeeded
      */
     async connect() {
-      if (this.mode === CONNECTION_MODES.P2P) {
+      if (true) {
         log.warn('Already connected');
         return true;
killedBy: PartyConnectionManager connect should transition to CONNECTING mode
statusReason: expected 'disconnected' to be 'connecting' // Object.is equality

[Killed] BooleanLiteral
src/services/party-connection-manager.js:108:16
     async connect() {
       if (this.mode === CONNECTION_MODES.P2P) {
         log.warn('Already connected');
-        return true;
+        return false;
       }
 
killedBy: PartyConnectionManager connect should not connect twice if already in P2P mode
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/services/party-connection-manager.js:129:27
         this._startConnectionTimeout();
 
         // If guest, try to connect to host
-        if (!this.isHost) {
-          const peers = await this.signalingClient.getPeers();
-          if (peers.length > 0) {
-            this.hostId = peers[0]; // First peer is the host
-            await this.p2pService.createConnection(this.hostId);
-          }
-        }
+        if (!this.isHost) {}
 
         log.info('Connection initiated', { isHost: this.isHost });
killedBy: PartyConnectionManager connect should get peers and connect to host if guest
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/services/party-connection-manager.js:129:13
         this._startConnectionTimeout();
 
         // If guest, try to connect to host
-        if (!this.isHost) {
+        if (false) {
           const peers = await this.signalingClient.getPeers();
           if (peers.length > 0) {
killedBy: PartyConnectionManager connect should get peers and connect to host if guest
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/services/party-connection-manager.js:131:33
         // If guest, try to connect to host
         if (!this.isHost) {
           const peers = await this.signalingClient.getPeers();
-          if (peers.length > 0) {
-            this.hostId = peers[0]; // First peer is the host
-            await this.p2pService.createConnection(this.hostId);
-          }
+          if (peers.length > 0) {}
         }
 
killedBy: PartyConnectionManager connect should get peers and connect to host if guest
statusReason: expected null to be 'host-123' // Object.is equality

[Killed] ConditionalExpression
src/services/party-connection-manager.js:131:15
         // If guest, try to connect to host
         if (!this.isHost) {
           const peers = await this.signalingClient.getPeers();
-          if (peers.length > 0) {
+          if (false) {
             this.hostId = peers[0]; // First peer is the host
             await this.p2pService.createConnection(this.hostId);
killedBy: PartyConnectionManager connect should get peers and connect to host if guest
statusReason: expected null to be 'host-123' // Object.is equality

[Killed] BooleanLiteral
src/services/party-connection-manager.js:138:16
         }
 
         log.info('Connection initiated', { isHost: this.isHost });
-        return true;
+        return false;
       } catch (error) {
         log.error('Connection failed', { error: error.message });
killedBy: PartyConnectionManager connect should return true on successful connection
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/services/party-connection-manager.js:139:23
 
         log.info('Connection initiated', { isHost: this.isHost });
         return true;
-      } catch (error) {
-        log.error('Connection failed', { error: error.message });
-        this._handleConnectionFailure(error);
-        return false;
-      }
+      } catch (error) {}
     }
 
killedBy: PartyConnectionManager connect should handle connection failure and return false
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/services/party-connection-manager.js:151:24
      *
      * @returns {Promise<void>}
      */
-    async disconnect() {
-      this._clearConnectionTimeout();
-
-      if (this.session) {
-        this.session.destroy();
-        this.session = null;
-      }
-
-      if (this.p2pService) {
-        this.p2pService.destroy();
-        this.p2pService = null;
-      }
-
-      if (this.signalingClient) {
-        this.signalingClient.destroy();
-        this.signalingClient = null;
-      }
-
-      this._setMode(CONNECTION_MODES.DISCONNECTED);
-      log.info('Disconnected');
-    }
+    async disconnect() {}
 
     /**
killedBy: PartyConnectionManager disconnect should clean up all services
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/services/party-connection-manager.js:154:25
     async disconnect() {
       this._clearConnectionTimeout();
 
-      if (this.session) {
-        this.session.destroy();
-        this.session = null;
-      }
+      if (this.session) {}
 
       if (this.p2pService) {
killedBy: PartyConnectionManager disconnect should clean up all services
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/services/party-connection-manager.js:154:11
     async disconnect() {
       this._clearConnectionTimeout();
 
-      if (this.session) {
+      if (false) {
         this.session.destroy();
         this.session = null;
killedBy: PartyConnectionManager disconnect should clean up all services
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/services/party-connection-manager.js:159:28
         this.session = null;
       }
 
-      if (this.p2pService) {
-        this.p2pService.destroy();
-        this.p2pService = null;
-      }
+      if (this.p2pService) {}
 
       if (this.signalingClient) {
killedBy: PartyConnectionManager disconnect should clean up all services
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/services/party-connection-manager.js:159:11
         this.session = null;
       }
 
-      if (this.p2pService) {
+      if (false) {
         this.p2pService.destroy();
         this.p2pService = null;
killedBy: PartyConnectionManager disconnect should clean up all services
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/services/party-connection-manager.js:164:33
         this.p2pService = null;
       }
 
-      if (this.signalingClient) {
-        this.signalingClient.destroy();
-        this.signalingClient = null;
-      }
+      if (this.signalingClient) {}
 
       this._setMode(CONNECTION_MODES.DISCONNECTED);
killedBy: PartyConnectionManager disconnect should clean up all services
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/services/party-connection-manager.js:164:11
         this.p2pService = null;
       }
 
-      if (this.signalingClient) {
+      if (false) {
         this.signalingClient.destroy();
         this.signalingClient = null;
killedBy: PartyConnectionManager disconnect should clean up all services
statusReason: expected "vi.fn()" to be called at least once

[Survived] StringLiteral
src/services/party-connection-manager.js:170:16
       }
 
       this._setMode(CONNECTION_MODES.DISCONNECTED);
-      log.info('Disconnected');
+      log.info("");
     }
 

[Killed] BlockStatement
src/services/party-connection-manager.js:176:15
     /**
      * Clean up all resources.
      */
-    destroy() {
-      this.disconnect();
-      this.onModeChangeCallback = null;
-      this.onPeerJoinedCallback = null;
-      this.onPeerLeftCallback = null;
-      this.onErrorCallback = null;
-      log.info('PartyConnectionManager destroyed');
-    }
+    destroy() {}
 
         // ============================================
killedBy: PartyConnectionManager destroy should clear all callbacks
statusReason: expected [Function] to be null

[Killed] BlockStatement
src/services/party-connection-manager.js:195:51
      * @private
      */
     _setupP2PHandlers() {
-      this.p2pService.onPeerConnected((peerId) => {
-        log.info('Peer connected via P2P', { peerId });
-
-        // P2P connection established
-        this._clearConnectionTimeout();
-        this._setMode(CONNECTION_MODES.P2P);
-        this.retryCount = 0;
-
-        if (this.onPeerJoinedCallback) {
-          this.onPeerJoinedCallback(peerId);
-        }
-
-        telemetry.track('party_p2p_connected', {
-          roomCode: this.roomCode,
-          isHost: this.isHost,
-        });
-      });
+      this.p2pService.onPeerConnected((peerId) => {});
 
       this.p2pService.onPeerDisconnected((peerId, reason) => {
killedBy: PartyConnectionManager event callbacks should transition to P2P mode when peer connects
statusReason: expected 'connecting' to be 'p2p' // Object.is equality

[Killed] BlockStatement
src/services/party-connection-manager.js:203:40
         this._setMode(CONNECTION_MODES.P2P);
         this.retryCount = 0;
 
-        if (this.onPeerJoinedCallback) {
-          this.onPeerJoinedCallback(peerId);
-        }
+        if (this.onPeerJoinedCallback) {}
 
         telemetry.track('party_p2p_connected', {
killedBy: PartyConnectionManager event callbacks should call onPeerJoined when peer connects
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-123' ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/party-connection-manager.js:203:13
         this._setMode(CONNECTION_MODES.P2P);
         this.retryCount = 0;
 
-        if (this.onPeerJoinedCallback) {
+        if (true) {
           this.onPeerJoinedCallback(peerId);
         }
killedBy: PartyConnectionManager event callbacks should transition to P2P mode when peer connects
statusReason: this.onPeerJoinedCallback is not a function

[Killed] BlockStatement
src/services/party-connection-manager.js:213:62
         });
       });
 
-      this.p2pService.onPeerDisconnected((peerId, reason) => {
-        log.info('Peer disconnected', { peerId, reason });
-
-        if (this.onPeerLeftCallback) {
-          this.onPeerLeftCallback(peerId, reason);
-        }
-
-        // If all peers disconnected, consider falling back
-        if (this.p2pService.getConnectedPeers().length === 0) {
-          this._handleAllPeersDisconnected();
-        }
-      });
+      this.p2pService.onPeerDisconnected((peerId, reason) => {});
     }
 
killedBy: PartyConnectionManager event callbacks should call onPeerLeft when peer disconnects
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-123', 'connection_lost' ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/party-connection-manager.js:216:13
       this.p2pService.onPeerDisconnected((peerId, reason) => {
         log.info('Peer disconnected', { peerId, reason });
 
-        if (this.onPeerLeftCallback) {
+        if (false) {
           this.onPeerLeftCallback(peerId, reason);
         }
killedBy: PartyConnectionManager event callbacks should call onPeerLeft when peer disconnects
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-123', 'connection_lost' ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/party-connection-manager.js:216:13
       this.p2pService.onPeerDisconnected((peerId, reason) => {
         log.info('Peer disconnected', { peerId, reason });
 
-        if (this.onPeerLeftCallback) {
+        if (true) {
           this.onPeerLeftCallback(peerId, reason);
         }
killedBy: PartyConnectionManager event callbacks should call onError when all peers disconnect in P2P mode
statusReason: this.onPeerLeftCallback is not a function

[Killed] EqualityOperator
src/services/party-connection-manager.js:221:13
         }
 
         // If all peers disconnected, consider falling back
-        if (this.p2pService.getConnectedPeers().length === 0) {
+        if (this.p2pService.getConnectedPeers().length !== 0) {
           this._handleAllPeersDisconnected();
         }
killedBy: PartyConnectionManager event callbacks should call onError when all peers disconnect in P2P mode
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Error> ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/party-connection-manager.js:221:13
         }
 
         // If all peers disconnected, consider falling back
-        if (this.p2pService.getConnectedPeers().length === 0) {
+        if (false) {
           this._handleAllPeersDisconnected();
         }
killedBy: PartyConnectionManager event callbacks should call onError when all peers disconnect in P2P mode
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Error> ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-connection-manager.js:233:20
      * @private
      * @param {string} mode - New mode
      */
-    _setMode(mode) {
-      if (this.mode === mode) return;
-
-      const previousMode = this.mode;
-      this.mode = mode;
-
-      log.info('Mode changed', { from: previousMode, to: mode });
-
-      if (this.onModeChangeCallback) {
-        this.onModeChangeCallback(mode, previousMode);
-      }
-    }
+    _setMode(mode) {}
 
     /**
killedBy: PartyConnectionManager connect should transition to CONNECTING mode
statusReason: expected 'disconnected' to be 'connecting' // Object.is equality

[Killed] ConditionalExpression
src/services/party-connection-manager.js:234:11
      * @param {string} mode - New mode
      */
     _setMode(mode) {
-      if (this.mode === mode) return;
+      if (true) return;
 
       const previousMode = this.mode;
killedBy: PartyConnectionManager connect should transition to CONNECTING mode
statusReason: expected 'disconnected' to be 'connecting' // Object.is equality

[Killed] EqualityOperator
src/services/party-connection-manager.js:234:11
      * @param {string} mode - New mode
      */
     _setMode(mode) {
-      if (this.mode === mode) return;
+      if (this.mode !== mode) return;
 
       const previousMode = this.mode;
killedBy: PartyConnectionManager connect should transition to CONNECTING mode
statusReason: expected 'disconnected' to be 'connecting' // Object.is equality

[Survived] StringLiteral
src/services/party-connection-manager.js:239:16
       const previousMode = this.mode;
       this.mode = mode;
 
-      log.info('Mode changed', { from: previousMode, to: mode });
+      log.info("", { from: previousMode, to: mode });
 
       if (this.onModeChangeCallback) {

[Killed] ConditionalExpression
src/services/party-connection-manager.js:241:11
 
       log.info('Mode changed', { from: previousMode, to: mode });
 
-      if (this.onModeChangeCallback) {
+      if (true) {
         this.onModeChangeCallback(mode, previousMode);
       }
killedBy: PartyConnectionManager connect should transition to CONNECTING mode
statusReason: this.onModeChangeCallback is not a function

[Killed] BlockStatement
src/services/party-connection-manager.js:241:38
 
       log.info('Mode changed', { from: previousMode, to: mode });
 
-      if (this.onModeChangeCallback) {
-        this.onModeChangeCallback(mode, previousMode);
-      }
+      if (this.onModeChangeCallback) {}
     }
 
killedBy: PartyConnectionManager event callbacks should call onModeChange when mode changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'connecting', 'disconnected' ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-connection-manager.js:251:31
      *
      * @private
      */
-    _startConnectionTimeout() {
-      this._clearConnectionTimeout();
-
-      this.connectionTimer = window.setTimeout(() => {
-        if (this.mode === CONNECTION_MODES.CONNECTING) {
-          log.warn('Connection timeout');
-          this._handleConnectionFailure(new Error('Connection timeout'));
-        }
-      }, CONFIG.connectionTimeout);
-    }
+    _startConnectionTimeout() {}
 
     /**
killedBy: PartyConnectionManager connection timeout should trigger fallback after timeout
statusReason: expected 'connecting' to be 'http_fallback' // Object.is equality

[Killed] BlockStatement
src/services/party-connection-manager.js:254:54
     _startConnectionTimeout() {
       this._clearConnectionTimeout();
 
-      this.connectionTimer = window.setTimeout(() => {
-        if (this.mode === CONNECTION_MODES.CONNECTING) {
-          log.warn('Connection timeout');
-          this._handleConnectionFailure(new Error('Connection timeout'));
-        }
-      }, CONFIG.connectionTimeout);
+      this.connectionTimer = window.setTimeout(() => {}, CONFIG.connectionTimeout);
     }
 
killedBy: PartyConnectionManager connection timeout should trigger fallback after timeout
statusReason: expected 'connecting' to be 'http_fallback' // Object.is equality

[Killed] BlockStatement
src/services/party-connection-manager.js:255:56
       this._clearConnectionTimeout();
 
       this.connectionTimer = window.setTimeout(() => {
-        if (this.mode === CONNECTION_MODES.CONNECTING) {
-          log.warn('Connection timeout');
-          this._handleConnectionFailure(new Error('Connection timeout'));
-        }
+        if (this.mode === CONNECTION_MODES.CONNECTING) {}
       }, CONFIG.connectionTimeout);
     }
killedBy: PartyConnectionManager connection timeout should trigger fallback after timeout
statusReason: expected 'connecting' to be 'http_fallback' // Object.is equality

[Killed] EqualityOperator
src/services/party-connection-manager.js:255:13
       this._clearConnectionTimeout();
 
       this.connectionTimer = window.setTimeout(() => {
-        if (this.mode === CONNECTION_MODES.CONNECTING) {
+        if (this.mode !== CONNECTION_MODES.CONNECTING) {
           log.warn('Connection timeout');
           this._handleConnectionFailure(new Error('Connection timeout'));
killedBy: PartyConnectionManager connection timeout should trigger fallback after timeout
statusReason: expected 'connecting' to be 'http_fallback' // Object.is equality

[Survived] BlockStatement
src/services/party-connection-manager.js:267:31
      *
      * @private
      */
-    _clearConnectionTimeout() {
-      if (this.connectionTimer) {
-        clearTimeout(this.connectionTimer);
-        this.connectionTimer = null;
-      }
-    }
+    _clearConnectionTimeout() {}
 
     /**

[Survived] ConditionalExpression
src/services/party-connection-manager.js:268:11
      * @private
      */
     _clearConnectionTimeout() {
-      if (this.connectionTimer) {
+      if (true) {
         clearTimeout(this.connectionTimer);
         this.connectionTimer = null;

[Survived] BlockStatement
src/services/party-connection-manager.js:268:33
      * @private
      */
     _clearConnectionTimeout() {
-      if (this.connectionTimer) {
-        clearTimeout(this.connectionTimer);
-        this.connectionTimer = null;
-      }
+      if (this.connectionTimer) {}
     }
 

[Killed] BlockStatement
src/services/party-connection-manager.js:280:37
      * @private
      * @param {Error} error - The error
      */
-    _handleConnectionFailure(error) {
-      this.retryCount++;
-
-      telemetry.track('party_p2p_failed', {
-        roomCode: this.roomCode,
-        attempt: this.retryCount,
-        error: error.message,
-      });
-
-      if (this.retryCount < CONFIG.maxRetries) {
-        log.info('Retrying P2P connection', { attempt: this.retryCount });
-        // Retry after a short delay
-        setTimeout(() => this.connect(), 2000);
-      } else {
-        log.warn('Max retries reached, falling back to HTTP');
-        this._activateHttpFallback();
-      }
-    }
+    _handleConnectionFailure(error) {}
 
     /**
killedBy: PartyConnectionManager connect should handle connection failure and return false
statusReason: expected 'connecting' to be 'http_fallback' // Object.is equality

[Killed] UpdateOperator
src/services/party-connection-manager.js:281:7
      * @param {Error} error - The error
      */
     _handleConnectionFailure(error) {
-      this.retryCount++;
+      this.retryCount--;
 
       telemetry.track('party_p2p_failed', {
killedBy: PartyConnectionManager connect should handle connection failure and return false
statusReason: expected 'connecting' to be 'http_fallback' // Object.is equality

[Survived] ObjectLiteral
src/services/party-connection-manager.js:283:43
     _handleConnectionFailure(error) {
       this.retryCount++;
 
-      telemetry.track('party_p2p_failed', {
-        roomCode: this.roomCode,
-        attempt: this.retryCount,
-        error: error.message,
-      });
+      telemetry.track('party_p2p_failed', {});
 
       if (this.retryCount < CONFIG.maxRetries) {

[Killed] EqualityOperator
src/services/party-connection-manager.js:289:11
         error: error.message,
       });
 
-      if (this.retryCount < CONFIG.maxRetries) {
+      if (this.retryCount <= CONFIG.maxRetries) {
         log.info('Retrying P2P connection', { attempt: this.retryCount });
         // Retry after a short delay
killedBy: PartyConnectionManager connection timeout should trigger fallback after timeout
statusReason: expected 'connecting' to be 'http_fallback' // Object.is equality

[Killed] BlockStatement
src/services/party-connection-manager.js:289:48
         error: error.message,
       });
 
-      if (this.retryCount < CONFIG.maxRetries) {
-        log.info('Retrying P2P connection', { attempt: this.retryCount });
-        // Retry after a short delay
-        setTimeout(() => this.connect(), 2000);
-      } else {
+      if (this.retryCount < CONFIG.maxRetries) {} else {
         log.warn('Max retries reached, falling back to HTTP');
         this._activateHttpFallback();
killedBy: PartyConnectionManager connection timeout should trigger fallback after timeout
statusReason: expected 'connecting' to be 'http_fallback' // Object.is equality

[Survived] StringLiteral
src/services/party-connection-manager.js:290:18
       });
 
       if (this.retryCount < CONFIG.maxRetries) {
-        log.info('Retrying P2P connection', { attempt: this.retryCount });
+        log.info("", { attempt: this.retryCount });
         // Retry after a short delay
         setTimeout(() => this.connect(), 2000);

[Killed] ArrowFunction
src/services/party-connection-manager.js:292:20
       if (this.retryCount < CONFIG.maxRetries) {
         log.info('Retrying P2P connection', { attempt: this.retryCount });
         // Retry after a short delay
-        setTimeout(() => this.connect(), 2000);
+        setTimeout(() => undefined, 2000);
       } else {
         log.warn('Max retries reached, falling back to HTTP');
killedBy: PartyConnectionManager connection timeout should trigger fallback after timeout
statusReason: expected 'connecting' to be 'http_fallback' // Object.is equality

[Killed] BlockStatement
src/services/party-connection-manager.js:293:14
         log.info('Retrying P2P connection', { attempt: this.retryCount });
         // Retry after a short delay
         setTimeout(() => this.connect(), 2000);
-      } else {
-        log.warn('Max retries reached, falling back to HTTP');
-        this._activateHttpFallback();
-      }
+      } else {}
     }
 
killedBy: PartyConnectionManager connect should handle connection failure and return false
statusReason: expected 'connecting' to be 'http_fallback' // Object.is equality

[Killed] BlockStatement
src/services/party-connection-manager.js:304:35
      *
      * @private
      */
-    _handleAllPeersDisconnected() {
-      if (this.mode === CONNECTION_MODES.P2P) {
-        log.warn('All peers disconnected');
-        // Could attempt reconnection or fallback here
-        if (this.onErrorCallback) {
-          this.onErrorCallback(new Error('All peers disconnected'));
-        }
-      }
-    }
+    _handleAllPeersDisconnected() {}
 
     /**
killedBy: PartyConnectionManager event callbacks should call onError when all peers disconnect in P2P mode
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Error> ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/party-connection-manager.js:305:11
      * @private
      */
     _handleAllPeersDisconnected() {
-      if (this.mode === CONNECTION_MODES.P2P) {
+      if (false) {
         log.warn('All peers disconnected');
         // Could attempt reconnection or fallback here
killedBy: PartyConnectionManager event callbacks should call onError when all peers disconnect in P2P mode
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Error> ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-connection-manager.js:305:47
      * @private
      */
     _handleAllPeersDisconnected() {
-      if (this.mode === CONNECTION_MODES.P2P) {
-        log.warn('All peers disconnected');
-        // Could attempt reconnection or fallback here
-        if (this.onErrorCallback) {
-          this.onErrorCallback(new Error('All peers disconnected'));
-        }
-      }
+      if (this.mode === CONNECTION_MODES.P2P) {}
     }
 
killedBy: PartyConnectionManager event callbacks should call onError when all peers disconnect in P2P mode
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Error> ]

Number of calls: 0

[Survived] StringLiteral
src/services/party-connection-manager.js:306:18
      */
     _handleAllPeersDisconnected() {
       if (this.mode === CONNECTION_MODES.P2P) {
-        log.warn('All peers disconnected');
+        log.warn("");
         // Could attempt reconnection or fallback here
         if (this.onErrorCallback) {

[Killed] ConditionalExpression
src/services/party-connection-manager.js:308:13
       if (this.mode === CONNECTION_MODES.P2P) {
         log.warn('All peers disconnected');
         // Could attempt reconnection or fallback here
-        if (this.onErrorCallback) {
+        if (false) {
           this.onErrorCallback(new Error('All peers disconnected'));
         }
killedBy: PartyConnectionManager event callbacks should call onError when all peers disconnect in P2P mode
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Error> ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-connection-manager.js:308:35
       if (this.mode === CONNECTION_MODES.P2P) {
         log.warn('All peers disconnected');
         // Could attempt reconnection or fallback here
-        if (this.onErrorCallback) {
-          this.onErrorCallback(new Error('All peers disconnected'));
-        }
+        if (this.onErrorCallback) {}
       }
     }
killedBy: PartyConnectionManager event callbacks should call onError when all peers disconnect in P2P mode
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Error> ]

Number of calls: 0

[Survived] StringLiteral
src/services/party-connection-manager.js:309:42
         log.warn('All peers disconnected');
         // Could attempt reconnection or fallback here
         if (this.onErrorCallback) {
-          this.onErrorCallback(new Error('All peers disconnected'));
+          this.onErrorCallback(new Error(""));
         }
       }
