[Killed] BlockStatement
src/services/party-connection-manager.js:319:29
      *
      * @private
      */
-    _activateHttpFallback() {
-      this._setMode(CONNECTION_MODES.HTTP_FALLBACK);
-
-      telemetry.track('party_http_fallback_activated', {
-        roomCode: this.roomCode,
-        retryCount: this.retryCount,
-      });
-
-      if (this.onErrorCallback) {
-        this.onErrorCallback(new Error('P2P failed, using HTTP fallback'));
-      }
-    }
+    _activateHttpFallback() {}
 
 
killedBy: PartyConnectionManager connect should handle connection failure and return false
statusReason: expected 'connecting' to be 'http_fallback' // Object.is equality

[Survived] StringLiteral
src/services/party-connection-manager.js:322:23
     _activateHttpFallback() {
       this._setMode(CONNECTION_MODES.HTTP_FALLBACK);
 
-      telemetry.track('party_http_fallback_activated', {
+      telemetry.track("", {
         roomCode: this.roomCode,
         retryCount: this.retryCount,

[Survived] ObjectLiteral
src/services/party-connection-manager.js:322:56
     _activateHttpFallback() {
       this._setMode(CONNECTION_MODES.HTTP_FALLBACK);
 
-      telemetry.track('party_http_fallback_activated', {
-        roomCode: this.roomCode,
-        retryCount: this.retryCount,
-      });
+      telemetry.track('party_http_fallback_activated', {});
 
       if (this.onErrorCallback) {

[Killed] ConditionalExpression
src/services/party-connection-manager.js:327:11
         retryCount: this.retryCount,
       });
 
-      if (this.onErrorCallback) {
+      if (true) {
         this.onErrorCallback(new Error('P2P failed, using HTTP fallback'));
       }
killedBy: PartyConnectionManager connect should handle connection failure and return false
statusReason: this.onErrorCallback is not a function

[Survived] ConditionalExpression
src/services/party-connection-manager.js:327:11
         retryCount: this.retryCount,
       });
 
-      if (this.onErrorCallback) {
+      if (false) {
         this.onErrorCallback(new Error('P2P failed, using HTTP fallback'));
       }

[Killed] BlockStatement
src/services/party-connection-manager.js:342:15
      *
      * @returns {string} Current mode
      */
-    getMode() {
-      return this.mode;
-    }
+    getMode() {}
 
     /**
killedBy: PartyConnectionManager connect should handle connection failure and return false
statusReason: expected undefined to be 'http_fallback' // Object.is equality

[Killed] BlockStatement
src/services/party-connection-manager.js:351:18
      *
      * @returns {PartySession|null} The session
      */
-    getSession() {
-      return this.session;
-    }
+    getSession() {}
 
     /**
killedBy: PartyConnectionManager getSession should return null before connect
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/services/party-connection-manager.js:361:52
      * @returns {boolean}
      */
     isConnected() {
-      return this.mode === CONNECTION_MODES.P2P || this.mode === CONNECTION_MODES.HTTP_FALLBACK;
+      return this.mode === CONNECTION_MODES.P2P || false;
     }
 
killedBy: PartyConnectionManager isConnected should return true when in HTTP fallback mode
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/party-connection-manager.js:361:52
      * @returns {boolean}
      */
     isConnected() {
-      return this.mode === CONNECTION_MODES.P2P || this.mode === CONNECTION_MODES.HTTP_FALLBACK;
+      return this.mode === CONNECTION_MODES.P2P || this.mode !== CONNECTION_MODES.HTTP_FALLBACK;
     }
 
killedBy: PartyConnectionManager isConnected should return false when disconnected
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/party-connection-manager.js:369:13
      *
      * @returns {boolean}
      */
-    isP2P() {
-      return this.mode === CONNECTION_MODES.P2P;
-    }
+    isP2P() {}
 
     /**
killedBy: PartyConnectionManager isP2P should return false when not in P2P mode
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/services/party-connection-manager.js:370:14
      * @returns {boolean}
      */
     isP2P() {
-      return this.mode === CONNECTION_MODES.P2P;
+      return false;
     }
 
killedBy: PartyConnectionManager isP2P should return true when in P2P mode
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/party-connection-manager.js:370:14
      * @returns {boolean}
      */
     isP2P() {
-      return this.mode === CONNECTION_MODES.P2P;
+      return this.mode !== CONNECTION_MODES.P2P;
     }
 
killedBy: PartyConnectionManager isP2P should return false when not in P2P mode
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/services/party-connection-manager.js:378:16
      *
      * @returns {string[]}
      */
-    getPeers() {
-      if (!this.p2pService) return [];
-      return this.p2pService.getConnectedPeers();
-    }
+    getPeers() {}
 
     /**
killedBy: PartyConnectionManager getPeers should return empty array before connect
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/services/party-connection-manager.js:379:11
      * @returns {string[]}
      */
     getPeers() {
-      if (!this.p2pService) return [];
+      if (false) return [];
       return this.p2pService.getConnectedPeers();
     }
killedBy: PartyConnectionManager getPeers should return empty array before connect
statusReason: Cannot read properties of null (reading 'getConnectedPeers')

[Killed] BooleanLiteral
src/services/party-connection-manager.js:379:11
      * @returns {string[]}
      */
     getPeers() {
-      if (!this.p2pService) return [];
+      if (this.p2pService) return [];
       return this.p2pService.getConnectedPeers();
     }
killedBy: PartyConnectionManager getPeers should return empty array before connect
statusReason: Cannot read properties of null (reading 'getConnectedPeers')

[Killed] BlockStatement
src/services/party-connection-manager.js:388:17
      *
      * @returns {string|null}
      */
-    getHostId() {
-      return this.hostId;
-    }
+    getHostId() {}
 
     // ============================================
killedBy: PartyConnectionManager getHostId should return null before connect
statusReason: expected undefined to be null

[Killed] BlockStatement
src/services/party-connection-manager.js:401:28
      *
      * @param {Function} callback - Called with (newMode, previousMode)
      */
-    onModeChange(callback) {
-      this.onModeChangeCallback = callback;
-    }
+    onModeChange(callback) {}
 
     /**
killedBy: PartyConnectionManager event callbacks should call onModeChange when mode changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'connecting', 'disconnected' ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-connection-manager.js:410:28
      *
      * @param {Function} callback - Called with (peerId)
      */
-    onPeerJoined(callback) {
-      this.onPeerJoinedCallback = callback;
-    }
+    onPeerJoined(callback) {}
 
     /**
killedBy: PartyConnectionManager event callbacks should call onPeerJoined when peer connects
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-123' ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-connection-manager.js:419:26
      *
      * @param {Function} callback - Called with (peerId, reason)
      */
-    onPeerLeft(callback) {
-      this.onPeerLeftCallback = callback;
-    }
+    onPeerLeft(callback) {}
 
     /**
killedBy: PartyConnectionManager event callbacks should call onPeerLeft when peer disconnects
statusReason: expected "vi.fn()" to be called with arguments: [ 'peer-123', 'connection_lost' ]

Number of calls: 0

[Killed] BlockStatement
src/services/party-connection-manager.js:428:23
      *
      * @param {Function} callback - Called with (error)
      */
-    onError(callback) {
-      this.onErrorCallback = callback;
-    }
+    onError(callback) {}
 
   }
killedBy: PartyConnectionManager event callbacks should call onError when all peers disconnect in P2P mode
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Error> ]

Number of calls: 0
