[Killed] BlockStatement
src/core/db.js:11:38
 let dbPromise;
 
 // Initialize database and create object stores
-export async function initDatabase() {
-    dbPromise = openDB(DB_NAME, DB_VERSION, {
-        upgrade(db) {
-            // Create 'topics' object store
-            if (!db.objectStoreNames.contains('topics')) {
-                const topicStore = db.createObjectStore('topics', { keyPath: 'id' });
-                topicStore.createIndex('byName', 'name');
-            }
-
-            // Create 'sessions' object store
-            if (!db.objectStoreNames.contains('sessions')) {
-                const sessionStore = db.createObjectStore('sessions', { keyPath: 'id', autoIncrement: true  });
-                sessionStore.createIndex('byTopicId', 'topicId');
-                sessionStore.createIndex('byTimestamp', 'timestamp');
-            }
-
-            // Create 'settings' object store
-            if (!db.objectStoreNames.contains('settings')) {
-                db.createObjectStore('settings', { keyPath: 'key' });
-            }
-        }   
-    });
-    return dbPromise; 
-}
+export async function initDatabase() {}
 
 // Get a reference to the database
killedBy: Database Initialization should create database with all object stores
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/core/db.js:13:21
 // Initialize database and create object stores
 export async function initDatabase() {
     dbPromise = openDB(DB_NAME, DB_VERSION, {
-        upgrade(db) {
-            // Create 'topics' object store
-            if (!db.objectStoreNames.contains('topics')) {
-                const topicStore = db.createObjectStore('topics', { keyPath: 'id' });
-                topicStore.createIndex('byName', 'name');
-            }
-
-            // Create 'sessions' object store
-            if (!db.objectStoreNames.contains('sessions')) {
-                const sessionStore = db.createObjectStore('sessions', { keyPath: 'id', autoIncrement: true  });
-                sessionStore.createIndex('byTopicId', 'topicId');
-                sessionStore.createIndex('byTimestamp', 'timestamp');
-            }
-
-            // Create 'settings' object store
-            if (!db.objectStoreNames.contains('settings')) {
-                db.createObjectStore('settings', { keyPath: 'key' });
-            }
-        }   
+        upgrade(db) {}   
     });
     return dbPromise; 
killedBy: Database Initialization should create database with all object stores
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/db.js:15:17
     dbPromise = openDB(DB_NAME, DB_VERSION, {
         upgrade(db) {
             // Create 'topics' object store
-            if (!db.objectStoreNames.contains('topics')) {
+            if (db.objectStoreNames.contains('topics')) {
                 const topicStore = db.createObjectStore('topics', { keyPath: 'id' });
                 topicStore.createIndex('byName', 'name');
killedBy: Database Initialization should create database with all object stores
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/db.js:15:17
     dbPromise = openDB(DB_NAME, DB_VERSION, {
         upgrade(db) {
             // Create 'topics' object store
-            if (!db.objectStoreNames.contains('topics')) {
+            if (false) {
                 const topicStore = db.createObjectStore('topics', { keyPath: 'id' });
                 topicStore.createIndex('byName', 'name');
killedBy: Database Initialization should create database with all object stores
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/core/db.js:16:78
         upgrade(db) {
             // Create 'topics' object store
             if (!db.objectStoreNames.contains('topics')) {
-                const topicStore = db.createObjectStore('topics', { keyPath: 'id' });
+                const topicStore = db.createObjectStore('topics', { keyPath: "" });
                 topicStore.createIndex('byName', 'name');
             }

[Survived] StringLiteral
src/core/db.js:17:40
             // Create 'topics' object store
             if (!db.objectStoreNames.contains('topics')) {
                 const topicStore = db.createObjectStore('topics', { keyPath: 'id' });
-                topicStore.createIndex('byName', 'name');
+                topicStore.createIndex("", 'name');
             }
 

[Killed] BooleanLiteral
src/core/db.js:21:17
             }
 
             // Create 'sessions' object store
-            if (!db.objectStoreNames.contains('sessions')) {
+            if (db.objectStoreNames.contains('sessions')) {
                 const sessionStore = db.createObjectStore('sessions', { keyPath: 'id', autoIncrement: true  });
                 sessionStore.createIndex('byTopicId', 'topicId');
killedBy: Database Initialization should create database with all object stores
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/db.js:21:60
             }
 
             // Create 'sessions' object store
-            if (!db.objectStoreNames.contains('sessions')) {
-                const sessionStore = db.createObjectStore('sessions', { keyPath: 'id', autoIncrement: true  });
-                sessionStore.createIndex('byTopicId', 'topicId');
-                sessionStore.createIndex('byTimestamp', 'timestamp');
-            }
+            if (!db.objectStoreNames.contains('sessions')) {}
 
             // Create 'settings' object store
killedBy: Database Initialization should create database with all object stores
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/core/db.js:22:103
 
             // Create 'sessions' object store
             if (!db.objectStoreNames.contains('sessions')) {
-                const sessionStore = db.createObjectStore('sessions', { keyPath: 'id', autoIncrement: true  });
+                const sessionStore = db.createObjectStore('sessions', { keyPath: 'id', autoIncrement: false  });
                 sessionStore.createIndex('byTopicId', 'topicId');
                 sessionStore.createIndex('byTimestamp', 'timestamp');

[Killed] StringLiteral
src/core/db.js:22:59
 
             // Create 'sessions' object store
             if (!db.objectStoreNames.contains('sessions')) {
-                const sessionStore = db.createObjectStore('sessions', { keyPath: 'id', autoIncrement: true  });
+                const sessionStore = db.createObjectStore("", { keyPath: 'id', autoIncrement: true  });
                 sessionStore.createIndex('byTopicId', 'topicId');
                 sessionStore.createIndex('byTimestamp', 'timestamp');
killedBy: Database Initialization should create database with all object stores
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/core/db.js:24:57
             if (!db.objectStoreNames.contains('sessions')) {
                 const sessionStore = db.createObjectStore('sessions', { keyPath: 'id', autoIncrement: true  });
                 sessionStore.createIndex('byTopicId', 'topicId');
-                sessionStore.createIndex('byTimestamp', 'timestamp');
+                sessionStore.createIndex('byTimestamp', "");
             }
 

[Killed] BooleanLiteral
src/core/db.js:28:17
             }
 
             // Create 'settings' object store
-            if (!db.objectStoreNames.contains('settings')) {
+            if (db.objectStoreNames.contains('settings')) {
                 db.createObjectStore('settings', { keyPath: 'key' });
             }
killedBy: Database Initialization should create database with all object stores
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/db.js:28:17
             }
 
             // Create 'settings' object store
-            if (!db.objectStoreNames.contains('settings')) {
+            if (false) {
                 db.createObjectStore('settings', { keyPath: 'key' });
             }
killedBy: Database Initialization should create database with all object stores
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/core/db.js:29:38
 
             // Create 'settings' object store
             if (!db.objectStoreNames.contains('settings')) {
-                db.createObjectStore('settings', { keyPath: 'key' });
+                db.createObjectStore("", { keyPath: 'key' });
             }
         }   
killedBy: Database Initialization should create database with all object stores
statusReason: expected false to be true // Object.is equality

[Survived] ObjectLiteral
src/core/db.js:29:50
 
             // Create 'settings' object store
             if (!db.objectStoreNames.contains('settings')) {
-                db.createObjectStore('settings', { keyPath: 'key' });
+                db.createObjectStore('settings', {});
             }
         }   

[Killed] BlockStatement
src/core/db.js:37:24
 }
 
 // Get a reference to the database
-async function getDB() {
-    if (!dbPromise) {
-        dbPromise = initDatabase();
-    }
-    return dbPromise;
-}
+async function getDB() {}
 
 // ========== TOPICS ==========
killedBy: Topics CRUD Operations should save and retrieve a topic
statusReason: Cannot read properties of undefined (reading 'put')

[Killed] BooleanLiteral
src/core/db.js:38:9
 
 // Get a reference to the database
 async function getDB() {
-    if (!dbPromise) {
+    if (dbPromise) {
         dbPromise = initDatabase();
     }
killedBy: Topics CRUD Operations should save and retrieve a topic
statusReason: Cannot read properties of undefined (reading 'put')

[Killed] ConditionalExpression
src/core/db.js:38:9
 
 // Get a reference to the database
 async function getDB() {
-    if (!dbPromise) {
+    if (false) {
         dbPromise = initDatabase();
     }
killedBy: Topics CRUD Operations should save and retrieve a topic
statusReason: Cannot read properties of undefined (reading 'put')

[Killed] BlockStatement
src/core/db.js:46:40
 
 // ========== TOPICS ==========
 
-export async function saveTopic(topic) {
-    const db = await getDB();
-    return db.put('topics', topic);
-}
+export async function saveTopic(topic) {}
 
 export async function getTopic(id) {
killedBy: Topics CRUD Operations should save and retrieve a topic
statusReason: expected undefined to deeply equal { id: 'math', …(6) }

[Killed] BlockStatement
src/core/db.js:51:36
     return db.put('topics', topic);
 }
 
-export async function getTopic(id) {
-    const db = await getDB();
-    return db.get('topics', id);
-}
+export async function getTopic(id) {}
 
 export async function getAllTopics() {
killedBy: Topics CRUD Operations should save and retrieve a topic
statusReason: expected undefined to deeply equal { id: 'math', …(6) }

[Killed] BlockStatement
src/core/db.js:56:38
     return db.get('topics', id);
 }
 
-export async function getAllTopics() {
-    const db = await getDB();
-    return db.getAll('topics');
-}
+export async function getAllTopics() {}
 
   // ========== SESSIONS ==========
killedBy: Topics CRUD Operations should retrieve all topics
statusReason: Target cannot be null or undefined.

[Killed] StringLiteral
src/core/db.js:58:22
 
 export async function getAllTopics() {
     const db = await getDB();
-    return db.getAll('topics');
+    return db.getAll("");
 }
 
killedBy: Topics CRUD Operations should retrieve all topics
statusReason: No objectStore named  in this database

[Killed] BlockStatement
src/core/db.js:63:46
 
   // ========== SESSIONS ==========
 
-  export async function saveSession(session) {
-    const db = await getDB();
-    return db.add('sessions', session);
-  }
+  export async function saveSession(session) {}
 
   export async function getSession(id) {
killedBy: Sessions CRUD Operations should save session and auto-generate ID
statusReason: expected undefined to be 1 // Object.is equality

[Killed] StringLiteral
src/core/db.js:65:19
 
   export async function saveSession(session) {
     const db = await getDB();
-    return db.add('sessions', session);
+    return db.add("", session);
   }
 
killedBy: Sessions CRUD Operations should save session and auto-generate ID
statusReason: No objectStore named  in this database

[Killed] BlockStatement
src/core/db.js:68:40
     return db.add('sessions', session);
   }
 
-  export async function getSession(id) {
-    const db = await getDB();
-    return db.get('sessions', id);
-  }
+  export async function getSession(id) {}
 
   export async function getSessionsByTopic(topicId) {
killedBy: Sessions CRUD Operations should retrieve session by ID
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/core/db.js:73:53
     return db.get('sessions', id);
   }
 
-  export async function getSessionsByTopic(topicId) {
-    const db = await getDB();
-    return db.getAllFromIndex('sessions', 'byTopicId', topicId);
-  }
+  export async function getSessionsByTopic(topicId) {}
 
   /**
killedBy: Sessions CRUD Operations should get all sessions for a specific topic
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/core/db.js:82:42
    * Get all sessions from the database
    * @returns {Promise<Array>} All session objects
    */
-  export async function getAllSessions() {
-    const db = await getDB();
-    return db.getAll('sessions');
-  }
+  export async function getAllSessions() {}
 
   /**
killedBy: getAllSessions should return all sessions
statusReason: Target cannot be null or undefined.

[Killed] StringLiteral
src/core/db.js:84:22
    */
   export async function getAllSessions() {
     const db = await getDB();
-    return db.getAll('sessions');
+    return db.getAll("");
   }
 
killedBy: getAllSessions should return all sessions
statusReason: No objectStore named  in this database

[Killed] BlockStatement
src/core/db.js:93:42
    * @param {number|string|null|undefined} ts - Timestamp value
    * @returns {number} Normalized timestamp in milliseconds
    */
-  export function normalizeTimestamp(ts) {
-    if (!ts) return 0;
-    if (typeof ts === 'number') return ts;
-    if (typeof ts === 'string') {
-      const parsed = Date.parse(ts);
-      return isNaN(parsed) ? 0 : parsed;
-    }
-    return 0;
-  }
+  export function normalizeTimestamp(ts) {}
 
   export async function getRecentSessions(limit = 10) {
killedBy: getRecentSessions - mixed timestamp sorting returns sessions sorted by timestamp descending (newest first)
statusReason: expected 'Old Quiz' to be 'Today Quiz' // Object.is equality

[Killed] BooleanLiteral
src/core/db.js:94:9
    * @returns {number} Normalized timestamp in milliseconds
    */
   export function normalizeTimestamp(ts) {
-    if (!ts) return 0;
+    if (ts) return 0;
     if (typeof ts === 'number') return ts;
     if (typeof ts === 'string') {
killedBy: getRecentSessions - mixed timestamp sorting returns sessions sorted by timestamp descending (newest first)
statusReason: expected 'Old Quiz' to be 'Today Quiz' // Object.is equality

[Killed] ConditionalExpression
src/core/db.js:94:9
    * @returns {number} Normalized timestamp in milliseconds
    */
   export function normalizeTimestamp(ts) {
-    if (!ts) return 0;
+    if (true) return 0;
     if (typeof ts === 'number') return ts;
     if (typeof ts === 'string') {
killedBy: getRecentSessions - mixed timestamp sorting returns sessions sorted by timestamp descending (newest first)
statusReason: expected 'Old Quiz' to be 'Today Quiz' // Object.is equality

[Killed] ConditionalExpression
src/core/db.js:95:9
    */
   export function normalizeTimestamp(ts) {
     if (!ts) return 0;
-    if (typeof ts === 'number') return ts;
+    if (true) return ts;
     if (typeof ts === 'string') {
       const parsed = Date.parse(ts);
killedBy: getRecentSessions - mixed timestamp sorting handles mixed timestamp types (string ISO and number)
statusReason: expected 'Last Week Import' to be 'Today Played' // Object.is equality

[Killed] BlockStatement
src/core/db.js:96:33
   export function normalizeTimestamp(ts) {
     if (!ts) return 0;
     if (typeof ts === 'number') return ts;
-    if (typeof ts === 'string') {
-      const parsed = Date.parse(ts);
-      return isNaN(parsed) ? 0 : parsed;
-    }
+    if (typeof ts === 'string') {}
     return 0;
   }
killedBy: normalizeTimestamp converts ISO string to number
statusReason: expected +0 to be 1768564800000 // Object.is equality

[Killed] StringLiteral
src/core/db.js:105:33
 
   export async function getRecentSessions(limit = 10) {
     const db = await getDB();
-    const all = await db.getAll('sessions');
+    const all = await db.getAll("");
 
     // Normalize and sort by timestamp descending (newest first)
killedBy: Sessions CRUD Operations should get recent sessions sorted by timestamp
statusReason: No objectStore named  in this database

[Killed] BlockStatement
src/core/db.js:108:24
     const all = await db.getAll('sessions');
 
     // Normalize and sort by timestamp descending (newest first)
-    all.sort((a, b) => {
-      const tsA = normalizeTimestamp(a.timestamp);
-      const tsB = normalizeTimestamp(b.timestamp);
-      return tsB - tsA;
-    });
+    all.sort((a, b) => {});
 
     return all.slice(0, limit);
killedBy: getRecentSessions - mixed timestamp sorting returns sessions sorted by timestamp descending (newest first)
statusReason: expected 'Old Quiz' to be 'Today Quiz' // Object.is equality

[Killed] MethodExpression
src/core/db.js:114:12
       return tsB - tsA;
     });
 
-    return all.slice(0, limit);
+    return all;
   }
 
killedBy: Sessions CRUD Operations should limit recent sessions to specified amount
statusReason: expected [ { topicId: 'math', …(3) }, …(12) ] to have a length of 5 but got 13

[Killed] BooleanLiteral
src/core/db.js:120:9
   export async function updateSession(id, updates) {
     const db = await getDB();
     const session = await db.get('sessions', id);
-    if (!session) return null;
+    if (session) return null;
 
     const updatedSession = { ...session, ...updates };
killedBy: updateSession - Quiz Replay should update existing session with new data
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/core/db.js:120:9
   export async function updateSession(id, updates) {
     const db = await getDB();
     const session = await db.get('sessions', id);
-    if (!session) return null;
+    if (false) return null;
 
     const updatedSession = { ...session, ...updates };
killedBy: updateSession - Quiz Replay should return null for non-existent session
statusReason: expected { score: 5 } to be null

[Killed] StringLiteral
src/core/db.js:123:18
     if (!session) return null;
 
     const updatedSession = { ...session, ...updates };
-    await db.put('sessions', updatedSession);
+    await db.put("", updatedSession);
     return updatedSession;
   }
killedBy: updateSession - Quiz Replay should update existing session with new data
statusReason: No objectStore named  in this database

[Killed] BlockStatement
src/core/db.js:135:101
    * @param {string} rightAnswerExplanation - The explanation to cache
    * @returns {Promise<Object|null>} Updated session or null if not found
    */
-  export async function updateQuestionExplanation(sessionId, questionIndex, rightAnswerExplanation) {
-    const db = await getDB();
-    const session = await db.get('sessions', sessionId);
-    if (!session) return null;
-
-    // Ensure questions array exists and index is valid
-    if (!session.questions || questionIndex < 0 || questionIndex >= session.questions.length) {
-      return null;
-    }
-
-    // Update the specific question's rightAnswerExplanation
-    session.questions[questionIndex] = {
-      ...session.questions[questionIndex],
-      rightAnswerExplanation
-    };
-
-    await db.put('sessions', session);
-    return session;
-  }
+  export async function updateQuestionExplanation(sessionId, questionIndex, rightAnswerExplanation) {}
 
   /**
killedBy: updateQuestionExplanation should update a question explanation
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] ConditionalExpression
src/core/db.js:138:9
   export async function updateQuestionExplanation(sessionId, questionIndex, rightAnswerExplanation) {
     const db = await getDB();
     const session = await db.get('sessions', sessionId);
-    if (!session) return null;
+    if (true) return null;
 
     // Ensure questions array exists and index is valid
killedBy: updateQuestionExplanation should update a question explanation
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/core/db.js:138:9
   export async function updateQuestionExplanation(sessionId, questionIndex, rightAnswerExplanation) {
     const db = await getDB();
     const session = await db.get('sessions', sessionId);
-    if (!session) return null;
+    if (false) return null;
 
     // Ensure questions array exists and index is valid
killedBy: updateQuestionExplanation should return null for non-existent session
statusReason: Cannot read properties of undefined (reading 'questions')

[Killed] BlockStatement
src/core/db.js:141:95
     if (!session) return null;
 
     // Ensure questions array exists and index is valid
-    if (!session.questions || questionIndex < 0 || questionIndex >= session.questions.length) {
-      return null;
-    }
+    if (!session.questions || questionIndex < 0 || questionIndex >= session.questions.length) {}
 
     // Update the specific question's rightAnswerExplanation
killedBy: updateQuestionExplanation should return null for invalid question index (negative)
statusReason: expected { topicId: 'math', …(5) } to be null

[Killed] ConditionalExpression
src/core/db.js:141:9
     if (!session) return null;
 
     // Ensure questions array exists and index is valid
-    if (!session.questions || questionIndex < 0 || questionIndex >= session.questions.length) {
+    if (false) {
       return null;
     }
killedBy: updateQuestionExplanation should return null for invalid question index (negative)
statusReason: expected { topicId: 'math', …(5) } to be null

[Killed] StringLiteral
src/core/db.js:151:18
       rightAnswerExplanation
     };
 
-    await db.put('sessions', session);
+    await db.put("", session);
     return session;
   }
killedBy: updateQuestionExplanation should update a question explanation
statusReason: No objectStore named  in this database

[Killed] BlockStatement
src/core/db.js:160:43
    * @param {number} id - Session ID to delete
    * @returns {Promise<void>}
    */
-  export async function deleteSession(id) {
-    const db = await getDB();
-    return db.delete('sessions', id);
-  }
+  export async function deleteSession(id) {}
 
   /**
killedBy: deleteSession should delete a session by ID
statusReason: expected { topicId: 'math', …(5) } to be undefined

[Killed] StringLiteral
src/core/db.js:162:22
    */
   export async function deleteSession(id) {
     const db = await getDB();
-    return db.delete('sessions', id);
+    return db.delete("", id);
   }
 
killedBy: deleteSession should delete a session by ID
statusReason: No objectStore named  in this database

[Killed] BlockStatement
src/core/db.js:171:60
    * @param {string} sourceQuizId - The original quiz ID to check for
    * @returns {Promise<boolean>} True if quiz exists, false otherwise
    */
-  export async function quizExistsBySourceId(sourceQuizId) {
-    const db = await getDB();
-    const allSessions = await db.getAll('sessions');
-    return allSessions.some(session => session.sourceQuizId === sourceQuizId);
-  }
+  export async function quizExistsBySourceId(sourceQuizId) {}
 
   /**
killedBy: quizExistsBySourceId should return true when quiz with sourceQuizId exists
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrowFunction
src/core/db.js:174:29
   export async function quizExistsBySourceId(sourceQuizId) {
     const db = await getDB();
     const allSessions = await db.getAll('sessions');
-    return allSessions.some(session => session.sourceQuizId === sourceQuizId);
+    return allSessions.some(() => undefined);
   }
 
killedBy: quizExistsBySourceId should return true when quiz with sourceQuizId exists
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/core/db.js:174:12
   export async function quizExistsBySourceId(sourceQuizId) {
     const db = await getDB();
     const allSessions = await db.getAll('sessions');
-    return allSessions.some(session => session.sourceQuizId === sourceQuizId);
+    return allSessions.every(session => session.sourceQuizId === sourceQuizId);
   }
 
killedBy: quizExistsBySourceId should distinguish between different sourceQuizIds
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/db.js:184:40
     const db = await getDB();
     const allSessions = await db.getAll('sessions');
 
-    for (const session of allSessions) {
-      if (session.isSample) {
-        await db.delete('sessions', session.id);
-      }
-    }
+    for (const session of allSessions) {}
   }
 
killedBy: deleteSampleSessions should delete all sample sessions
statusReason: expected [ { topicId: 'user1', …(3) }, …(3) ] to have a length of 2 but got 4

[Killed] BlockStatement
src/core/db.js:185:29
     const allSessions = await db.getAll('sessions');
 
     for (const session of allSessions) {
-      if (session.isSample) {
-        await db.delete('sessions', session.id);
-      }
+      if (session.isSample) {}
     }
   }
killedBy: deleteSampleSessions should delete all sample sessions
statusReason: expected [ { topicId: 'user1', …(3) }, …(3) ] to have a length of 2 but got 4

[Killed] BlockStatement
src/core/db.js:193:41
 
     // ========== SETTINGS ==========
 
-  export async function getSetting(key) {
-    const db = await getDB();
-    const setting = await db.get('settings', key);
-    return setting?.value;
-  }
+  export async function getSetting(key) {}
 
   export async function saveSetting(key, value) {
killedBy: Settings CRUD Operations should save and retrieve a setting
statusReason: expected undefined to be 'sk-ant-test123' // Object.is equality

[Killed] OptionalChaining
src/core/db.js:196:12
   export async function getSetting(key) {
     const db = await getDB();
     const setting = await db.get('settings', key);
-    return setting?.value;
+    return setting.value;
   }
 
killedBy: Settings CRUD Operations should return undefined for non-existent setting
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
src/core/db.js:199:49
     return setting?.value;
   }
 
-  export async function saveSetting(key, value) {
-    const db = await getDB();
-    return db.put('settings', { key, value });
-  }
+  export async function saveSetting(key, value) {}
 
     // ========== OPENROUTER ==========
killedBy: Settings CRUD Operations should save and retrieve a setting
statusReason: expected undefined to be 'sk-ant-test123' // Object.is equality

[Killed] StringLiteral
src/core/db.js:206:26
 
     // ========== OPENROUTER ==========
 
-  const OPENROUTER_KEY = 'openrouter_api_key';
+  const OPENROUTER_KEY = "";
 
   /**
killedBy: OpenRouter Key Storage should store timestamp with the key
statusReason: Cannot read properties of undefined (reading 'storedAt')

[Killed] BlockStatement
src/core/db.js:212:52
    * Store OpenRouter API key
    * @param {string} apiKey - The API key to store
    */
-  export async function storeOpenRouterKey(apiKey) {
-    return saveSetting(OPENROUTER_KEY, {
-      key: apiKey,
-      storedAt: new Date().toISOString()
-    });
-  }
+  export async function storeOpenRouterKey(apiKey) {}
 
   /**
killedBy: OpenRouter Key Storage should store and retrieve OpenRouter API key
statusReason: expected null to be 'sk-or-v1-test123' // Object.is equality

[Killed] BlockStatement
src/core/db.js:223:44
    * Get stored OpenRouter API key
    * @returns {Promise<string|null>} The API key or null if not found
    */
-  export async function getOpenRouterKey() {
-    const data = await getSetting(OPENROUTER_KEY);
-    return data?.key || null;
-  }
+  export async function getOpenRouterKey() {}
 
   /**
killedBy: OpenRouter Key Storage should store and retrieve OpenRouter API key
statusReason: expected undefined to be 'sk-or-v1-test123' // Object.is equality

[Killed] ConditionalExpression
src/core/db.js:225:12
    */
   export async function getOpenRouterKey() {
     const data = await getSetting(OPENROUTER_KEY);
-    return data?.key || null;
+    return true;
   }
 
killedBy: OpenRouter Key Storage should store and retrieve OpenRouter API key
statusReason: expected true to be 'sk-or-v1-test123' // Object.is equality

[Killed] ConditionalExpression
src/core/db.js:225:12
    */
   export async function getOpenRouterKey() {
     const data = await getSetting(OPENROUTER_KEY);
-    return data?.key || null;
+    return false;
   }
 
killedBy: OpenRouter Key Storage should store and retrieve OpenRouter API key
statusReason: expected false to be 'sk-or-v1-test123' // Object.is equality

[Killed] StringLiteral
src/core/db.js:233:22
    */
   export async function removeOpenRouterKey() {
     const db = await getDB();
-    return db.delete('settings', OPENROUTER_KEY);
+    return db.delete("", OPENROUTER_KEY);
   }
 
killedBy: OpenRouter Key Storage should remove OpenRouter key
statusReason: No objectStore named  in this database

[Killed] BooleanLiteral
src/core/db.js:242:12
    */
   export async function isOpenRouterConnected() {
     const key = await getOpenRouterKey();
-    return !!key;
+    return !key;
   }
 
killedBy: OpenRouter Key Storage should report connected status correctly
statusReason: expected true to be false // Object.is equality
