[Killed] BlockStatement
src/core/db.js:252:44
    * Preserves sample sessions but clears all user-created data.
    * @returns {Promise<void>}
    */
-  export async function clearAllUserData() {
-    const db = await getDB();
-
-    // Delete all non-sample sessions
-    const allSessions = await db.getAll('sessions');
-    for (const session of allSessions) {
-      if (!session.isSample) {
-        await db.delete('sessions', session.id);
-      }
-    }
-
-    // Clear all topics
-    const allTopics = await db.getAll('topics');
-    for (const topic of allTopics) {
-      await db.delete('topics', topic.id);
-    }
-
-    // Clear all settings
-    const tx = db.transaction('settings', 'readwrite');
-    await tx.store.clear();
-    await tx.done;
-  }
+  export async function clearAllUserData() {}
killedBy: getAllSessions should only contain sample sessions after clearAllUserData
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/core/db.js:256:41
     const db = await getDB();
 
     // Delete all non-sample sessions
-    const allSessions = await db.getAll('sessions');
+    const allSessions = await db.getAll("");
     for (const session of allSessions) {
       if (!session.isSample) {
killedBy: getAllSessions should return all sessions
statusReason: No objectStore named  in this database

[Killed] BlockStatement
src/core/db.js:257:40
 
     // Delete all non-sample sessions
     const allSessions = await db.getAll('sessions');
-    for (const session of allSessions) {
-      if (!session.isSample) {
-        await db.delete('sessions', session.id);
-      }
-    }
+    for (const session of allSessions) {}
 
     // Clear all topics
killedBy: getAllSessions should only contain sample sessions after clearAllUserData
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/db.js:258:11
     // Delete all non-sample sessions
     const allSessions = await db.getAll('sessions');
     for (const session of allSessions) {
-      if (!session.isSample) {
+      if (session.isSample) {
         await db.delete('sessions', session.id);
       }
killedBy: getAllSessions should only contain sample sessions after clearAllUserData
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/db.js:258:11
     // Delete all non-sample sessions
     const allSessions = await db.getAll('sessions');
     for (const session of allSessions) {
-      if (!session.isSample) {
+      if (true) {
         await db.delete('sessions', session.id);
       }
killedBy: clearAllUserData should clear all non-sample sessions
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/core/db.js:264:39
     }
 
     // Clear all topics
-    const allTopics = await db.getAll('topics');
+    const allTopics = await db.getAll("");
     for (const topic of allTopics) {
       await db.delete('topics', topic.id);
killedBy: getAllSessions should return all sessions
statusReason: No objectStore named  in this database

[Killed] BlockStatement
src/core/db.js:265:36
 
     // Clear all topics
     const allTopics = await db.getAll('topics');
-    for (const topic of allTopics) {
-      await db.delete('topics', topic.id);
-    }
+    for (const topic of allTopics) {}
 
     // Clear all settings
killedBy: clearAllUserData should clear all topics
statusReason: expected [ { id: 'math', …(1) }, …(1) ] to have a length of +0 but got 2

[Killed] StringLiteral
src/core/db.js:266:23
     // Clear all topics
     const allTopics = await db.getAll('topics');
     for (const topic of allTopics) {
-      await db.delete('topics', topic.id);
+      await db.delete("", topic.id);
     }
 
killedBy: clearAllUserData should clear all topics
statusReason: No objectStore named  in this database
