[NoCoverage] BlockStatement
src/core/features.js:14:29
    * Get current deployment environment
    * @returns {'production' | 'staging' | 'development'}
    */
-  function getEnvironment() {
-    return import.meta.env.VITE_DEPLOY_TARGET || 'production';
-  }
+  function getEnvironment() {}
 
   export const FEATURE_FLAGS = {

[NoCoverage] ConditionalExpression
src/core/features.js:15:12
    * @returns {'production' | 'staging' | 'development'}
    */
   function getEnvironment() {
-    return import.meta.env.VITE_DEPLOY_TARGET || 'production';
+    return true;
   }
 

[NoCoverage] ConditionalExpression
src/core/features.js:15:12
    * @returns {'production' | 'staging' | 'development'}
    */
   function getEnvironment() {
-    return import.meta.env.VITE_DEPLOY_TARGET || 'production';
+    return false;
   }
 

[Killed] StringLiteral
src/core/features.js:20:14
 
   export const FEATURE_FLAGS = {
     SHOW_ADS: {
-      phase: 'ENABLED',  // Show AdSense ads during loading screens
+      phase: "",  // Show AdSense ads during loading screens
       description: 'Display Google AdSense ads during quiz and results loading'
     }
killedBy: Feature Flags isFeatureEnabled should return true when phase is ENABLED
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/features.js:31:70
    * @param {string} context - Where the feature is being used ('settings' | 'welcome' | 'home')
    * @returns {boolean}
    */
-  export function isFeatureEnabled(featureName, context = 'default') {
-    // Check for test override in localStorage (for E2E testing)
-    const override = localStorage.getItem(`__test_feature_${featureName}`);
-    if (override === 'ENABLED') return true;
-    if (override === 'DISABLED') return false;
-
-    const feature = FEATURE_FLAGS[featureName];
-
-    if (!feature) {
-      console.warn(`[Features] Unknown feature: ${featureName}`);
-      return false;
-    }
-
-    switch (feature.phase) {
-      case 'DISABLED':
-        return false;
-      case 'SETTINGS_ONLY':
-        return context === 'settings';
-      case 'ENABLED':
-        return true;
-      default:
-        return false;
-    }
-  }
+  export function isFeatureEnabled(featureName, context = 'default') {}
 
   /**
killedBy: Feature Flags isFeatureEnabled should return false for unknown feature
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/core/features.js:34:40
   export function isFeatureEnabled(featureName, context = 'default') {
     // Check for test override in localStorage (for E2E testing)
     const override = localStorage.getItem(`__test_feature_${featureName}`);
-    if (override === 'ENABLED') return true;
+    if (override === 'ENABLED') return false;
     if (override === 'DISABLED') return false;
 
killedBy: Feature Flags isFeatureEnabled localStorage overrides should return true when localStorage override is ENABLED
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/features.js:34:9
   export function isFeatureEnabled(featureName, context = 'default') {
     // Check for test override in localStorage (for E2E testing)
     const override = localStorage.getItem(`__test_feature_${featureName}`);
-    if (override === 'ENABLED') return true;
+    if (override !== 'ENABLED') return true;
     if (override === 'DISABLED') return false;
 
killedBy: Feature Flags isFeatureEnabled should return false for unknown feature
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/features.js:35:9
     // Check for test override in localStorage (for E2E testing)
     const override = localStorage.getItem(`__test_feature_${featureName}`);
     if (override === 'ENABLED') return true;
-    if (override === 'DISABLED') return false;
+    if (false) return false;
 
     const feature = FEATURE_FLAGS[featureName];
killedBy: Feature Flags isFeatureEnabled localStorage overrides should return false when localStorage override is DISABLED
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/features.js:35:41
     // Check for test override in localStorage (for E2E testing)
     const override = localStorage.getItem(`__test_feature_${featureName}`);
     if (override === 'ENABLED') return true;
-    if (override === 'DISABLED') return false;
+    if (override === 'DISABLED') return true;
 
     const feature = FEATURE_FLAGS[featureName];
killedBy: Feature Flags isFeatureEnabled localStorage overrides should return false when localStorage override is DISABLED
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/features.js:39:9
 
     const feature = FEATURE_FLAGS[featureName];
 
-    if (!feature) {
+    if (feature) {
       console.warn(`[Features] Unknown feature: ${featureName}`);
       return false;
killedBy: Feature Flags isFeatureEnabled should return false for unknown feature
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] ConditionalExpression
src/core/features.js:39:9
 
     const feature = FEATURE_FLAGS[featureName];
 
-    if (!feature) {
+    if (true) {
       console.warn(`[Features] Unknown feature: ${featureName}`);
       return false;
killedBy: Feature Flags isFeatureEnabled should return true when phase is ENABLED
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/core/features.js:40:20
     const feature = FEATURE_FLAGS[featureName];
 
     if (!feature) {
-      console.warn(`[Features] Unknown feature: ${featureName}`);
+      console.warn(``);
       return false;
     }

[Killed] BooleanLiteral
src/core/features.js:41:14
 
     if (!feature) {
       console.warn(`[Features] Unknown feature: ${featureName}`);
-      return false;
+      return true;
     }
 
killedBy: Feature Flags isFeatureEnabled should return false for unknown feature
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/features.js:45:7
     }
 
     switch (feature.phase) {
-      case 'DISABLED':
-        return false;
+      case 'DISABLED':
       case 'SETTINGS_ONLY':
         return context === 'settings';
killedBy: Feature Flags phase behaviors should return false when phase is DISABLED
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/features.js:46:16
 
     switch (feature.phase) {
       case 'DISABLED':
-        return false;
+        return true;
       case 'SETTINGS_ONLY':
         return context === 'settings';
killedBy: Feature Flags phase behaviors should return false when phase is DISABLED
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/features.js:47:7
     switch (feature.phase) {
       case 'DISABLED':
         return false;
-      case 'SETTINGS_ONLY':
-        return context === 'settings';
+      case 'SETTINGS_ONLY':
       case 'ENABLED':
         return true;
killedBy: Feature Flags phase behaviors should return true only for settings context when phase is SETTINGS_ONLY
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/core/features.js:47:12
     switch (feature.phase) {
       case 'DISABLED':
         return false;
-      case 'SETTINGS_ONLY':
+      case "":
         return context === 'settings';
       case 'ENABLED':
killedBy: Feature Flags phase behaviors should return true only for settings context when phase is SETTINGS_ONLY
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/features.js:48:16
       case 'DISABLED':
         return false;
       case 'SETTINGS_ONLY':
-        return context === 'settings';
+        return context !== 'settings';
       case 'ENABLED':
         return true;
killedBy: Feature Flags phase behaviors should return true only for settings context when phase is SETTINGS_ONLY
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/features.js:48:16
       case 'DISABLED':
         return false;
       case 'SETTINGS_ONLY':
-        return context === 'settings';
+        return true;
       case 'ENABLED':
         return true;
killedBy: Feature Flags phase behaviors should return true only for settings context when phase is SETTINGS_ONLY
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/features.js:49:7
         return false;
       case 'SETTINGS_ONLY':
         return context === 'settings';
-      case 'ENABLED':
-        return true;
+      case 'ENABLED':
       default:
         return false;
killedBy: Feature Flags isFeatureEnabled should return true when phase is ENABLED
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/features.js:50:16
       case 'SETTINGS_ONLY':
         return context === 'settings';
       case 'ENABLED':
-        return true;
+        return false;
       default:
         return false;
killedBy: Feature Flags isFeatureEnabled should return true when phase is ENABLED
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/features.js:51:7
         return context === 'settings';
       case 'ENABLED':
         return true;
-      default:
-        return false;
+      default:
     }
   }
killedBy: Feature Flags phase behaviors should return false for unknown phase (default case)
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/core/features.js:52:16
       case 'ENABLED':
         return true;
       default:
-        return false;
+        return true;
     }
   }
killedBy: Feature Flags phase behaviors should return false for unknown phase (default case)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/core/features.js:59:48
   /**
    * Get current phase for a feature (useful for debugging)
    */
-  export function getFeaturePhase(featureName) {
-    return FEATURE_FLAGS[featureName]?.phase || 'UNKNOWN';
-  }
+  export function getFeaturePhase(featureName) {}
killedBy: Feature Flags getFeaturePhase should return current phase for known feature
statusReason: expected [ 'DISABLED', 'SETTINGS_ONLY', …(1) ] to include undefined

[Killed] OptionalChaining
src/core/features.js:60:12
    * Get current phase for a feature (useful for debugging)
    */
   export function getFeaturePhase(featureName) {
-    return FEATURE_FLAGS[featureName]?.phase || 'UNKNOWN';
+    return FEATURE_FLAGS[featureName].phase || 'UNKNOWN';
   }
killedBy: Feature Flags getFeaturePhase should return UNKNOWN for unknown feature
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] LogicalOperator
src/core/features.js:60:12
    * Get current phase for a feature (useful for debugging)
    */
   export function getFeaturePhase(featureName) {
-    return FEATURE_FLAGS[featureName]?.phase || 'UNKNOWN';
+    return FEATURE_FLAGS[featureName]?.phase && 'UNKNOWN';
   }
killedBy: Feature Flags getFeaturePhase should return current phase for known feature
statusReason: expected [ 'DISABLED', 'SETTINGS_ONLY', …(1) ] to include 'UNKNOWN'
