[Killed] ObjectLiteral
src/utils/adManager.js:26:18
  * For now, using placeholder values
  * @type {Object.<string, string>}
  */
-const AD_SLOTS = {
-  quizLoading: '',      // Slot ID for quiz generation loading screen
-  resultsLoading: '',   // Slot ID for results calculation loading screen
-};
+const AD_SLOTS = {};
 
 /**
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Ad already loaded in test-ad-container",

[Killed] StringLiteral
src/utils/adManager.js:27:16
  * @type {Object.<string, string>}
  */
 const AD_SLOTS = {
-  quizLoading: '',      // Slot ID for quiz generation loading screen
+  quizLoading: "Stryker was here!",      // Slot ID for quiz generation loading screen
   resultsLoading: '',   // Slot ID for results calculation loading screen
 };
killedBy: AdManager loadAd should return false and show placeholder when no slot ID is configured for quizLoading
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
src/utils/adManager.js:41:27
  * Track AdSense script loading state
  * @type {boolean}
  */
-let adsenseScriptLoaded = false;
+let adsenseScriptLoaded = true;
 
 /**

[Killed] BooleanLiteral
src/utils/adManager.js:50:35
  */
 async function loadAdSenseScript() {
   // Already loaded
-  if (adsenseScriptLoaded) return true;
+  if (adsenseScriptLoaded) return false;
 
   // Already available (e.g., set by tests or loaded elsewhere)
killedBy: AdManager loadAd should return false and show placeholder when no slot ID is configured for resultsLoading
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] No slot ID for resultsLoading - AdSense pending approval",

[Survived] ConditionalExpression
src/utils/adManager.js:50:7
  */
 async function loadAdSenseScript() {
   // Already loaded
-  if (adsenseScriptLoaded) return true;
+  if (false) return true;
 
   // Already available (e.g., set by tests or loaded elsewhere)

[Killed] ConditionalExpression
src/utils/adManager.js:53:7
   if (adsenseScriptLoaded) return true;
 
   // Already available (e.g., set by tests or loaded elsewhere)
-  if (typeof window.adsbygoogle !== 'undefined') {
+  if (false) {
     adsenseScriptLoaded = true;
     return true;
killedBy: AdManager loadAd should return false when container is not found
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/utils/adManager.js:53:7
   if (adsenseScriptLoaded) return true;
 
   // Already available (e.g., set by tests or loaded elsewhere)
-  if (typeof window.adsbygoogle !== 'undefined') {
+  if (typeof window.adsbygoogle === 'undefined') {
     adsenseScriptLoaded = true;
     return true;
killedBy: AdManager loadAd should return false when container is not found
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BooleanLiteral
src/utils/adManager.js:54:27
 
   // Already available (e.g., set by tests or loaded elsewhere)
   if (typeof window.adsbygoogle !== 'undefined') {
-    adsenseScriptLoaded = true;
+    adsenseScriptLoaded = false;
     return true;
   }

[Killed] BooleanLiteral
src/utils/adManager.js:55:12
   // Already available (e.g., set by tests or loaded elsewhere)
   if (typeof window.adsbygoogle !== 'undefined') {
     adsenseScriptLoaded = true;
-    return true;
+    return false;
   }
     
killedBy: AdManager loadAd should return false when container is not found
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[NoCoverage] ConditionalExpression
src/utils/adManager.js:59:7
   }
     
   // Loading in progress - return existing promise
-  if (adsenseLoadPromise) return adsenseLoadPromise;
+  if (false) return adsenseLoadPromise;
 
   // Start loading

[NoCoverage] ConditionalExpression
src/utils/adManager.js:59:7
   }
     
   // Loading in progress - return existing promise
-  if (adsenseLoadPromise) return adsenseLoadPromise;
+  if (true) return adsenseLoadPromise;
 
   // Start loading

[NoCoverage] BlockStatement
src/utils/adManager.js:62:49
   if (adsenseLoadPromise) return adsenseLoadPromise;
 
   // Start loading
-  adsenseLoadPromise = new Promise((resolve) => {
-    const script = document.createElement('script');
-    script.src = `https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=${PUBLISHER_ID}`;      
-    script.async = true;
-    script.crossOrigin = 'anonymous';
-
-    script.onload = () => {
-      adsenseScriptLoaded = true;
-      logger.info('[AdManager] AdSense script loaded');
-      resolve(true);
-    };
-
-    script.onerror = () => {
-      adsenseLoadPromise = null; // Allow retry
-      logger.error('[AdManager] Failed to load AdSense script');
-      resolve(false);
-    };
-
-    document.head.appendChild(script);
-  });
+  adsenseLoadPromise = new Promise((resolve) => {});
 
   return adsenseLoadPromise;

[NoCoverage] StringLiteral
src/utils/adManager.js:63:43
 
   // Start loading
   adsenseLoadPromise = new Promise((resolve) => {
-    const script = document.createElement('script');
+    const script = document.createElement("");
     script.src = `https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=${PUBLISHER_ID}`;      
     script.async = true;

[NoCoverage] BooleanLiteral
src/utils/adManager.js:65:20
   adsenseLoadPromise = new Promise((resolve) => {
     const script = document.createElement('script');
     script.src = `https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=${PUBLISHER_ID}`;      
-    script.async = true;
+    script.async = false;
     script.crossOrigin = 'anonymous';
 

[NoCoverage] BlockStatement
src/utils/adManager.js:68:27
     script.async = true;
     script.crossOrigin = 'anonymous';
 
-    script.onload = () => {
-      adsenseScriptLoaded = true;
-      logger.info('[AdManager] AdSense script loaded');
-      resolve(true);
-    };
+    script.onload = () => {};
 
     script.onerror = () => {

[NoCoverage] BooleanLiteral
src/utils/adManager.js:69:29
     script.crossOrigin = 'anonymous';
 
     script.onload = () => {
-      adsenseScriptLoaded = true;
+      adsenseScriptLoaded = false;
       logger.info('[AdManager] AdSense script loaded');
       resolve(true);

[NoCoverage] StringLiteral
src/utils/adManager.js:70:19
 
     script.onload = () => {
       adsenseScriptLoaded = true;
-      logger.info('[AdManager] AdSense script loaded');
+      logger.info("");
       resolve(true);
     };

[NoCoverage] BooleanLiteral
src/utils/adManager.js:71:15
     script.onload = () => {
       adsenseScriptLoaded = true;
       logger.info('[AdManager] AdSense script loaded');
-      resolve(true);
+      resolve(false);
     };
 

[NoCoverage] BlockStatement
src/utils/adManager.js:74:28
       resolve(true);
     };
 
-    script.onerror = () => {
-      adsenseLoadPromise = null; // Allow retry
-      logger.error('[AdManager] Failed to load AdSense script');
-      resolve(false);
-    };
+    script.onerror = () => {};
 
     document.head.appendChild(script);

[NoCoverage] BooleanLiteral
src/utils/adManager.js:77:15
     script.onerror = () => {
       adsenseLoadPromise = null; // Allow retry
       logger.error('[AdManager] Failed to load AdSense script');
-      resolve(false);
+      resolve(true);
     };
 

[Killed] BlockStatement
src/utils/adManager.js:96:30
  * Check if we can load ads right now
  * @returns {boolean} True if ads can be loaded
  */
-export function canLoadAds() {
-  // Check feature flag
-  if (!isFeatureEnabled('SHOW_ADS')) {
-    logger.debug('[AdManager] Ads disabled by feature flag');
-    return false;
-  }
-
-  // Check if online
-  if (!isOnline()) {
-    logger.debug('[AdManager] Cannot load ads: offline');
-    return false;
-  }
-
-  // Check if AdSense script is loaded
-  if (typeof window.adsbygoogle === 'undefined') {
-    logger.debug('[AdManager] Cannot load ads: adsbygoogle not loaded');
-    return false;
-  }
-
-  return true;
-}
+export function canLoadAds() {}
 
 /**
killedBy: AdManager canLoadAds should return false when feature flag is disabled
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/utils/adManager.js:98:38
  */
 export function canLoadAds() {
   // Check feature flag
-  if (!isFeatureEnabled('SHOW_ADS')) {
-    logger.debug('[AdManager] Ads disabled by feature flag');
-    return false;
-  }
+  if (!isFeatureEnabled('SHOW_ADS')) {}
 
   // Check if online
killedBy: AdManager canLoadAds should return false when feature flag is disabled
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/adManager.js:98:7
  */
 export function canLoadAds() {
   // Check feature flag
-  if (!isFeatureEnabled('SHOW_ADS')) {
+  if (true) {
     logger.debug('[AdManager] Ads disabled by feature flag');
     return false;
killedBy: AdManager canLoadAds should return false when feature flag is disabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'SHOW_ADS' ]

Number of calls: 0

[Killed] BooleanLiteral
src/utils/adManager.js:100:12
   // Check feature flag
   if (!isFeatureEnabled('SHOW_ADS')) {
     logger.debug('[AdManager] Ads disabled by feature flag');
-    return false;
+    return true;
   }
 
killedBy: AdManager canLoadAds should return false when feature flag is disabled
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/adManager.js:104:7
   }
 
   // Check if online
-  if (!isOnline()) {
+  if (false) {
     logger.debug('[AdManager] Cannot load ads: offline');
     return false;
killedBy: AdManager canLoadAds should return false when offline
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/adManager.js:104:7
   }
 
   // Check if online
-  if (!isOnline()) {
+  if (isOnline()) {
     logger.debug('[AdManager] Cannot load ads: offline');
     return false;
killedBy: AdManager canLoadAds should return false when offline
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/utils/adManager.js:105:18
 
   // Check if online
   if (!isOnline()) {
-    logger.debug('[AdManager] Cannot load ads: offline');
+    logger.debug("");
     return false;
   }
killedBy: AdManager canLoadAds should return false when offline
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Cannot load ads: offline",

[Killed] BooleanLiteral
src/utils/adManager.js:106:12
   // Check if online
   if (!isOnline()) {
     logger.debug('[AdManager] Cannot load ads: offline');
-    return false;
+    return true;
   }
 
killedBy: AdManager canLoadAds should return false when offline
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/adManager.js:110:7
   }
 
   // Check if AdSense script is loaded
-  if (typeof window.adsbygoogle === 'undefined') {
+  if (false) {
     logger.debug('[AdManager] Cannot load ads: adsbygoogle not loaded');
     return false;
killedBy: AdManager canLoadAds should return false when adsbygoogle is not loaded
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/utils/adManager.js:110:7
   }
 
   // Check if AdSense script is loaded
-  if (typeof window.adsbygoogle === 'undefined') {
+  if (typeof window.adsbygoogle !== 'undefined') {
     logger.debug('[AdManager] Cannot load ads: adsbygoogle not loaded');
     return false;
killedBy: AdManager canLoadAds should return false when adsbygoogle is not loaded
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/adManager.js:112:12
   // Check if AdSense script is loaded
   if (typeof window.adsbygoogle === 'undefined') {
     logger.debug('[AdManager] Cannot load ads: adsbygoogle not loaded');
-    return false;
+    return true;
   }
 
killedBy: AdManager canLoadAds should return false when adsbygoogle is not loaded
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/adManager.js:126:7
  */
 export async function loadAd(containerId, slotKey) {
   // Prevent duplicate loads
-  if (loadedAds.has(containerId)) {
+  if (false) {
     logger.debug(`[AdManager] Ad already loaded in ${containerId}`);
     return false;
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/adManager.js:128:12
   // Prevent duplicate loads
   if (loadedAds.has(containerId)) {
     logger.debug(`[AdManager] Ad already loaded in ${containerId}`);
-    return false;
+    return true;
   }
 
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/adManager.js:133:7
 
   // Ensure AdSense script is loaded
   const scriptLoaded = await loadAdSenseScript();
-  if (!scriptLoaded) {
+  if (true) {
     logger.debug('[AdManager] AdSense script not available');
     hideContainer(containerId);
killedBy: AdManager loadAd should return false when container is not found
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BooleanLiteral
src/utils/adManager.js:133:7
 
   // Ensure AdSense script is loaded
   const scriptLoaded = await loadAdSenseScript();
-  if (!scriptLoaded) {
+  if (scriptLoaded) {
     logger.debug('[AdManager] AdSense script not available');
     hideContainer(containerId);
killedBy: AdManager loadAd should return false when container is not found
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[NoCoverage] BooleanLiteral
src/utils/adManager.js:136:12
   if (!scriptLoaded) {
     logger.debug('[AdManager] AdSense script not available');
     hideContainer(containerId);
-    return false;
+    return true;
   }
   

[Killed] ConditionalExpression
src/utils/adManager.js:140:7
   }
   
   // Check if we can load
-  if (!canLoadAds()) {
+  if (false) {
     hideContainer(containerId);
     return false;
killedBy: AdManager loadAd should hide container when ads cannot load
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/adManager.js:140:7
   }
   
   // Check if we can load
-  if (!canLoadAds()) {
+  if (true) {
     hideContainer(containerId);
     return false;
killedBy: AdManager loadAd should return false when container is not found
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/utils/adManager.js:146:19
   }
 
   const container = document.getElementById(containerId);
-  if (!container) {
-    logger.warn(`[AdManager] Container not found: ${containerId}`);
-    return false;
-  }
+  if (!container) {}
 
   const slotId = AD_SLOTS[slotKey];
killedBy: AdManager loadAd should return false when container is not found
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BooleanLiteral
src/utils/adManager.js:146:7
   }
 
   const container = document.getElementById(containerId);
-  if (!container) {
+  if (container) {
     logger.warn(`[AdManager] Container not found: ${containerId}`);
     return false;
killedBy: AdManager loadAd should return false when container is not found
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BooleanLiteral
src/utils/adManager.js:154:7
   const slotId = AD_SLOTS[slotKey];
 
   // If no slot ID yet (pre-approval), show placeholder
-  if (!slotId) {
+  if (slotId) {
     logger.debug(`[AdManager] No slot ID for ${slotKey} - AdSense pending approval`);
     showPlaceholder(containerId);
killedBy: AdManager loadAd should return false and show placeholder when no slot ID is configured for quizLoading
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/adManager.js:154:7
   const slotId = AD_SLOTS[slotKey];
 
   // If no slot ID yet (pre-approval), show placeholder
-  if (!slotId) {
+  if (true) {
     logger.debug(`[AdManager] No slot ID for ${slotKey} - AdSense pending approval`);
     showPlaceholder(containerId);
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Ad already loaded in test-ad-container",

[Killed] BooleanLiteral
src/utils/adManager.js:157:12
   if (!slotId) {
     logger.debug(`[AdManager] No slot ID for ${slotKey} - AdSense pending approval`);
     showPlaceholder(containerId);
-    return false;
+    return true;
   }
 
killedBy: AdManager loadAd should return false and show placeholder when no slot ID is configured for quizLoading
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/adManager.js:160:7
     return false;
   }
 
-  try {
-    // Create the ad element
-    const adElement = document.createElement('ins');
-    adElement.className = 'adsbygoogle';
-    adElement.style.display = 'block';
-    adElement.setAttribute('data-ad-client', PUBLISHER_ID);
-    adElement.setAttribute('data-ad-slot', slotId);
-    adElement.setAttribute('data-ad-format', 'auto');
-    adElement.setAttribute('data-full-width-responsive', 'true');
-
-    // Clear container and add ad
-    container.innerHTML = '';
-    container.appendChild(adElement);
-
-    // Push to AdSense
-    (window.adsbygoogle = window.adsbygoogle || []).push({});
-
-    // Mark as loaded
-    loadedAds.add(containerId);
-    logger.info(`[AdManager] Ad loaded in ${containerId}`);
-
-    return true;
-  } catch (error) {
+  try {} catch (error) {
     logger.error('[AdManager] Error loading ad:', error);
     hideContainer(containerId);
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected undefined to be false // Object.is equality

[Killed] StringLiteral
src/utils/adManager.js:167:28
     adElement.style.display = 'block';
     adElement.setAttribute('data-ad-client', PUBLISHER_ID);
     adElement.setAttribute('data-ad-slot', slotId);
-    adElement.setAttribute('data-ad-format', 'auto');
+    adElement.setAttribute("", 'auto');
     adElement.setAttribute('data-full-width-responsive', 'true');
 
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Ad already loaded in test-ad-container",

[Killed] ConditionalExpression
src/utils/adManager.js:175:27
     container.appendChild(adElement);
 
     // Push to AdSense
-    (window.adsbygoogle = window.adsbygoogle || []).push({});
+    (window.adsbygoogle = true).push({});
 
     // Mark as loaded
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Ad already loaded in test-ad-container",

[Killed] ConditionalExpression
src/utils/adManager.js:175:27
     container.appendChild(adElement);
 
     // Push to AdSense
-    (window.adsbygoogle = window.adsbygoogle || []).push({});
+    (window.adsbygoogle = false).push({});
 
     // Mark as loaded
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Ad already loaded in test-ad-container",

[Killed] BlockStatement
src/utils/adManager.js:182:19
     logger.info(`[AdManager] Ad loaded in ${containerId}`);
 
     return true;
-  } catch (error) {
-    logger.error('[AdManager] Error loading ad:', error);
-    hideContainer(containerId);
-    return false;
-  }
+  } catch (error) {}
 }
 
killedBy: AdManager error handling should handle errors when loading ad and return false
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/utils/adManager.js:193:44
  * Hide an ad container
  * @param {string} containerId - DOM element ID to hide
  */
-export function hideContainer(containerId) {
-  const container = document.getElementById(containerId);
-  if (container) {
-    container.innerHTML = '';
-    container.style.display = 'none';
-  }
-}
+export function hideContainer(containerId) {}
 
 /**
killedBy: AdManager loadAd should hide container when ads cannot load
statusReason: expected '' to be 'none' // Object.is equality

[Killed] BlockStatement
src/utils/adManager.js:195:18
  */
 export function hideContainer(containerId) {
   const container = document.getElementById(containerId);
-  if (container) {
-    container.innerHTML = '';
-    container.style.display = 'none';
-  }
+  if (container) {}
 }
 
killedBy: AdManager loadAd should hide container when ads cannot load
statusReason: expected '' to be 'none' // Object.is equality

[Killed] StringLiteral
src/utils/adManager.js:197:31
   const container = document.getElementById(containerId);
   if (container) {
     container.innerHTML = '';
-    container.style.display = 'none';
+    container.style.display = "";
   }
 }
killedBy: AdManager loadAd should hide container when ads cannot load
statusReason: expected '' to be 'none' // Object.is equality

[Killed] BlockStatement
src/utils/adManager.js:205:44
  * Show an ad container
  * @param {string} containerId - DOM element ID to show
  */
-export function showContainer(containerId) {
-  const container = document.getElementById(containerId);
-  if (container) {
-    container.style.display = 'block';
-  }
-}
+export function showContainer(containerId) {}
 
 /**
killedBy: AdManager showContainer should show container
statusReason: expected 'none' to be 'block' // Object.is equality

[Killed] ConditionalExpression
src/utils/adManager.js:207:7
  */
 export function showContainer(containerId) {
   const container = document.getElementById(containerId);
-  if (container) {
+  if (false) {
     container.style.display = 'block';
   }
killedBy: AdManager showContainer should show container
statusReason: expected 'none' to be 'block' // Object.is equality

[Killed] ConditionalExpression
src/utils/adManager.js:207:7
  */
 export function showContainer(containerId) {
   const container = document.getElementById(containerId);
-  if (container) {
+  if (true) {
     container.style.display = 'block';
   }
killedBy: AdManager showContainer should not crash when container does not exist
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BlockStatement
src/utils/adManager.js:216:46
  * Show a placeholder in the ad container (for pre-approval testing)
  * @param {string} containerId - DOM element ID
  */
-export function showPlaceholder(containerId) {
-  const container = document.getElementById(containerId);
-  if (container) {
-    container.innerHTML = `
-      <div style="
-        background: linear-gradient(135deg, #374151 0%, #1f2937 100%);
-        border: 2px dashed #4b5563;
-        border-radius: 8px;
-        padding: 20px;
-        text-align: center;
-        min-height: 100px;
-        display: flex;
-        flex-direction: column;
-        align-items: center;
-        justify-content: center;
-        gap: 8px;
-      ">
-        <span style="color: #9ca3af; font-size: 14px;">Ad Space</span>
-        <span style="color: #6b7280; font-size: 12px;">Awaiting AdSense approval</span>
-      </div>
-    `;
-    container.style.display = 'block';
-  }
-}
+export function showPlaceholder(containerId) {}
 
 /**
killedBy: AdManager loadAd should return false and show placeholder when no slot ID is configured for quizLoading
statusReason: expected '' to be 'block' // Object.is equality

[Killed] BlockStatement
src/utils/adManager.js:218:18
  */
 export function showPlaceholder(containerId) {
   const container = document.getElementById(containerId);
-  if (container) {
-    container.innerHTML = `
-      <div style="
-        background: linear-gradient(135deg, #374151 0%, #1f2937 100%);
-        border: 2px dashed #4b5563;
-        border-radius: 8px;
-        padding: 20px;
-        text-align: center;
-        min-height: 100px;
-        display: flex;
-        flex-direction: column;
-        align-items: center;
-        justify-content: center;
-        gap: 8px;
-      ">
-        <span style="color: #9ca3af; font-size: 14px;">Ad Space</span>
-        <span style="color: #6b7280; font-size: 12px;">Awaiting AdSense approval</span>
-      </div>
-    `;
-    container.style.display = 'block';
-  }
+  if (container) {}
 }
 
killedBy: AdManager loadAd should return false and show placeholder when no slot ID is configured for quizLoading
statusReason: expected '' to be 'block' // Object.is equality

[Killed] BlockStatement
src/utils/adManager.js:245:38
  * Reset ad state for SPA navigation
  * Call this when navigating between views
  */
-export function resetForNavigation() {
-  loadedAds.clear();
-  logger.debug('[AdManager] Reset for navigation');
-}
+export function resetForNavigation() {}
 
 /**
killedBy: AdManager loadAd should hide container when ads cannot load
statusReason: expected '' to be 'none' // Object.is equality

[Killed] BlockStatement
src/utils/adManager.js:253:25
 /**
  * Handle online event - show ad containers
  */
-function handleOnline() {
-  logger.debug('[AdManager] Online - ads can be shown');
-  // Note: We don't auto-reload ads on online event
-  // The view should handle showing ads when appropriate
-}
+function handleOnline() {}
 
 /**
killedBy: AdManager online/offline handlers should register handlers that log on online event
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Online - ads can be shown",

[Killed] BlockStatement
src/utils/adManager.js:289:34
  * Get the publisher ID (for testing/debugging)
  * @returns {string}
  */
-export function getPublisherId() {
-  return PUBLISHER_ID;
-}
+export function getPublisherId() {}
 
 /**
killedBy: AdManager getPublisherId should return the publisher ID
statusReason: expected undefined to be 'ca-pub-9849708569219157' // Object.is equality

[Killed] BlockStatement
src/utils/adManager.js:298:44
  * @param {string} slotKey - Key from AD_SLOTS
  * @param {string} slotId - The slot ID from AdSense
  */
-export function setAdSlot(slotKey, slotId) {
-  if (AD_SLOTS.hasOwnProperty(slotKey)) {
-    AD_SLOTS[slotKey] = slotId;
-    logger.info(`[AdManager] Set slot ${slotKey} = ${slotId}`);
-  } else {
-    logger.warn(`[AdManager] Unknown slot key: ${slotKey}`);
-  }
-}
+export function setAdSlot(slotKey, slotId) {}
 
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Ad already loaded in test-ad-container",

[Killed] ConditionalExpression
src/utils/adManager.js:299:7
  * @param {string} slotId - The slot ID from AdSense
  */
 export function setAdSlot(slotKey, slotId) {
-  if (AD_SLOTS.hasOwnProperty(slotKey)) {
+  if (false) {
     AD_SLOTS[slotKey] = slotId;
     logger.info(`[AdManager] Set slot ${slotKey} = ${slotId}`);
killedBy: AdManager loadAd should prevent duplicate ad loads in same container
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "[AdManager] Ad already loaded in test-ad-container",

[Killed] ConditionalExpression
src/utils/adManager.js:299:7
  * @param {string} slotId - The slot ID from AdSense
  */
 export function setAdSlot(slotKey, slotId) {
-  if (AD_SLOTS.hasOwnProperty(slotKey)) {
+  if (true) {
     AD_SLOTS[slotKey] = slotId;
     logger.info(`[AdManager] Set slot ${slotKey} = ${slotId}`);
killedBy: AdManager setAdSlot should warn for unknown slot key
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
