[Killed] BlockStatement
src/utils/storage.js:13:42
  * @param {number} bytes - The number of bytes to format
  * @returns {string} Formatted string (e.g., "1.5 KB", "2.3 MB")
  */
-export function formatStorageSize(bytes) {
-  if (bytes === 0) return '0 B';
-  if (bytes < 0 || !Number.isFinite(bytes)) return '0 B';
-
-  const units = ['B', 'KB', 'MB', 'GB'];
-  const k = 1024;
-  const i = Math.min(Math.floor(Math.log(bytes) / Math.log(k)), units.length - 1);
-  const size = bytes / Math.pow(k, i);
-
-  // Use 1 decimal place for KB and above, 0 for bytes
-  const decimals = i === 0 ? 0 : 1;
-  return `${size.toFixed(decimals)} ${units[i]}`;
-}
+export function formatStorageSize(bytes) {}
 
 /**
killedBy: Storage Utilities formatStorageSize should format 0 bytes
statusReason: expected undefined to be '0 B' // Object.is equality

[Killed] ConditionalExpression
src/utils/storage.js:14:7
  * @returns {string} Formatted string (e.g., "1.5 KB", "2.3 MB")
  */
 export function formatStorageSize(bytes) {
-  if (bytes === 0) return '0 B';
+  if (false) return '0 B';
   if (bytes < 0 || !Number.isFinite(bytes)) return '0 B';
 
killedBy: Storage Utilities formatStorageSize should format 0 bytes
statusReason: expected 'NaN undefined' to be '0 B' // Object.is equality

[Killed] ConditionalExpression
src/utils/storage.js:14:7
  * @returns {string} Formatted string (e.g., "1.5 KB", "2.3 MB")
  */
 export function formatStorageSize(bytes) {
-  if (bytes === 0) return '0 B';
+  if (true) return '0 B';
   if (bytes < 0 || !Number.isFinite(bytes)) return '0 B';
 
killedBy: Storage Utilities formatStorageSize should format bytes (< 1024)
statusReason: expected '0 B' to be '500 B' // Object.is equality

[Killed] ConditionalExpression
src/utils/storage.js:15:7
  */
 export function formatStorageSize(bytes) {
   if (bytes === 0) return '0 B';
-  if (bytes < 0 || !Number.isFinite(bytes)) return '0 B';
+  if (false) return '0 B';
 
   const units = ['B', 'KB', 'MB', 'GB'];
killedBy: Storage Utilities formatStorageSize should handle negative numbers
statusReason: expected 'NaN undefined' to be '0 B' // Object.is equality

[Killed] ConditionalExpression
src/utils/storage.js:15:7
  */
 export function formatStorageSize(bytes) {
   if (bytes === 0) return '0 B';
-  if (bytes < 0 || !Number.isFinite(bytes)) return '0 B';
+  if (false || !Number.isFinite(bytes)) return '0 B';
 
   const units = ['B', 'KB', 'MB', 'GB'];
killedBy: Storage Utilities formatStorageSize should handle negative numbers
statusReason: expected 'NaN undefined' to be '0 B' // Object.is equality

[Killed] StringLiteral
src/utils/storage.js:17:29
   if (bytes === 0) return '0 B';
   if (bytes < 0 || !Number.isFinite(bytes)) return '0 B';
 
-  const units = ['B', 'KB', 'MB', 'GB'];
+  const units = ['B', 'KB', "", 'GB'];
   const k = 1024;
   const i = Math.min(Math.floor(Math.log(bytes) / Math.log(k)), units.length - 1);
killedBy: Storage Utilities formatStorageSize should format megabytes
statusReason: expected '1.0 ' to be '1.0 MB' // Object.is equality

[Killed] ArrayDeclaration
src/utils/storage.js:17:17
   if (bytes === 0) return '0 B';
   if (bytes < 0 || !Number.isFinite(bytes)) return '0 B';
 
-  const units = ['B', 'KB', 'MB', 'GB'];
+  const units = [];
   const k = 1024;
   const i = Math.min(Math.floor(Math.log(bytes) / Math.log(k)), units.length - 1);
killedBy: Storage Utilities formatStorageSize should format bytes (< 1024)
statusReason: expected '512000.0 undefined' to be '500 B' // Object.is equality

[Killed] ArithmeticOperator
src/utils/storage.js:19:33
 
   const units = ['B', 'KB', 'MB', 'GB'];
   const k = 1024;
-  const i = Math.min(Math.floor(Math.log(bytes) / Math.log(k)), units.length - 1);
+  const i = Math.min(Math.floor(Math.log(bytes) * Math.log(k)), units.length - 1);
   const size = bytes / Math.pow(k, i);
 
killedBy: Storage Utilities formatStorageSize should format bytes (< 1024)
statusReason: expected '0.0 GB' to be '500 B' // Object.is equality

[Killed] ArithmeticOperator
src/utils/storage.js:19:65
 
   const units = ['B', 'KB', 'MB', 'GB'];
   const k = 1024;
-  const i = Math.min(Math.floor(Math.log(bytes) / Math.log(k)), units.length - 1);
+  const i = Math.min(Math.floor(Math.log(bytes) / Math.log(k)), units.length + 1);
   const size = bytes / Math.pow(k, i);
 
killedBy: Storage Utilities formatStorageSize should handle very large values without exceeding GB
statusReason: expected '10.0 undefined' to contain 'GB'

[Killed] ArithmeticOperator
src/utils/storage.js:20:16
   const units = ['B', 'KB', 'MB', 'GB'];
   const k = 1024;
   const i = Math.min(Math.floor(Math.log(bytes) / Math.log(k)), units.length - 1);
-  const size = bytes / Math.pow(k, i);
+  const size = bytes * Math.pow(k, i);
 
   // Use 1 decimal place for KB and above, 0 for bytes
killedBy: Storage Utilities formatStorageSize should format kilobytes
statusReason: expected '1048576.0 KB' to be '1.0 KB' // Object.is equality

[Killed] ConditionalExpression
src/utils/storage.js:23:20
   const size = bytes / Math.pow(k, i);
 
   // Use 1 decimal place for KB and above, 0 for bytes
-  const decimals = i === 0 ? 0 : 1;
+  const decimals = false ? 0 : 1;
   return `${size.toFixed(decimals)} ${units[i]}`;
 }
killedBy: Storage Utilities formatStorageSize should format bytes (< 1024)
statusReason: expected '500.0 B' to be '500 B' // Object.is equality

[Killed] EqualityOperator
src/utils/storage.js:23:20
   const size = bytes / Math.pow(k, i);
 
   // Use 1 decimal place for KB and above, 0 for bytes
-  const decimals = i === 0 ? 0 : 1;
+  const decimals = i !== 0 ? 0 : 1;
   return `${size.toFixed(decimals)} ${units[i]}`;
 }
killedBy: Storage Utilities formatStorageSize should format bytes (< 1024)
statusReason: expected '500.0 B' to be '500 B' // Object.is equality

[Killed] BlockStatement
src/utils/storage.js:32:29
  * @param {*} value - The value to measure
  * @returns {number} Size in bytes
  */
-function getJsonSize(value) {
-  if (value === null || value === undefined) return 0;
-  try {
-    return new Blob([JSON.stringify(value)]).size;
-  } catch {
-    return 0;
-  }
-}
+function getJsonSize(value) {}
 
 /**
killedBy: Storage Utilities getStorageBreakdown should return minimal size for empty storage
statusReason: expected '0 B' to be '4 B' // Object.is equality

[Killed] ConditionalExpression
src/utils/storage.js:33:7
  * @returns {number} Size in bytes
  */
 function getJsonSize(value) {
-  if (value === null || value === undefined) return 0;
+  if (true) return 0;
   try {
     return new Blob([JSON.stringify(value)]).size;
killedBy: Storage Utilities getStorageBreakdown should return minimal size for empty storage
statusReason: expected '0 B' to be '4 B' // Object.is equality

[Killed] LogicalOperator
src/utils/storage.js:33:7
  * @returns {number} Size in bytes
  */
 function getJsonSize(value) {
-  if (value === null || value === undefined) return 0;
+  if (value === null && value === undefined) return 0;
   try {
     return new Blob([JSON.stringify(value)]).size;
killedBy: Storage Utilities getStorageBreakdown should return minimal size for empty storage
statusReason: expected '8 B' to be '0 B' // Object.is equality

[Killed] BlockStatement
src/utils/storage.js:34:7
  */
 function getJsonSize(value) {
   if (value === null || value === undefined) return 0;
-  try {
-    return new Blob([JSON.stringify(value)]).size;
-  } catch {
+  try {} catch {
     return 0;
   }
killedBy: Storage Utilities getStorageBreakdown should return minimal size for empty storage
statusReason: expected '0 B' to be '4 B' // Object.is equality

[NoCoverage] BlockStatement
src/utils/storage.js:36:11
   if (value === null || value === undefined) return 0;
   try {
     return new Blob([JSON.stringify(value)]).size;
-  } catch {
-    return 0;
-  }
+  } catch {}
 }
 

[Survived] StringLiteral
src/utils/storage.js:50:35
   let settingsBytes = 0;
 
   // IndexedDB settings
-  const apiKey = await getSetting('openrouter_api_key');
+  const apiKey = await getSetting("");
   const welcomeVersion = await getSetting('welcome_version');
   settingsBytes += getJsonSize(apiKey);

[Killed] AssignmentOperator
src/utils/storage.js:52:3
   // IndexedDB settings
   const apiKey = await getSetting('openrouter_api_key');
   const welcomeVersion = await getSetting('welcome_version');
-  settingsBytes += getJsonSize(apiKey);
+  settingsBytes -= getJsonSize(apiKey);
   settingsBytes += getJsonSize(welcomeVersion);
 
killedBy: Storage Utilities getStorageBreakdown should calculate settings size from IndexedDB
statusReason: expected -15 to be greater than 0

[Survived] AssignmentOperator
src/utils/storage.js:53:3
   const apiKey = await getSetting('openrouter_api_key');
   const welcomeVersion = await getSetting('welcome_version');
   settingsBytes += getJsonSize(apiKey);
-  settingsBytes += getJsonSize(welcomeVersion);
+  settingsBytes -= getJsonSize(welcomeVersion);
 
   // localStorage settings

[Killed] ArrayDeclaration
src/utils/storage.js:56:28
   settingsBytes += getJsonSize(welcomeVersion);
 
   // localStorage settings
-  const localStorageKeys = [
-    'quizmaster_settings',
-    'openrouter_models_cache',
-    'i18nextLng',
-    'saberloop_telemetry_queue'
-  ];
+  const localStorageKeys = [];
 
   for (const key of localStorageKeys) {
killedBy: Storage Utilities getStorageBreakdown should calculate settings size from localStorage
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/utils/storage.js:63:39
     'saberloop_telemetry_queue'
   ];
 
-  for (const key of localStorageKeys) {
-    const value = localStorage.getItem(key);
-    if (value) {
-      settingsBytes += new Blob([value]).size;
-    }
-  }
+  for (const key of localStorageKeys) {}
 
   // Calculate quizzes size (sessions + topics)
killedBy: Storage Utilities getStorageBreakdown should calculate settings size from localStorage
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/utils/storage.js:65:9
 
   for (const key of localStorageKeys) {
     const value = localStorage.getItem(key);
-    if (value) {
+    if (true) {
       settingsBytes += new Blob([value]).size;
     }
killedBy: Storage Utilities getStorageBreakdown should return minimal size for empty storage
statusReason: expected '16 B' to be '0 B' // Object.is equality

[Killed] ConditionalExpression
src/utils/storage.js:65:9
 
   for (const key of localStorageKeys) {
     const value = localStorage.getItem(key);
-    if (value) {
+    if (false) {
       settingsBytes += new Blob([value]).size;
     }
killedBy: Storage Utilities getStorageBreakdown should calculate settings size from localStorage
statusReason: expected 0 to be greater than 0

[Killed] AssignmentOperator
src/utils/storage.js:66:7
   for (const key of localStorageKeys) {
     const value = localStorage.getItem(key);
     if (value) {
-      settingsBytes += new Blob([value]).size;
+      settingsBytes -= new Blob([value]).size;
     }
   }
killedBy: Storage Utilities getStorageBreakdown should calculate settings size from localStorage
statusReason: expected -20 to be greater than 0

[Killed] AssignmentOperator
src/utils/storage.js:76:3
   const sessions = await getAllSessions();
   const topics = await getAllTopics();
 
-  quizzesBytes += getJsonSize(sessions);
+  quizzesBytes -= getJsonSize(sessions);
   quizzesBytes += getJsonSize(topics);
 
killedBy: Storage Utilities getStorageBreakdown should return minimal size for empty storage
statusReason: expected '0 B' to be '4 B' // Object.is equality

[Killed] AssignmentOperator
src/utils/storage.js:77:3
   const topics = await getAllTopics();
 
   quizzesBytes += getJsonSize(sessions);
-  quizzesBytes += getJsonSize(topics);
+  quizzesBytes -= getJsonSize(topics);
 
   const totalBytes = settingsBytes + quizzesBytes;
killedBy: Storage Utilities getStorageBreakdown should return minimal size for empty storage
statusReason: expected '0 B' to be '4 B' // Object.is equality

[Killed] ArithmeticOperator
src/utils/storage.js:79:22
   quizzesBytes += getJsonSize(sessions);
   quizzesBytes += getJsonSize(topics);
 
-  const totalBytes = settingsBytes + quizzesBytes;
+  const totalBytes = settingsBytes - quizzesBytes;
 
   return {
killedBy: Storage Utilities getStorageBreakdown should return minimal size for empty storage
statusReason: expected '0 B' to be '4 B' // Object.is equality
