[Killed] StringLiteral
src/core/settings.js:10:25
   const SETTINGS_KEY = 'quizmaster_settings';
 
   // Default free model on OpenRouter
-  const DEFAULT_MODEL = 'tngtech/deepseek-r1t2-chimera:free';
+  const DEFAULT_MODEL = "";
 
   // Default values for all settings
killedBy: OpenRouter Client callOpenRouter should use default model when not specified
statusReason: expected '' to be 'tngtech/deepseek-r1t2-chimera:free' // Object.is equality

[Killed] StringLiteral
src/core/settings.js:14:24
 
   // Default values for all settings
   const DEFAULT_SETTINGS = {
-    defaultGradeLevel: 'middle school',
+    defaultGradeLevel: "",
     questionsPerQuiz: '5',
     difficulty: 'mixed',
killedBy: Settings Utilities getSettings should return default settings when nothing is stored
statusReason: expected '' to be 'middle school' // Object.is equality

[Killed] BlockStatement
src/core/settings.js:28:33
   /**
    * Get all settings (merged with defaults)
    */
-  export function getSettings() {
-    try {
-      const stored = localStorage.getItem(SETTINGS_KEY);
-      if (stored) {
-        return { ...DEFAULT_SETTINGS, ...JSON.parse(stored) };
-      }
-    } catch (error) {
-      logger.error('Error reading settings', { error: error.message });
-    }
-    return { ...DEFAULT_SETTINGS };
-  }
+  export function getSettings() {}
 
   /**
killedBy: OpenRouter Client callOpenRouter should call fetch with correct URL
statusReason: Cannot read properties of undefined (reading 'selectedModel')

[Killed] BlockStatement
src/core/settings.js:29:9
    * Get all settings (merged with defaults)
    */
   export function getSettings() {
-    try {
-      const stored = localStorage.getItem(SETTINGS_KEY);
-      if (stored) {
-        return { ...DEFAULT_SETTINGS, ...JSON.parse(stored) };
-      }
-    } catch (error) {
+    try {} catch (error) {
       logger.error('Error reading settings', { error: error.message });
     }
killedBy: Model Service getSelectedModel should return saved model when one is selected
statusReason: expected 'tngtech/deepseek-r1t2-chimera:free' to be 'google/gemma-2-9b-it:free' // Object.is equality

[Killed] ConditionalExpression
src/core/settings.js:31:11
   export function getSettings() {
     try {
       const stored = localStorage.getItem(SETTINGS_KEY);
-      if (stored) {
+      if (false) {
         return { ...DEFAULT_SETTINGS, ...JSON.parse(stored) };
       }
killedBy: Model Service getSelectedModel should return saved model when one is selected
statusReason: expected 'tngtech/deepseek-r1t2-chimera:free' to be 'google/gemma-2-9b-it:free' // Object.is equality

[Survived] ConditionalExpression
src/core/settings.js:31:11
   export function getSettings() {
     try {
       const stored = localStorage.getItem(SETTINGS_KEY);
-      if (stored) {
+      if (true) {
         return { ...DEFAULT_SETTINGS, ...JSON.parse(stored) };
       }

[Killed] ObjectLiteral
src/core/settings.js:37:12
     } catch (error) {
       logger.error('Error reading settings', { error: error.message });
     }
-    return { ...DEFAULT_SETTINGS };
+    return {};
   }
 
killedBy: Settings Utilities getSettings should return default settings when nothing is stored
statusReason: expected undefined to be 'middle school' // Object.is equality

[Killed] BlockStatement
src/core/settings.js:43:35
   /**
    * Get a single setting value
    */
-  export function getSetting(key) {
-    const settings = getSettings();
-    return settings[key];
-  }
+  export function getSetting(key) {}
 
   /**
killedBy: Model Service getSelectedModel should return saved model when one is selected
statusReason: expected 'tngtech/deepseek-r1t2-chimera:free' to be 'google/gemma-2-9b-it:free' // Object.is equality

[Killed] BlockStatement
src/core/settings.js:51:43
   /**
    * Save a single setting
    */
-  export function saveSetting(key, value) {
-    const settings = getSettings();
-    settings[key] = value;
-
-    try {
-      localStorage.setItem(SETTINGS_KEY, JSON.stringify(settings));
-    } catch (error) {
-      logger.error('Error saving setting', { key, error: error.message });
-    }
-  }
+  export function saveSetting(key, value) {}
 
   /**
killedBy: Model Service saveSelectedModel should save model to settings
statusReason: Cannot read properties of null (reading 'selectedModel')

[Killed] BlockStatement
src/core/settings.js:55:9
     const settings = getSettings();
     settings[key] = value;
 
-    try {
-      localStorage.setItem(SETTINGS_KEY, JSON.stringify(settings));
-    } catch (error) {
+    try {} catch (error) {
       logger.error('Error saving setting', { key, error: error.message });
     }
killedBy: Model Service saveSelectedModel should save model to settings
statusReason: Cannot read properties of null (reading 'selectedModel')

[Killed] BlockStatement
src/core/settings.js:57:21
 
     try {
       localStorage.setItem(SETTINGS_KEY, JSON.stringify(settings));
-    } catch (error) {
-      logger.error('Error saving setting', { key, error: error.message });
-    }
+    } catch (error) {}
   }
 
killedBy: Settings Utilities saveSetting should handle localStorage errors gracefully and log the error
statusReason: expected "error" to be called with arguments: [ 'Error saving setting', …(1) ]

Number of calls: 0

[Killed] StringLiteral
src/core/settings.js:58:20
     try {
       localStorage.setItem(SETTINGS_KEY, JSON.stringify(settings));
     } catch (error) {
-      logger.error('Error saving setting', { key, error: error.message });
+      logger.error("", { key, error: error.message });
     }
   }
killedBy: Settings Utilities saveSetting should handle localStorage errors gracefully and log the error
statusReason: expected "error" to be called with arguments: [ 'Error saving setting', …(1) ]

Received: 

  1st error call:

  [
-   "Error saving setting",

[Killed] BlockStatement
src/core/settings.js:65:45
   /**
    * Save multiple settings at once
    */
-  export function saveSettings(newSettings) {
-    const settings = { ...getSettings(), ...newSettings };
-
-    try {
-      localStorage.setItem(SETTINGS_KEY, JSON.stringify(settings));
-    } catch (error) {
-      logger.error('Error saving settings', { error: error.message });
-    }
-  }
+  export function saveSettings(newSettings) {}
killedBy: Settings Utilities saveSettings should save multiple settings at once
statusReason: Cannot read properties of null (reading 'defaultGradeLevel')

[Killed] ObjectLiteral
src/core/settings.js:66:22
    * Save multiple settings at once
    */
   export function saveSettings(newSettings) {
-    const settings = { ...getSettings(), ...newSettings };
+    const settings = {};
 
     try {
killedBy: Settings Utilities saveSettings should save multiple settings at once
statusReason: expected undefined to be 'high school' // Object.is equality

[Killed] BlockStatement
src/core/settings.js:70:21
 
     try {
       localStorage.setItem(SETTINGS_KEY, JSON.stringify(settings));
-    } catch (error) {
-      logger.error('Error saving settings', { error: error.message });
-    }
+    } catch (error) {}
   }
killedBy: Settings Utilities saveSettings should handle localStorage errors gracefully and log the error
statusReason: expected "error" to be called with arguments: [ 'Error saving settings', …(1) ]

Number of calls: 0

[Killed] ObjectLiteral
src/core/settings.js:71:45
     try {
       localStorage.setItem(SETTINGS_KEY, JSON.stringify(settings));
     } catch (error) {
-      logger.error('Error saving settings', { error: error.message });
+      logger.error('Error saving settings', {});
     }
   }
killedBy: Settings Utilities saveSettings should handle localStorage errors gracefully and log the error
statusReason: expected "error" to be called with arguments: [ 'Error saving settings', …(1) ]

Received: 

  1st error call:

  [
    "Error saving settings",
