[Killed] BlockStatement
src/core/state.js:4:19
   // State Manager - Centralized state for the app
 
   class AppState {
-    constructor() {
-      this.data = {
-        currentTopic: null,
-        currentGradeLevel: 'middle school',
-        currentQuestions: null,
-        currentAnswers: [],
-        currentScore: null,
-        lastSessionId: null,
-        // Continue chain - tracks questions across continues on same topic
-        continueChain: null  // { topic, continueCount, previousQuestions, startingGradeLevel }
-      };
-
-      this.listeners = [];  // Functions to call when state changes
-    }
+    constructor() {}
 
     /**
killedBy: AppState get and set should get default values
statusReason: Cannot read properties of undefined (reading 'forEach')

[Killed] BlockStatement
src/core/state.js:23:14
      * Get a state value
      * @param {string} key - State key to get
      */
-    get(key) {
-      return this.data[key];
-    }
+    get(key) {}
 
     /**
killedBy: AppState get and set should get default values
statusReason: expected undefined to be null

[Killed] BlockStatement
src/core/state.js:32:21
      * @param {string} key - State key to set
      * @param {*} value - Value to set
      */
-    set(key, value) {
-      this.data[key] = value;
-      this.notify(key, value);
-    }
+    set(key, value) {}
 
     /**
killedBy: AppState get and set should set and get values
statusReason: expected null to be 'Science' // Object.is equality

[Killed] BlockStatement
src/core/state.js:41:21
      * Update multiple state values at once
      * @param {Object} updates - Object with key-value pairs to update
      */
-    update(updates) {
-      Object.assign(this.data, updates);
-      this.notify('*', this.data);
-    }
+    update(updates) {}
 
     /**
killedBy: AppState update should update multiple values at once
statusReason: expected null to be 'History' // Object.is equality

[Killed] BlockStatement
src/core/state.js:57:24
     /**
      * Notify all listeners of state change
      */
-    notify(key, value) {
-      this.listeners.forEach(callback => callback(key, value));
-    }
+    notify(key, value) {}
 
     /**
killedBy: AppState subscribe and notify should notify subscribers on set
statusReason: expected "vi.fn()" to be called with arguments: [ 'currentTopic', 'Math' ]

Number of calls: 0

[Killed] ArrowFunction
src/core/state.js:58:30
      * Notify all listeners of state change
      */
     notify(key, value) {
-      this.listeners.forEach(callback => callback(key, value));
+      this.listeners.forEach(() => undefined);
     }
 
killedBy: AppState subscribe and notify should notify subscribers on set
statusReason: expected "vi.fn()" to be called with arguments: [ 'currentTopic', 'Math' ]

Number of calls: 0

[Killed] BlockStatement
src/core/state.js:64:13
     /**
      * Clear all state (useful for logout, reset)
      */
-    clear() {
-      this.data = {
-        currentTopic: null,
-        currentGradeLevel: 'middle school',
-        currentQuestions: null,
-        currentAnswers: [],
-        currentScore: null,
-        lastSessionId: null,
-        continueChain: null
-      };
-      this.notify('*', this.data);
-    }
+    clear() {}
 
     /**
killedBy: AppState clear should reset all values to defaults
statusReason: expected 'Physics' to be null

[Killed] StringLiteral
src/core/state.js:67:28
     clear() {
       this.data = {
         currentTopic: null,
-        currentGradeLevel: 'middle school',
+        currentGradeLevel: "",
         currentQuestions: null,
         currentAnswers: [],
killedBy: AppState get and set should get default values
statusReason: expected '' to be 'middle school' // Object.is equality

[Killed] StringLiteral
src/core/state.js:74:19
         lastSessionId: null,
         continueChain: null
       };
-      this.notify('*', this.data);
+      this.notify("", this.data);
     }
 
killedBy: AppState clear should notify subscribers on clear
statusReason: expected "vi.fn()" to be called with arguments: [ '*', Any<Object> ]

Received: 

  1st vi.fn() call:

  [
-   "*",

[Killed] BlockStatement
src/core/state.js:83:53
      * @param {string} gradeLevel - Starting grade level
      * @param {Array} questions - Initial questions
      */
-    initContinueChain(topic, gradeLevel, questions) {
-      this.data.continueChain = {
-        topic,
-        continueCount: 0,
-        previousQuestions: questions.map(q => q.question),
-        startingGradeLevel: gradeLevel
-      };
-    }
+    initContinueChain(topic, gradeLevel, questions) {}
 
     /**
killedBy: AppState continue chain should initialize continue chain
statusReason: expected null to deeply equal { topic: 'Math', …(3) }

[Killed] ConditionalExpression
src/core/state.js:97:11
      * @param {Array} questions - New questions to add
      */
     addToContinueChain(questions) {
-      if (this.data.continueChain) {
+      if (false) {
         this.data.continueChain.continueCount++;
         this.data.continueChain.previousQuestions.push(
killedBy: AppState continue chain should add to continue chain
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/state.js:97:36
      * @param {Array} questions - New questions to add
      */
     addToContinueChain(questions) {
-      if (this.data.continueChain) {
-        this.data.continueChain.continueCount++;
-        this.data.continueChain.previousQuestions.push(
-          ...questions.map(q => q.question)
-        );
-      }
+      if (this.data.continueChain) {}
     }
 
killedBy: AppState continue chain should add to continue chain
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/core/state.js:98:9
      */
     addToContinueChain(questions) {
       if (this.data.continueChain) {
-        this.data.continueChain.continueCount++;
+        this.data.continueChain.continueCount--;
         this.data.continueChain.previousQuestions.push(
           ...questions.map(q => q.question)
killedBy: AppState continue chain should add to continue chain
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ArrowFunction
src/core/state.js:100:28
       if (this.data.continueChain) {
         this.data.continueChain.continueCount++;
         this.data.continueChain.previousQuestions.push(
-          ...questions.map(q => q.question)
+          ...questions.map(() => undefined)
         );
       }
killedBy: AppState continue chain should add to continue chain
statusReason: expected [ 'What is 2+2?', …(2) ] to include 'What is 3+3?'

[Killed] BlockStatement
src/core/state.js:108:26
     /**
      * Clear the continue chain
      */
-    clearContinueChain() {
-      this.data.continueChain = null;
-    }
+    clearContinueChain() {}
 
     /**
killedBy: AppState continue chain should clear continue chain
statusReason: expected { topic: 'Math', …(3) } to be null

[Killed] BlockStatement
src/core/state.js:115:24
     /**
      * Get the continue chain data
      */
-    getContinueChain() {
-      return this.data.continueChain;
-    }
+    getContinueChain() {}
   }
 
killedBy: AppState continue chain should initialize continue chain
statusReason: expected undefined to deeply equal { topic: 'Math', …(3) }
