[Killed] StringLiteral
src/services/data-service.js:20:3
   'quizmaster_settings',
   'openrouter_models_cache',
   'i18nextLng',
-  'saberloop_telemetry_queue'
+  ""
 ];
 
killedBy: Data Service deleteAllUserData should clear localStorage keys
statusReason: expected "vi.fn()" to be called with arguments: [ 'saberloop_telemetry_queue' ]

Received: 

  1st vi.fn() call:

  [
-   "saberloop_telemetry_queue",

[Killed] StringLiteral
src/services/data-service.js:47:18
 
   try {
     // 1. Clear IndexedDB (largest, most important)
-    logger.debug('Clearing IndexedDB...');
+    logger.debug("");
     await clearAllUserData();
 
killedBy: Data Service deleteAllUserData should log debug messages for each step
statusReason: expected "vi.fn()" to be called with arguments: [ 'Clearing IndexedDB...' ]

Received: 

  1st vi.fn() call:

  [
-   "Clearing IndexedDB...",

[Killed] BlockStatement
src/services/data-service.js:52:43
 
     // 2. Clear localStorage
     logger.debug('Clearing localStorage...');
-    for (const key of LOCAL_STORAGE_KEYS) {
-      localStorage.removeItem(key);
-    }
+    for (const key of LOCAL_STORAGE_KEYS) {}
 
     // 3. Clear sessionStorage
killedBy: Data Service deleteAllUserData should clear localStorage keys
statusReason: expected "vi.fn()" to be called with arguments: [ 'quizmaster_settings' ]

Number of calls: 0

[Killed] BlockStatement
src/services/data-service.js:58:45
 
     // 3. Clear sessionStorage
     logger.debug('Clearing sessionStorage...');
-    for (const key of SESSION_STORAGE_KEYS) {
-      sessionStorage.removeItem(key);
-    }
+    for (const key of SESSION_STORAGE_KEYS) {}
 
     // 4. Reset in-memory state
killedBy: Data Service deleteAllUserData should clear sessionStorage keys
statusReason: expected "vi.fn()" to be called with arguments: [ 'openrouter_code_verifier' ]

Number of calls: 0

[Killed] BlockStatement
src/services/data-service.js:71:19
     await loadSamplesIfNeeded();
 
     logger.info('Data deletion complete');
-  } catch (error) {
-    logger.error('Data deletion failed', { error: error.message });
-    throw error;
-  }
+  } catch (error) {}
 }
 
killedBy: Data Service deleteAllUserData should throw and log error if deletion fails
statusReason: promise resolved "undefined" instead of rejecting
