[Killed] BlockStatement
src/utils/formatters.js:13:48
  * @param {Object} options - Intl.DateTimeFormat options
  * @returns {string} Formatted date string
  */
-export function formatDate(date, options = {}) {
-  const locale = getCurrentLanguage();
-  const defaultOptions = {
-    year: 'numeric',
-    month: 'short',
-    day: 'numeric'
-  };
-  return new Intl.DateTimeFormat(locale, { ...defaultOptions, ...options }).format(date);
-}
+export function formatDate(date, options = {}) {}
 
 /**
killedBy: Formatters formatDate should format date using Intl.DateTimeFormat with default options
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
src/utils/formatters.js:16:11
 export function formatDate(date, options = {}) {
   const locale = getCurrentLanguage();
   const defaultOptions = {
-    year: 'numeric',
+    year: "",
     month: 'short',
     day: 'numeric'
killedBy: Formatters formatDate should format date using Intl.DateTimeFormat with default options
statusReason: Value  out of range for Intl.DateTimeFormat options property year

[Killed] StringLiteral
src/utils/formatters.js:17:12
   const locale = getCurrentLanguage();
   const defaultOptions = {
     year: 'numeric',
-    month: 'short',
+    month: "",
     day: 'numeric'
   };
killedBy: Formatters formatDate should format date using Intl.DateTimeFormat with default options
statusReason: Value  out of range for Intl.DateTimeFormat options property month

[Killed] ArithmeticOperator
src/utils/formatters.js:37:18
   // Calculate difference in days (ignoring time)
   const today = new Date(now.getFullYear(), now.getMonth(), now.getDate());
   const target = new Date(dateObj.getFullYear(), dateObj.getMonth(), dateObj.getDate());
-  const diffMs = today.getTime() - target.getTime();
+  const diffMs = today.getTime() + target.getTime();
   const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));
 
killedBy: Formatters formatRelativeDate should return "Today" for today's date
statusReason: expected 'Jan 19, 2026' to be 'Today' // Object.is equality

[Killed] ArithmeticOperator
src/utils/formatters.js:38:41
   const today = new Date(now.getFullYear(), now.getMonth(), now.getDate());
   const target = new Date(dateObj.getFullYear(), dateObj.getMonth(), dateObj.getDate());
   const diffMs = today.getTime() - target.getTime();
-  const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));
+  const diffDays = Math.floor(diffMs / (1000 * 60 / 60 * 24));
 
   // Use translated strings for common cases
killedBy: Formatters formatRelativeDate should return "Yesterday" for yesterday's date
statusReason: expected 'Jan 18, 2026' to be 'Yesterday' // Object.is equality

[Killed] ArithmeticOperator
src/utils/formatters.js:38:41
   const today = new Date(now.getFullYear(), now.getMonth(), now.getDate());
   const target = new Date(dateObj.getFullYear(), dateObj.getMonth(), dateObj.getDate());
   const diffMs = today.getTime() - target.getTime();
-  const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));
+  const diffDays = Math.floor(diffMs / (1000 * 60 * 60 / 24));
 
   // Use translated strings for common cases
killedBy: Formatters formatRelativeDate should return "Yesterday" for yesterday's date
statusReason: expected 'Jan 18, 2026' to be 'Yesterday' // Object.is equality

[Killed] EqualityOperator
src/utils/formatters.js:41:7
   const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));
 
   // Use translated strings for common cases
-  if (diffDays === 0) return t('dates.today');
+  if (diffDays !== 0) return t('dates.today');
   if (diffDays === 1) return t('dates.yesterday');
 
killedBy: Formatters formatRelativeDate should return "Today" for today's date
statusReason: expected 'today' to be 'Today' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.js:41:7
   const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));
 
   // Use translated strings for common cases
-  if (diffDays === 0) return t('dates.today');
+  if (true) return t('dates.today');
   if (diffDays === 1) return t('dates.yesterday');
 
killedBy: Formatters formatRelativeDate should return "Yesterday" for yesterday's date
statusReason: expected 'Today' to be 'Yesterday' // Object.is equality

[Killed] EqualityOperator
src/utils/formatters.js:42:7
 
   // Use translated strings for common cases
   if (diffDays === 0) return t('dates.today');
-  if (diffDays === 1) return t('dates.yesterday');
+  if (diffDays !== 1) return t('dates.yesterday');
 
   // Use Intl.RelativeTimeFormat for recent dates
killedBy: Formatters formatRelativeDate should return "Yesterday" for yesterday's date
statusReason: expected 'yesterday' to be 'Yesterday' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.js:42:7
 
   // Use translated strings for common cases
   if (diffDays === 0) return t('dates.today');
-  if (diffDays === 1) return t('dates.yesterday');
+  if (false) return t('dates.yesterday');
 
   // Use Intl.RelativeTimeFormat for recent dates
killedBy: Formatters formatRelativeDate should return "Yesterday" for yesterday's date
statusReason: expected 'yesterday' to be 'Yesterday' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.js:45:7
   if (diffDays === 1) return t('dates.yesterday');
 
   // Use Intl.RelativeTimeFormat for recent dates
-  if (diffDays < 7) {
+  if (true) {
     const rtf = new Intl.RelativeTimeFormat(locale, { numeric: 'auto' });
     return rtf.format(-diffDays, 'day');
killedBy: Formatters formatRelativeDate should switch to weeks format at exactly 7 days
statusReason: expected '7 days ago' to contain 'week'

[Killed] EqualityOperator
src/utils/formatters.js:45:7
   if (diffDays === 1) return t('dates.yesterday');
 
   // Use Intl.RelativeTimeFormat for recent dates
-  if (diffDays < 7) {
+  if (diffDays <= 7) {
     const rtf = new Intl.RelativeTimeFormat(locale, { numeric: 'auto' });
     return rtf.format(-diffDays, 'day');
killedBy: Formatters formatRelativeDate should switch to weeks format at exactly 7 days
statusReason: expected '7 days ago' to contain 'week'

[Killed] ConditionalExpression
src/utils/formatters.js:51:7
   }
 
   // Use Intl.RelativeTimeFormat for weeks
-  if (diffDays < 30) {
+  if (false) {
     const weeks = Math.floor(diffDays / 7);
     const rtf = new Intl.RelativeTimeFormat(locale, { numeric: 'auto' });
killedBy: Formatters formatRelativeDate should switch to weeks format at exactly 7 days
statusReason: expected 'jan 12, 2026' to contain 'week'

[Killed] EqualityOperator
src/utils/formatters.js:51:7
   }
 
   // Use Intl.RelativeTimeFormat for weeks
-  if (diffDays < 30) {
+  if (diffDays <= 30) {
     const weeks = Math.floor(diffDays / 7);
     const rtf = new Intl.RelativeTimeFormat(locale, { numeric: 'auto' });
killedBy: Formatters formatRelativeDate should switch to formatted date at exactly 30 days
statusReason: expected '4 weeks ago' not to contain 'week'

[Killed] ArithmeticOperator
src/utils/formatters.js:52:30
 
   // Use Intl.RelativeTimeFormat for weeks
   if (diffDays < 30) {
-    const weeks = Math.floor(diffDays / 7);
+    const weeks = Math.floor(diffDays * 7);
     const rtf = new Intl.RelativeTimeFormat(locale, { numeric: 'auto' });
     return rtf.format(-weeks, 'week');
killedBy: Formatters formatRelativeDate should use Intl.RelativeTimeFormat for weeks
statusReason: expected '70 weeks ago' to contain 'last'

[Killed] ObjectLiteral
src/utils/formatters.js:53:53
   // Use Intl.RelativeTimeFormat for weeks
   if (diffDays < 30) {
     const weeks = Math.floor(diffDays / 7);
-    const rtf = new Intl.RelativeTimeFormat(locale, { numeric: 'auto' });
+    const rtf = new Intl.RelativeTimeFormat(locale, {});
     return rtf.format(-weeks, 'week');
   }
killedBy: Formatters formatRelativeDate should use Intl.RelativeTimeFormat for weeks
statusReason: expected '1 week ago' to contain 'last'

[Killed] UnaryOperator
src/utils/formatters.js:54:23
   if (diffDays < 30) {
     const weeks = Math.floor(diffDays / 7);
     const rtf = new Intl.RelativeTimeFormat(locale, { numeric: 'auto' });
-    return rtf.format(-weeks, 'week');
+    return rtf.format(+weeks, 'week');
   }
 
killedBy: Formatters formatRelativeDate should use Intl.RelativeTimeFormat for weeks
statusReason: expected 'next week' to contain 'last'

[Killed] StringLiteral
src/utils/formatters.js:54:31
   if (diffDays < 30) {
     const weeks = Math.floor(diffDays / 7);
     const rtf = new Intl.RelativeTimeFormat(locale, { numeric: 'auto' });
-    return rtf.format(-weeks, 'week');
+    return rtf.format(-weeks, "");
   }
 
killedBy: Formatters formatRelativeDate should switch to weeks format at exactly 7 days
statusReason: Invalid unit argument for Intl.RelativeTimeFormat.prototype.format() ''

[Killed] BlockStatement
src/utils/formatters.js:79:52
  * @param {boolean} [options.isRaw] - If true, value is already 0-100 scale
  * @returns {string} Formatted percentage string
  */
-export function formatPercent(value, options = {}) {
-  const locale = getCurrentLanguage();
-  const { isRaw = false, ...intlOptions } = options;
-
-  const normalizedValue = isRaw ? value / 100 : value;
-
-  return new Intl.NumberFormat(locale, {
-    style: 'percent',
-    minimumFractionDigits: 0,
-    maximumFractionDigits: 0,
-    ...intlOptions
-  }).format(normalizedValue);
-}
+export function formatPercent(value, options = {}) {}
 
killedBy: Formatters formatPercent should format decimal as percentage
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BooleanLiteral
src/utils/formatters.js:81:19
  */
 export function formatPercent(value, options = {}) {
   const locale = getCurrentLanguage();
-  const { isRaw = false, ...intlOptions } = options;
+  const { isRaw = true, ...intlOptions } = options;
 
   const normalizedValue = isRaw ? value / 100 : value;
killedBy: Formatters formatPercent should format decimal as percentage
statusReason: expected '1%' to contain '85'
