[Killed] ArrayDeclaration
src/utils/gradeProgression.js:9:29
  * Thresholds (cumulative): 2, 6, 14
  */
 
-export const GRADE_LEVELS = ['elementary', 'middle school', 'high school', 'college'];
+export const GRADE_LEVELS = [];
 
 // Cumulative continue counts at which to level up
killedBy: gradeProgression calculateNextGradeLevel should return next level after 2 continues
statusReason: expected 'middle school' to be 'high school' // Object.is equality

[Killed] ArrayDeclaration
src/utils/gradeProgression.js:12:39
 export const GRADE_LEVELS = ['elementary', 'middle school', 'high school', 'college'];
 
 // Cumulative continue counts at which to level up
-export const PROGRESSION_THRESHOLDS = [2, 6, 14];
+export const PROGRESSION_THRESHOLDS = [];
 
 /**
killedBy: gradeProgression calculateNextGradeLevel should return next level after 2 continues
statusReason: expected 'elementary' to be 'middle school' // Object.is equality

[Killed] BlockStatement
src/utils/gradeProgression.js:20:71
  * @param {string} startingLevel - The grade level when the chain started
  * @returns {string} The grade level for the next quiz
  */
-export function calculateNextGradeLevel(continueCount, startingLevel) {
-  const startingIndex = GRADE_LEVELS.indexOf(startingLevel);
-
-  // If starting level is not found, default to middle school
-  if (startingIndex === -1) {
-    return 'middle school';
-  }
-
-  // Count how many thresholds have been passed
-  let levelsToAdd = 0;
-  for (const threshold of PROGRESSION_THRESHOLDS) {
-    if (continueCount >= threshold) {
-      levelsToAdd++;
-    }
-  }
-
-  // Calculate new level, capped at college (index 3)
-  const newIndex = Math.min(startingIndex + levelsToAdd, GRADE_LEVELS.length - 1);
-
-  return GRADE_LEVELS[newIndex];
-}
+export function calculateNextGradeLevel(continueCount, startingLevel) {}
 
 /**
killedBy: gradeProgression calculateNextGradeLevel should return same level for 0-1 continues
statusReason: expected undefined to be 'middle school' // Object.is equality

[Killed] ConditionalExpression
src/utils/gradeProgression.js:24:7
   const startingIndex = GRADE_LEVELS.indexOf(startingLevel);
 
   // If starting level is not found, default to middle school
-  if (startingIndex === -1) {
+  if (false) {
     return 'middle school';
   }
killedBy: gradeProgression calculateNextGradeLevel should handle invalid starting level by defaulting to middle school
statusReason: expected undefined to be 'middle school' // Object.is equality

[Killed] UnaryOperator
src/utils/gradeProgression.js:24:25
   const startingIndex = GRADE_LEVELS.indexOf(startingLevel);
 
   // If starting level is not found, default to middle school
-  if (startingIndex === -1) {
+  if (startingIndex === +1) {
     return 'middle school';
   }
killedBy: gradeProgression calculateNextGradeLevel should return next level after 2 continues
statusReason: expected 'middle school' to be 'high school' // Object.is equality

[Killed] BlockStatement
src/utils/gradeProgression.js:30:51
 
   // Count how many thresholds have been passed
   let levelsToAdd = 0;
-  for (const threshold of PROGRESSION_THRESHOLDS) {
-    if (continueCount >= threshold) {
-      levelsToAdd++;
-    }
-  }
+  for (const threshold of PROGRESSION_THRESHOLDS) {}
 
   // Calculate new level, capped at college (index 3)
killedBy: gradeProgression calculateNextGradeLevel should return next level after 2 continues
statusReason: expected 'elementary' to be 'middle school' // Object.is equality

[Killed] EqualityOperator
src/utils/gradeProgression.js:31:9
   // Count how many thresholds have been passed
   let levelsToAdd = 0;
   for (const threshold of PROGRESSION_THRESHOLDS) {
-    if (continueCount >= threshold) {
+    if (continueCount < threshold) {
       levelsToAdd++;
     }
killedBy: gradeProgression calculateNextGradeLevel should return same level for 0-1 continues
statusReason: expected 'college' to be 'middle school' // Object.is equality

[Killed] ConditionalExpression
src/utils/gradeProgression.js:31:9
   // Count how many thresholds have been passed
   let levelsToAdd = 0;
   for (const threshold of PROGRESSION_THRESHOLDS) {
-    if (continueCount >= threshold) {
+    if (true) {
       levelsToAdd++;
     }
killedBy: gradeProgression calculateNextGradeLevel should return same level for 0-1 continues
statusReason: expected 'college' to be 'middle school' // Object.is equality

[Killed] ArithmeticOperator
src/utils/gradeProgression.js:37:58
   }
 
   // Calculate new level, capped at college (index 3)
-  const newIndex = Math.min(startingIndex + levelsToAdd, GRADE_LEVELS.length - 1);
+  const newIndex = Math.min(startingIndex + levelsToAdd, GRADE_LEVELS.length + 1);
 
   return GRADE_LEVELS[newIndex];
killedBy: gradeProgression calculateNextGradeLevel should cap at college level
statusReason: expected undefined to be 'college' // Object.is equality

[Killed] MethodExpression
src/utils/gradeProgression.js:37:20
   }
 
   // Calculate new level, capped at college (index 3)
-  const newIndex = Math.min(startingIndex + levelsToAdd, GRADE_LEVELS.length - 1);
+  const newIndex = Math.max(startingIndex + levelsToAdd, GRADE_LEVELS.length - 1);
 
   return GRADE_LEVELS[newIndex];
killedBy: gradeProgression calculateNextGradeLevel should return same level for 0-1 continues
statusReason: expected 'college' to be 'middle school' // Object.is equality

[Killed] ConditionalExpression
src/utils/gradeProgression.js:49:9
  */
 export function getContinuesUntilNextLevel(continueCount) {
   for (const threshold of PROGRESSION_THRESHOLDS) {
-    if (continueCount < threshold) {
+    if (false) {
       return threshold - continueCount;
     }
killedBy: gradeProgression getContinuesUntilNextLevel should return continues until first threshold
statusReason: expected null to be 2 // Object.is equality

[Killed] EqualityOperator
src/utils/gradeProgression.js:49:9
  */
 export function getContinuesUntilNextLevel(continueCount) {
   for (const threshold of PROGRESSION_THRESHOLDS) {
-    if (continueCount < threshold) {
+    if (continueCount >= threshold) {
       return threshold - continueCount;
     }
killedBy: gradeProgression getContinuesUntilNextLevel should return continues until first threshold
statusReason: expected null to be 2 // Object.is equality

[Killed] ArithmeticOperator
src/utils/gradeProgression.js:50:14
 export function getContinuesUntilNextLevel(continueCount) {
   for (const threshold of PROGRESSION_THRESHOLDS) {
     if (continueCount < threshold) {
-      return threshold - continueCount;
+      return threshold + continueCount;
     }
   }
killedBy: gradeProgression getContinuesUntilNextLevel should return continues until first threshold
statusReason: expected 3 to be 1 // Object.is equality
