[Survived] StringLiteral
src/utils/shuffle.js:10:39
  * Standard answer option labels (A, B, C, D)
  * @type {readonly string[]}
  */
-const OPTION_LABELS = ['A', 'B', 'C', 'D'];
+const OPTION_LABELS = ['A', 'B', 'C', ""];
 
 /**

[Survived] StringLiteral
src/utils/shuffle.js:10:24
  * Standard answer option labels (A, B, C, D)
  * @type {readonly string[]}
  */
-const OPTION_LABELS = ['A', 'B', 'C', 'D'];
+const OPTION_LABELS = ["", 'B', 'C', 'D'];
 
 /**

[Killed] Regex
src/utils/shuffle.js:17:24
  * Handles formats: "A) text", "A. text", "a) text", "a. text"
  * @type {RegExp}
  */
-const PREFIX_PATTERN = /^[A-Da-d][).]\s*/;
+const PREFIX_PATTERN = /^[A-Da-d][^).]\s*/;
 
 /**
killedBy: shuffleQuestionOptions should preserve all option content (just reordered with normalized labels)
statusReason: expected [ 'A) 3', 'B) 4', 'C) 5', 'D) 6' ] to deeply equal [ '3', '4', '5', '6' ]

[Killed] BlockStatement
src/utils/shuffle.js:28:37
  * stripPrefix('b. London') // returns 'London'
  * stripPrefix('Berlin') // returns 'Berlin'
  */
-export function stripPrefix(option) {
-  if (typeof option !== 'string') return option;
-  return option.replace(PREFIX_PATTERN, '');
-}
+export function stripPrefix(option) {}
 
 /**
killedBy: shuffleQuestionOptions should preserve all option content (just reordered with normalized labels)
statusReason: expected [ 'undefined', 'undefined', …(2) ] to deeply equal [ '3', '4', '5', '6' ]

[Killed] ConditionalExpression
src/utils/shuffle.js:29:7
  * stripPrefix('Berlin') // returns 'Berlin'
  */
 export function stripPrefix(option) {
-  if (typeof option !== 'string') return option;
+  if (true) return option;
   return option.replace(PREFIX_PATTERN, '');
 }
killedBy: shuffleQuestionOptions should preserve all option content (just reordered with normalized labels)
statusReason: expected [ 'A) 3', 'B) 4', 'C) 5', 'D) 6' ] to deeply equal [ '3', '4', '5', '6' ]

[Killed] EqualityOperator
src/utils/shuffle.js:29:7
  * stripPrefix('Berlin') // returns 'Berlin'
  */
 export function stripPrefix(option) {
-  if (typeof option !== 'string') return option;
+  if (typeof option === 'string') return option;
   return option.replace(PREFIX_PATTERN, '');
 }
killedBy: shuffleQuestionOptions should preserve all option content (just reordered with normalized labels)
statusReason: expected [ 'A) 3', 'B) 4', 'C) 5', 'D) 6' ] to deeply equal [ '3', '4', '5', '6' ]

[Killed] BlockStatement
src/utils/shuffle.js:42:42
  * addPrefix('Paris', 0) // returns 'A) Paris'
  * addPrefix('London', 1) // returns 'B) London'
  */
-export function addPrefix(option, index) {
-  const label = OPTION_LABELS[index] || String.fromCharCode(65 + index);
-  return `${label}) ${option}`;
-}
+export function addPrefix(option, index) {}
 
 /**
killedBy: shuffleQuestionOptions should preserve all option content (just reordered with normalized labels)
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] LogicalOperator
src/utils/shuffle.js:43:17
  * addPrefix('London', 1) // returns 'B) London'
  */
 export function addPrefix(option, index) {
-  const label = OPTION_LABELS[index] || String.fromCharCode(65 + index);
+  const label = OPTION_LABELS[index] && String.fromCharCode(65 + index);
   return `${label}) ${option}`;
 }
killedBy: addPrefix should handle index beyond D (uses ASCII)
statusReason: expected 'undefined) Rome' to be 'E) Rome' // Object.is equality

[Killed] ArithmeticOperator
src/utils/shuffle.js:43:61
  * addPrefix('London', 1) // returns 'B) London'
  */
 export function addPrefix(option, index) {
-  const label = OPTION_LABELS[index] || String.fromCharCode(65 + index);
+  const label = OPTION_LABELS[index] || String.fromCharCode(65 - index);
   return `${label}) ${option}`;
 }
killedBy: addPrefix should handle index beyond D (uses ASCII)
statusReason: expected '=) Rome' to be 'E) Rome' // Object.is equality

[Killed] BlockStatement
src/utils/shuffle.js:53:36
  * @param {Array} array - Array to shuffle
  * @returns {Array} - New shuffled array
  */
-function fisherYatesShuffle(array) {
-  const shuffled = [...array];
-  for (let i = shuffled.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1));
-    [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
-  }
-  return shuffled;
-}
+function fisherYatesShuffle(array) {}
 
 /**
killedBy: shuffleQuestionOptions should return a new object (not mutate original)
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/utils/shuffle.js:55:49
  */
 function fisherYatesShuffle(array) {
   const shuffled = [...array];
-  for (let i = shuffled.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1));
-    [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
-  }
+  for (let i = shuffled.length - 1; i > 0; i--) {}
   return shuffled;
 }
killedBy: shuffleQuestionOptions should produce different orderings over multiple calls (statistical)
statusReason: expected 1 to be greater than 1

[Killed] ConditionalExpression
src/utils/shuffle.js:55:37
  */
 function fisherYatesShuffle(array) {
   const shuffled = [...array];
-  for (let i = shuffled.length - 1; i > 0; i--) {
+  for (let i = shuffled.length - 1; false; i--) {
     const j = Math.floor(Math.random() * (i + 1));
     [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
killedBy: shuffleQuestionOptions should produce different orderings over multiple calls (statistical)
statusReason: expected 1 to be greater than 1

[Killed] ArithmeticOperator
src/utils/shuffle.js:56:26
 function fisherYatesShuffle(array) {
   const shuffled = [...array];
   for (let i = shuffled.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1));
+    const j = Math.floor(Math.random() / (i + 1));
     [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
   }
killedBy: shuffleQuestionOptions should produce different orderings over multiple calls (statistical)
statusReason: expected 1 to be greater than 1

[Survived] ArithmeticOperator
src/utils/shuffle.js:56:43
 function fisherYatesShuffle(array) {
   const shuffled = [...array];
   for (let i = shuffled.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1));
+    const j = Math.floor(Math.random() * (i - 1));
     [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
   }

[Killed] BooleanLiteral
src/utils/shuffle.js:78:7
   const { options, correct, ...rest } = question;
 
   // Handle edge cases
-  if (!options || options.length === 0) {
+  if (options || options.length === 0) {
     return question;
   }
killedBy: shuffleQuestionOptions should return a new object (not mutate original)
statusReason: expected { question: 'What is 2 + 2?', …(3) } not to be { question: 'What is 2 + 2?', …(3) } // Object.is equality

[Killed] ConditionalExpression
src/utils/shuffle.js:78:7
   const { options, correct, ...rest } = question;
 
   // Handle edge cases
-  if (!options || options.length === 0) {
+  if (true) {
     return question;
   }
killedBy: shuffleQuestionOptions should return a new object (not mutate original)
statusReason: expected { question: 'What is 2 + 2?', …(3) } not to be { question: 'What is 2 + 2?', …(3) } // Object.is equality

[Killed] ConditionalExpression
src/utils/shuffle.js:82:7
     return question;
   }
 
-  if (options.length === 1) {
+  if (false) {
     return question;
   }
killedBy: shuffleQuestionOptions should handle question with single option
statusReason: expected { question: 'Only one option?', …(2) } to be { question: 'Only one option?', …(2) } // Object.is equality

[Killed] ConditionalExpression
src/utils/shuffle.js:82:7
     return question;
   }
 
-  if (options.length === 1) {
+  if (true) {
     return question;
   }
killedBy: shuffleQuestionOptions should return a new object (not mutate original)
statusReason: expected { question: 'What is 2 + 2?', …(3) } not to be { question: 'What is 2 + 2?', …(3) } // Object.is equality

[Killed] ArrowFunction
src/utils/shuffle.js:87:36
   }
 
   // Strip existing prefixes to get clean answer text
-  const cleanOptions = options.map(opt => stripPrefix(opt));
+  const cleanOptions = options.map(() => undefined);
 
   // Create indices array and shuffle it
killedBy: shuffleQuestionOptions should preserve all option content (just reordered with normalized labels)
statusReason: expected [ 'undefined', 'undefined', …(2) ] to deeply equal [ '3', '4', '5', '6' ]

[Killed] ArrowFunction
src/utils/shuffle.js:90:31
   const cleanOptions = options.map(opt => stripPrefix(opt));
 
   // Create indices array and shuffle it
-  const indices = options.map((_, i) => i);
+  const indices = options.map(() => undefined);
   const shuffledIndices = fisherYatesShuffle(indices);
 
killedBy: shuffleQuestionOptions should preserve all option content (just reordered with normalized labels)
statusReason: expected [ 'undefined', 'undefined', …(2) ] to deeply equal [ '3', '4', '5', '6' ]

[Killed] ArrowFunction
src/utils/shuffle.js:94:47
   const shuffledIndices = fisherYatesShuffle(indices);
 
   // Reorder clean options based on shuffled indices, then add sequential labels
-  const shuffledOptions = shuffledIndices.map((originalIndex, newIndex) =>
-    addPrefix(cleanOptions[originalIndex], newIndex)
+  const shuffledOptions = shuffledIndices.map(() => undefined
   );
 
killedBy: shuffleQuestionOptions should preserve all option content (just reordered with normalized labels)
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/utils/shuffle.js:115:48
  * @param {Array<Object>} questions - Array of question objects
  * @returns {Array<Object>} - New array with shuffled options in each question
  */
-export function shuffleAllQuestions(questions) {
-  if (!questions || !Array.isArray(questions)) {
-    return questions;
-  }
-
-  return questions.map(q => shuffleQuestionOptions(q));
-}
+export function shuffleAllQuestions(questions) {}
 
 /**
killedBy: shuffleAllQuestions should shuffle each question independently
statusReason: Target cannot be null or undefined.

[Killed] BooleanLiteral
src/utils/shuffle.js:116:7
  * @returns {Array<Object>} - New array with shuffled options in each question
  */
 export function shuffleAllQuestions(questions) {
-  if (!questions || !Array.isArray(questions)) {
+  if (questions || !Array.isArray(questions)) {
     return questions;
   }
killedBy: shuffleAllQuestions should return a new array
statusReason: expected [ { question: 'Q1?', …(2) }, …(1) ] not to be [ { question: 'Q1?', …(2) }, …(1) ] // Object.is equality

[Killed] ConditionalExpression
src/utils/shuffle.js:116:7
  * @returns {Array<Object>} - New array with shuffled options in each question
  */
 export function shuffleAllQuestions(questions) {
-  if (!questions || !Array.isArray(questions)) {
+  if (false) {
     return questions;
   }
killedBy: shuffleAllQuestions should handle null/undefined
statusReason: Cannot read properties of null (reading 'map')

[Killed] ArrowFunction
src/utils/shuffle.js:120:24
     return questions;
   }
 
-  return questions.map(q => shuffleQuestionOptions(q));
+  return questions.map(() => undefined);
 }
 
killedBy: shuffleAllQuestions should shuffle each question independently
statusReason: Cannot read properties of undefined (reading 'options')

[Killed] BooleanLiteral
src/utils/shuffle.js:132:7
  * @returns {{shuffledOptions: Array<string>, shuffleMap: Array<number>, newCorrectIndex: number}}
  */
 export function shuffleOptions(options, correctIndex) {
-  if (!options || options.length === 0) {
+  if (options || options.length === 0) {
     return {
       shuffledOptions: options || [],
killedBy: shuffleOptions should provide valid shuffleMap
statusReason: expected [] to have a length of 4 but got +0

[Killed] BlockStatement
src/utils/shuffle.js:132:41
  * @returns {{shuffledOptions: Array<string>, shuffleMap: Array<number>, newCorrectIndex: number}}
  */
 export function shuffleOptions(options, correctIndex) {
-  if (!options || options.length === 0) {
-    return {
-      shuffledOptions: options || [],
-      shuffleMap: [],
-      newCorrectIndex: correctIndex
-    };
-  }
+  if (!options || options.length === 0) {}
 
   // Strip existing prefixes to get clean answer text
killedBy: shuffleOptions should handle empty options array
statusReason: expected -1 to be +0 // Object.is equality

[Killed] ObjectLiteral
src/utils/shuffle.js:133:12
  */
 export function shuffleOptions(options, correctIndex) {
   if (!options || options.length === 0) {
-    return {
-      shuffledOptions: options || [],
-      shuffleMap: [],
-      newCorrectIndex: correctIndex
-    };
+    return {};
   }
 
killedBy: shuffleOptions should handle empty options array
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/utils/shuffle.js:134:24
 export function shuffleOptions(options, correctIndex) {
   if (!options || options.length === 0) {
     return {
-      shuffledOptions: options || [],
+      shuffledOptions: false,
       shuffleMap: [],
       newCorrectIndex: correctIndex
killedBy: shuffleOptions should handle empty options array
statusReason: expected false to deeply equal []

[Killed] ConditionalExpression
src/utils/shuffle.js:134:24
 export function shuffleOptions(options, correctIndex) {
   if (!options || options.length === 0) {
     return {
-      shuffledOptions: options || [],
+      shuffledOptions: true,
       shuffleMap: [],
       newCorrectIndex: correctIndex
killedBy: shuffleOptions should handle empty options array
statusReason: expected true to deeply equal []

[Killed] ObjectLiteral
src/utils/shuffle.js:156:10
   // Find new position of correct answer
   const newCorrectIndex = shuffledIndices.indexOf(correctIndex);
 
-  return {
-    shuffledOptions,
-    shuffleMap: shuffledIndices,
-    newCorrectIndex
-  };
+  return {};
 }
 
killedBy: shuffleOptions should return shuffled options with correct structure
statusReason: expected {} to have property "shuffledOptions"
